gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define PICO_RP2350_A2_SUPPORTED 1
#define CYW43_DEFAULT_PIN_WL_REG_ON 23
#define CYW43_DEFAULT_PIN_WL_DATA_OUT 24
#define CYW43_DEFAULT_PIN_WL_DATA_IN 24
#define CYW43_DEFAULT_PIN_WL_HOST_WAKE 24
#define CYW43_DEFAULT_PIN_WL_CLOCK 29
#define CYW43_DEFAULT_PIN_WL_CS 25u
#define CYW43_WL_GPIO_COUNT 3
#define CYW43_WL_GPIO_LED_PIN 0
#define CYW43_WL_GPIO_VBUS_PIN 2
#define CYW43_USES_VSYS_PIN 1
#define _CMSIS_RENAME_EXCEPTIONS_H 
#define _PICO_PLATFORM_H 
#define _PICO_PLATFORM_COMPILER_H 
#define _HARDWARE_PLATFORM_DEFS_H 
#define _u(x) x ## u
#define NUM_CORES 2u
#define NUM_DMA_CHANNELS 16u
#define NUM_DMA_TIMERS 4u
#define NUM_DMA_MPU_REGIONS 8u
#define NUM_DMA_IRQS 4u
#define NUM_IRQS 52u
#define NUM_USER_IRQS 6u
#define NUM_PIOS 3u
#define NUM_PIO_STATE_MACHINES 4u
#define NUM_PIO_IRQS 2u
#define NUM_PWM_SLICES 12u
#define NUM_PWM_IRQS 2u
#define NUM_SPIN_LOCKS 32u
#define NUM_UARTS 2u
#define NUM_I2CS 2u
#define NUM_SPIS 2u
#define NUM_GENERIC_TIMERS 2u
#define NUM_ALARMS 4u
#define NUM_ADC_CHANNELS 9u
#define ADC_BASE_PIN 40u
#define NUM_RESETS 28u
#define NUM_DOORBELLS 8u
#define NUM_BANK0_GPIOS 48u
#define NUM_QSPI_GPIOS 6u
#define NUM_OTP_PAGES 64u
#define NUM_OTP_PAGE_ROWS 64u
#define NUM_OTP_ROWS (NUM_OTP_PAGES * NUM_OTP_PAGE_ROWS)
#define PIO_INSTRUCTION_COUNT 32u
#define NUM_MPU_REGIONS 8u
#define NUM_SAU_REGIONS 8u
#define NUM_BOOT_LOCKS 8u
#define BOOTRAM_SIZE 0x400u
#define USBCTRL_DPRAM_SIZE 4096u
#define HAS_GPIO_COPROCESSOR 1
#define HAS_DOUBLE_COPROCESSOR 1
#define HAS_REDUNDANCY_COPROCESSOR 1
#define HAS_POWMAN_TIMER 1
#define HAS_RP2350_TRNG 1
#define HAS_HSTX 1
#define HAS_PADS_BANK0_ISOLATION 1
#define __RISCV_PMP_CHECKED 1
#define FPGA_CLK_SYS_HZ (48 * MHZ)
#define FPGA_CLK_REF_HZ (12 * MHZ)
#define XOSC_HZ 12000000u
#define PICO_USE_FASTEST_SUPPORTED_CLOCK 0
#define SYS_CLK_HZ 150000000u
#define USB_CLK_HZ 48000000u
#define XOSC_KHZ (XOSC_HZ / 1000)
#define XOSC_MHZ (XOSC_KHZ / 1000)
#define SYS_CLK_KHZ (SYS_CLK_HZ / 1000)
#define SYS_CLK_MHZ (SYS_CLK_KHZ / 1000)
#define USB_CLK_KHZ (USB_CLK_HZ / 1000)
#define USB_CLK_MHZ (USB_CLK_KHZ / 1000)
#define ACCESSCTRL_PASSWORD_BITS 0xacce0000u
#define POWMAN_PASSWORD_BITS 0x5afe0000u
#define VTABLE_FIRST_IRQ 16
#define FIRST_USER_IRQ (NUM_IRQS - NUM_USER_IRQS)
#define REG_FIELD_WIDTH(f) (f ## _MSB + 1 - f ## _LSB)
#define _SYS_CDEFS_H_ 
#define __PMT(args) args
#define __DOTS , ...
#define __THROW 
#define __ASMNAME(cname) __XSTRING (__USER_LABEL_PREFIX__) cname
#define __ptr_t void *
#define __long_double_t long double
#define __attribute_malloc__ 
#define __attribute_pure__ 
#define __attribute_format_strfmon__(a,b) 
#define __flexarr [0]
#define __bounded 
#define __unbounded 
#define __ptrvalue 
#define __BEGIN_DECLS 
#define __END_DECLS 
#define __GNUCLIKE_ASM 3
#define __GNUCLIKE_MATH_BUILTIN_CONSTANTS 
#define __GNUCLIKE___TYPEOF 1
#define __GNUCLIKE___SECTION 1
#define __GNUCLIKE_CTOR_SECTION_HANDLING 1
#define __GNUCLIKE_BUILTIN_CONSTANT_P 1
#define __GNUCLIKE_BUILTIN_VARARGS 1
#define __GNUCLIKE_BUILTIN_STDARG 1
#define __GNUCLIKE_BUILTIN_VAALIST 1
#define __GNUC_VA_LIST_COMPATIBILITY 1
#define __compiler_membar() __asm __volatile(" " : : : "memory")
#define __GNUCLIKE_BUILTIN_NEXT_ARG 1
#define __GNUCLIKE_MATH_BUILTIN_RELOPS 
#define __GNUCLIKE_BUILTIN_MEMCPY 1
#define __CC_SUPPORTS_INLINE 1
#define __CC_SUPPORTS___INLINE 1
#define __CC_SUPPORTS___INLINE__ 1
#define __CC_SUPPORTS___FUNC__ 1
#define __CC_SUPPORTS_WARNING 1
#define __CC_SUPPORTS_VARADIC_XXX 1
#define __CC_SUPPORTS_DYNAMIC_ARRAY_INIT 1
#define __P(protos) protos
#define __CONCAT1(x,y) x ## y
#define __CONCAT(x,y) __CONCAT1(x,y)
#define __STRING(x) #x
#define __XSTRING(x) __STRING(x)
#define __const const
#define __signed signed
#define __volatile volatile
#define __weak_symbol __attribute__((__weak__))
#define __dead2 __attribute__((__noreturn__))
#define __pure2 __attribute__((__const__))
#define __unused __attribute__((__unused__))
#define __used __attribute__((__used__))
#define __packed __attribute__((__packed__))
#define __aligned(x) __attribute__((__aligned__(x)))
#define __section(x) __attribute__((__section__(x)))
#define __alloc_size(x) __attribute__((__alloc_size__(x)))
#define __alloc_size2(n,x) __attribute__((__alloc_size__(n, x)))
#define __alloc_align(x) __attribute__((__alloc_align__(x)))
#define __generic(expr,t,yes,no) _Generic(expr, t: yes, default: no)
#define __min_size(x) static (x)
#define __malloc_like __attribute__((__malloc__))
#define __pure __attribute__((__pure__))
#define __always_inline __inline__ __attribute__((__always_inline__))
#define __noinline __attribute__ ((__noinline__))
#define __nonnull(x) __attribute__((__nonnull__ x))
#define __nonnull_all __attribute__((__nonnull__))
#define __fastcall __attribute__((__fastcall__))
#define __result_use_check __attribute__((__warn_unused_result__))
#define __returns_twice __attribute__((__returns_twice__))
#define __unreachable() __builtin_unreachable()
#define __restrict restrict
#define __restrict_arr restrict
#define __predict_true(exp) __builtin_expect((exp), 1)
#define __predict_false(exp) __builtin_expect((exp), 0)
#define __null_sentinel __attribute__((__sentinel__))
#define __exported __attribute__((__visibility__("default")))
#define __hidden __attribute__((__visibility__("hidden")))
#define __offsetof(type,field) offsetof(type, field)
#define __rangeof(type,start,end) (__offsetof(type, end) - __offsetof(type, start))
#define __containerof(x,s,m) ({ const volatile __typeof(((s *)0)->m) *__x = (x); __DEQUALIFY(s *, (const volatile char *)__x - __offsetof(s, m));})
#define __printflike(fmtarg,firstvararg) __attribute__((__format__ (__printf__, fmtarg, firstvararg)))
#define __scanflike(fmtarg,firstvararg) __attribute__((__format__ (__scanf__, fmtarg, firstvararg)))
#define __format_arg(fmtarg) __attribute__((__format_arg__ (fmtarg)))
#define __strfmonlike(fmtarg,firstvararg) __attribute__((__format__ (__strfmon__, fmtarg, firstvararg)))
#define __strftimelike(fmtarg,firstvararg) __attribute__((__format__ (__strftime__, fmtarg, firstvararg)))
#define __printf0like(fmtarg,firstvararg) 
#define __strong_reference(sym,aliassym) extern __typeof (sym) aliassym __attribute__ ((__alias__ (#sym)))
#define __weak_reference(sym,alias) __asm__(".weak " #alias); __asm__(".equ " #alias ", " #sym)
#define __warn_references(sym,msg) __asm__(".section .gnu.warning." #sym); __asm__(".asciz \"" msg "\""); __asm__(".previous")
#define __sym_compat(sym,impl,verid) __asm__(".symver " #impl ", " #sym "@" #verid)
#define __sym_default(sym,impl,verid) __asm__(".symver " #impl ", " #sym "@@" #verid)
#define __FBSDID(s) struct __hack
#define __RCSID(s) struct __hack
#define __RCSID_SOURCE(s) struct __hack
#define __SCCSID(s) struct __hack
#define __COPYRIGHT(s) struct __hack
#define __DECONST(type,var) ((type)(__uintptr_t)(const void *)(var))
#define __DEVOLATILE(type,var) ((type)(__uintptr_t)(volatile void *)(var))
#define __DEQUALIFY(type,var) ((type)(__uintptr_t)(const volatile void *)(var))
#define _Nonnull 
#define _Nullable 
#define _Null_unspecified 
#define __NULLABILITY_PRAGMA_PUSH 
#define __NULLABILITY_PRAGMA_POP 
#define __arg_type_tag(arg_kind,arg_idx,type_tag_idx) 
#define __datatype_type_tag(kind,type) 
#define __lock_annotate(x) 
#define __lockable __lock_annotate(lockable)
#define __locks_exclusive(...) __lock_annotate(exclusive_lock_function(__VA_ARGS__))
#define __locks_shared(...) __lock_annotate(shared_lock_function(__VA_ARGS__))
#define __trylocks_exclusive(...) __lock_annotate(exclusive_trylock_function(__VA_ARGS__))
#define __trylocks_shared(...) __lock_annotate(shared_trylock_function(__VA_ARGS__))
#define __unlocks(...) __lock_annotate(unlock_function(__VA_ARGS__))
#define __asserts_exclusive(...) __lock_annotate(assert_exclusive_lock(__VA_ARGS__))
#define __asserts_shared(...) __lock_annotate(assert_shared_lock(__VA_ARGS__))
#define __requires_exclusive(...) __lock_annotate(exclusive_locks_required(__VA_ARGS__))
#define __requires_shared(...) __lock_annotate(shared_locks_required(__VA_ARGS__))
#define __requires_unlocked(...) __lock_annotate(locks_excluded(__VA_ARGS__))
#define __no_lock_analysis __lock_annotate(no_thread_safety_analysis)
#define __nosanitizeaddress 
#define __nosanitizememory 
#define __nosanitizethread 
#define __guarded_by(x) __lock_annotate(guarded_by(x))
#define __pt_guarded_by(x) __lock_annotate(pt_guarded_by(x))
#define __builtin_is_aligned(x,align) (((__uintptr_t)x & ((align) - 1)) == 0)
#define __builtin_align_up(x,align) ((__typeof__(x))(((__uintptr_t)(x)+((align)-1))&(~((align)-1))))
#define __builtin_align_down(x,align) ((__typeof__(x))((x)&(~((align)-1))))
#define __align_up(x,y) __builtin_align_up(x, y)
#define __align_down(x,y) __builtin_align_down(x, y)
#define __is_aligned(x,y) __builtin_is_aligned(x, y)
#define PICO_C_COMPILER_IS_GNU 1
#define __weak __attribute__((weak))
#define GCC_Like_Pragma _Pragma
#define Clang_Pragma(x) 
#define GCC_Pragma _Pragma
#define __isr 
#define __packed_aligned __packed __aligned(4)
#define __force_inline __always_inline
#define count_of(a) (sizeof(a)/sizeof((a)[0]))
#define MAX(a,b) ((a)>(b)?(a):(b))
#define MIN(a,b) ((b)>(a)?(a):(b))
#define pico_default_asm(...) __asm (".syntax unified\n" __VA_ARGS__)
#define pico_default_asm_volatile(...) __asm volatile (".syntax unified\n" __VA_ARGS__)
#define pico_default_asm_goto(...) __asm goto (".syntax unified\n" __VA_ARGS__)
#define pico_default_asm_volatile_goto(...) __asm volatile goto (".syntax unified\n" __VA_ARGS__)
__inline__ __attribute__((__always_inline__)) static void __compiler_memory_barrier(void) {
    __asm volatile (".syntax unified\n" "" : : : "memory");
}
#define __check_type_compatible(type_a,type_b) static_assert(__builtin_types_compatible_p(type_a, type_b), __STRING(type_a) " is not compatible with " __STRING(type_b));
#define WRAPPER_FUNC(x) __wrap_ ## x
#define REAL_FUNC(x) __real_ ## x
#define _PICO_PLATFORM_SECTION_MACROS_H 
#define __after_data(group) __attribute__((section(".after_data." group)))
#define __not_in_flash(group) __attribute__((section(".time_critical." group)))
#define __scratch_x(group) __attribute__((section(".scratch_x." group)))
#define __scratch_y(group) __attribute__((section(".scratch_y." group)))
#define __uninitialized_ram(group) __attribute__((section(".uninitialized_data." #group))) group
#define __in_flash(group) __attribute__((section(".flashdata." group)))
#define __not_in_flash_func(func_name) __not_in_flash(__STRING(func_name)) func_name
#define __time_critical_func(func_name) __not_in_flash_func(func_name)
#define __no_inline_not_in_flash_func(func_name) __noinline __not_in_flash_func(func_name)
#define _PICO_PLATFORM_PANIC_H 
void __attribute__((noreturn)) panic_unsupported(void);
void __attribute__((noreturn)) panic(const char *fmt, ...);
#define panic_compact(...) panic("")
#define _PICO_PLATFORM_COMMON_H 
#define PICO_MINIMAL_STORED_VECTOR_TABLE 0
#define PICO_NUM_VTABLE_IRQS NUM_IRQS
#define PICO_NO_FPGA_CHECK 1
#define PICO_NO_SIM_CHECK 1
static inline _Bool running_on_fpga(void) {return 0;}
static inline _Bool running_in_sim(void) {return 0;}
static __inline__ __attribute__((__always_inline__)) void tight_loop_contents(void) {}
#define host_safe_hw_ptr(x) ((uintptr_t)(x))
#define native_safe_hw_ptr(x) host_safe_hw_ptr(x)
#define _ADDRESSMAP_H 
#define REG_ALIAS_RW_BITS (0x0u << 12u)
#define REG_ALIAS_XOR_BITS (0x1u << 12u)
#define REG_ALIAS_SET_BITS (0x2u << 12u)
#define REG_ALIAS_CLR_BITS (0x3u << 12u)
#define ROM_BASE 0x00000000u
#define XIP_BASE 0x10000000u
#define XIP_SRAM_BASE 0x13ffc000u
#define XIP_END 0x14000000u
#define XIP_NOCACHE_NOALLOC_BASE 0x14000000u
#define XIP_SRAM_END 0x14000000u
#define XIP_NOCACHE_NOALLOC_END 0x18000000u
#define XIP_MAINTENANCE_BASE 0x18000000u
#define XIP_NOCACHE_NOALLOC_NOTRANSLATE_BASE 0x1c000000u
#define SRAM0_BASE 0x20000000u
#define XIP_NOCACHE_NOALLOC_NOTRANSLATE_END 0x20000000u
#define SRAM_BASE 0x20000000u
#define SRAM_STRIPED_BASE 0x20000000u
#define SRAM4_BASE 0x20040000u
#define SRAM8_BASE 0x20080000u
#define SRAM_STRIPED_END 0x20080000u
#define SRAM_SCRATCH_X_BASE 0x20080000u
#define SRAM9_BASE 0x20081000u
#define SRAM_SCRATCH_Y_BASE 0x20081000u
#define SRAM_END 0x20082000u
#define SYSINFO_BASE 0x40000000u
#define SYSCFG_BASE 0x40008000u
#define CLOCKS_BASE 0x40010000u
#define PSM_BASE 0x40018000u
#define RESETS_BASE 0x40020000u
#define IO_BANK0_BASE 0x40028000u
#define IO_QSPI_BASE 0x40030000u
#define PADS_BANK0_BASE 0x40038000u
#define PADS_QSPI_BASE 0x40040000u
#define XOSC_BASE 0x40048000u
#define PLL_SYS_BASE 0x40050000u
#define PLL_USB_BASE 0x40058000u
#define ACCESSCTRL_BASE 0x40060000u
#define BUSCTRL_BASE 0x40068000u
#define UART0_BASE 0x40070000u
#define UART1_BASE 0x40078000u
#define SPI0_BASE 0x40080000u
#define SPI1_BASE 0x40088000u
#define I2C0_BASE 0x40090000u
#define I2C1_BASE 0x40098000u
#define ADC_BASE 0x400a0000u
#define PWM_BASE 0x400a8000u
#define TIMER0_BASE 0x400b0000u
#define TIMER1_BASE 0x400b8000u
#define HSTX_CTRL_BASE 0x400c0000u
#define XIP_CTRL_BASE 0x400c8000u
#define XIP_QMI_BASE 0x400d0000u
#define WATCHDOG_BASE 0x400d8000u
#define BOOTRAM_BASE 0x400e0000u
#define BOOTRAM_END 0x400e0400u
#define ROSC_BASE 0x400e8000u
#define TRNG_BASE 0x400f0000u
#define SHA256_BASE 0x400f8000u
#define POWMAN_BASE 0x40100000u
#define TICKS_BASE 0x40108000u
#define OTP_BASE 0x40120000u
#define OTP_DATA_BASE 0x40130000u
#define OTP_DATA_RAW_BASE 0x40134000u
#define OTP_DATA_GUARDED_BASE 0x40138000u
#define OTP_DATA_RAW_GUARDED_BASE 0x4013c000u
#define CORESIGHT_PERIPH_BASE 0x40140000u
#define CORESIGHT_ROMTABLE_BASE 0x40140000u
#define CORESIGHT_AHB_AP_CORE0_BASE 0x40142000u
#define CORESIGHT_AHB_AP_CORE1_BASE 0x40144000u
#define CORESIGHT_TIMESTAMP_GEN_BASE 0x40146000u
#define CORESIGHT_ATB_FUNNEL_BASE 0x40147000u
#define CORESIGHT_TPIU_BASE 0x40148000u
#define CORESIGHT_CTI_BASE 0x40149000u
#define CORESIGHT_APB_AP_RISCV_BASE 0x4014a000u
#define DFT_BASE 0x40150000u
#define GLITCH_DETECTOR_BASE 0x40158000u
#define TBMAN_BASE 0x40160000u
#define DMA_BASE 0x50000000u
#define USBCTRL_BASE 0x50100000u
#define USBCTRL_DPRAM_BASE 0x50100000u
#define USBCTRL_REGS_BASE 0x50110000u
#define PIO0_BASE 0x50200000u
#define PIO1_BASE 0x50300000u
#define PIO2_BASE 0x50400000u
#define XIP_AUX_BASE 0x50500000u
#define HSTX_FIFO_BASE 0x50600000u
#define CORESIGHT_TRACE_BASE 0x50700000u
#define SIO_BASE 0xd0000000u
#define SIO_NONSEC_BASE 0xd0020000u
#define PPB_BASE 0xe0000000u
#define PPB_NONSEC_BASE 0xe0020000u
#define EPPB_BASE 0xe0080000u
#define _HARDWARE_REGS_SIO_H 
#define SIO_CPUID_OFFSET 0x00000000u
#define SIO_CPUID_BITS 0xffffffffu
#define SIO_CPUID_RESET "-"
#define SIO_CPUID_MSB 31u
#define SIO_CPUID_LSB 0u
#define SIO_CPUID_ACCESS "RO"
#define SIO_GPIO_IN_OFFSET 0x00000004u
#define SIO_GPIO_IN_BITS 0xffffffffu
#define SIO_GPIO_IN_RESET 0x00000000u
#define SIO_GPIO_IN_MSB 31u
#define SIO_GPIO_IN_LSB 0u
#define SIO_GPIO_IN_ACCESS "RO"
#define SIO_GPIO_HI_IN_OFFSET 0x00000008u
#define SIO_GPIO_HI_IN_BITS 0xff00ffffu
#define SIO_GPIO_HI_IN_RESET 0x00000000u
#define SIO_GPIO_HI_IN_QSPI_SD_RESET 0x0u
#define SIO_GPIO_HI_IN_QSPI_SD_BITS 0xf0000000u
#define SIO_GPIO_HI_IN_QSPI_SD_MSB 31u
#define SIO_GPIO_HI_IN_QSPI_SD_LSB 28u
#define SIO_GPIO_HI_IN_QSPI_SD_ACCESS "RO"
#define SIO_GPIO_HI_IN_QSPI_CSN_RESET 0x0u
#define SIO_GPIO_HI_IN_QSPI_CSN_BITS 0x08000000u
#define SIO_GPIO_HI_IN_QSPI_CSN_MSB 27u
#define SIO_GPIO_HI_IN_QSPI_CSN_LSB 27u
#define SIO_GPIO_HI_IN_QSPI_CSN_ACCESS "RO"
#define SIO_GPIO_HI_IN_QSPI_SCK_RESET 0x0u
#define SIO_GPIO_HI_IN_QSPI_SCK_BITS 0x04000000u
#define SIO_GPIO_HI_IN_QSPI_SCK_MSB 26u
#define SIO_GPIO_HI_IN_QSPI_SCK_LSB 26u
#define SIO_GPIO_HI_IN_QSPI_SCK_ACCESS "RO"
#define SIO_GPIO_HI_IN_USB_DM_RESET 0x0u
#define SIO_GPIO_HI_IN_USB_DM_BITS 0x02000000u
#define SIO_GPIO_HI_IN_USB_DM_MSB 25u
#define SIO_GPIO_HI_IN_USB_DM_LSB 25u
#define SIO_GPIO_HI_IN_USB_DM_ACCESS "RO"
#define SIO_GPIO_HI_IN_USB_DP_RESET 0x0u
#define SIO_GPIO_HI_IN_USB_DP_BITS 0x01000000u
#define SIO_GPIO_HI_IN_USB_DP_MSB 24u
#define SIO_GPIO_HI_IN_USB_DP_LSB 24u
#define SIO_GPIO_HI_IN_USB_DP_ACCESS "RO"
#define SIO_GPIO_HI_IN_GPIO_RESET 0x0000u
#define SIO_GPIO_HI_IN_GPIO_BITS 0x0000ffffu
#define SIO_GPIO_HI_IN_GPIO_MSB 15u
#define SIO_GPIO_HI_IN_GPIO_LSB 0u
#define SIO_GPIO_HI_IN_GPIO_ACCESS "RO"
#define SIO_GPIO_OUT_OFFSET 0x00000010u
#define SIO_GPIO_OUT_BITS 0xffffffffu
#define SIO_GPIO_OUT_RESET 0x00000000u
#define SIO_GPIO_OUT_MSB 31u
#define SIO_GPIO_OUT_LSB 0u
#define SIO_GPIO_OUT_ACCESS "RW"
#define SIO_GPIO_HI_OUT_OFFSET 0x00000014u
#define SIO_GPIO_HI_OUT_BITS 0xff00ffffu
#define SIO_GPIO_HI_OUT_RESET 0x00000000u
#define SIO_GPIO_HI_OUT_QSPI_SD_RESET 0x0u
#define SIO_GPIO_HI_OUT_QSPI_SD_BITS 0xf0000000u
#define SIO_GPIO_HI_OUT_QSPI_SD_MSB 31u
#define SIO_GPIO_HI_OUT_QSPI_SD_LSB 28u
#define SIO_GPIO_HI_OUT_QSPI_SD_ACCESS "RW"
#define SIO_GPIO_HI_OUT_QSPI_CSN_RESET 0x0u
#define SIO_GPIO_HI_OUT_QSPI_CSN_BITS 0x08000000u
#define SIO_GPIO_HI_OUT_QSPI_CSN_MSB 27u
#define SIO_GPIO_HI_OUT_QSPI_CSN_LSB 27u
#define SIO_GPIO_HI_OUT_QSPI_CSN_ACCESS "RW"
#define SIO_GPIO_HI_OUT_QSPI_SCK_RESET 0x0u
#define SIO_GPIO_HI_OUT_QSPI_SCK_BITS 0x04000000u
#define SIO_GPIO_HI_OUT_QSPI_SCK_MSB 26u
#define SIO_GPIO_HI_OUT_QSPI_SCK_LSB 26u
#define SIO_GPIO_HI_OUT_QSPI_SCK_ACCESS "RW"
#define SIO_GPIO_HI_OUT_USB_DM_RESET 0x0u
#define SIO_GPIO_HI_OUT_USB_DM_BITS 0x02000000u
#define SIO_GPIO_HI_OUT_USB_DM_MSB 25u
#define SIO_GPIO_HI_OUT_USB_DM_LSB 25u
#define SIO_GPIO_HI_OUT_USB_DM_ACCESS "RW"
#define SIO_GPIO_HI_OUT_USB_DP_RESET 0x0u
#define SIO_GPIO_HI_OUT_USB_DP_BITS 0x01000000u
#define SIO_GPIO_HI_OUT_USB_DP_MSB 24u
#define SIO_GPIO_HI_OUT_USB_DP_LSB 24u
#define SIO_GPIO_HI_OUT_USB_DP_ACCESS "RW"
#define SIO_GPIO_HI_OUT_GPIO_RESET 0x0000u
#define SIO_GPIO_HI_OUT_GPIO_BITS 0x0000ffffu
#define SIO_GPIO_HI_OUT_GPIO_MSB 15u
#define SIO_GPIO_HI_OUT_GPIO_LSB 0u
#define SIO_GPIO_HI_OUT_GPIO_ACCESS "RW"
#define SIO_GPIO_OUT_SET_OFFSET 0x00000018u
#define SIO_GPIO_OUT_SET_BITS 0xffffffffu
#define SIO_GPIO_OUT_SET_RESET 0x00000000u
#define SIO_GPIO_OUT_SET_MSB 31u
#define SIO_GPIO_OUT_SET_LSB 0u
#define SIO_GPIO_OUT_SET_ACCESS "WO"
#define SIO_GPIO_HI_OUT_SET_OFFSET 0x0000001cu
#define SIO_GPIO_HI_OUT_SET_BITS 0xff00ffffu
#define SIO_GPIO_HI_OUT_SET_RESET 0x00000000u
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_RESET 0x0u
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_BITS 0xf0000000u
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_MSB 31u
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_LSB 28u
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_ACCESS "WO"
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_RESET 0x0u
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_BITS 0x08000000u
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_MSB 27u
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_LSB 27u
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN_ACCESS "WO"
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_RESET 0x0u
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_BITS 0x04000000u
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_MSB 26u
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_LSB 26u
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK_ACCESS "WO"
#define SIO_GPIO_HI_OUT_SET_USB_DM_RESET 0x0u
#define SIO_GPIO_HI_OUT_SET_USB_DM_BITS 0x02000000u
#define SIO_GPIO_HI_OUT_SET_USB_DM_MSB 25u
#define SIO_GPIO_HI_OUT_SET_USB_DM_LSB 25u
#define SIO_GPIO_HI_OUT_SET_USB_DM_ACCESS "WO"
#define SIO_GPIO_HI_OUT_SET_USB_DP_RESET 0x0u
#define SIO_GPIO_HI_OUT_SET_USB_DP_BITS 0x01000000u
#define SIO_GPIO_HI_OUT_SET_USB_DP_MSB 24u
#define SIO_GPIO_HI_OUT_SET_USB_DP_LSB 24u
#define SIO_GPIO_HI_OUT_SET_USB_DP_ACCESS "WO"
#define SIO_GPIO_HI_OUT_SET_GPIO_RESET 0x0000u
#define SIO_GPIO_HI_OUT_SET_GPIO_BITS 0x0000ffffu
#define SIO_GPIO_HI_OUT_SET_GPIO_MSB 15u
#define SIO_GPIO_HI_OUT_SET_GPIO_LSB 0u
#define SIO_GPIO_HI_OUT_SET_GPIO_ACCESS "WO"
#define SIO_GPIO_OUT_CLR_OFFSET 0x00000020u
#define SIO_GPIO_OUT_CLR_BITS 0xffffffffu
#define SIO_GPIO_OUT_CLR_RESET 0x00000000u
#define SIO_GPIO_OUT_CLR_MSB 31u
#define SIO_GPIO_OUT_CLR_LSB 0u
#define SIO_GPIO_OUT_CLR_ACCESS "WO"
#define SIO_GPIO_HI_OUT_CLR_OFFSET 0x00000024u
#define SIO_GPIO_HI_OUT_CLR_BITS 0xff00ffffu
#define SIO_GPIO_HI_OUT_CLR_RESET 0x00000000u
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_RESET 0x0u
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_BITS 0xf0000000u
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_MSB 31u
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_LSB 28u
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_ACCESS "WO"
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_RESET 0x0u
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_BITS 0x08000000u
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_MSB 27u
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_LSB 27u
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN_ACCESS "WO"
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_RESET 0x0u
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_BITS 0x04000000u
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_MSB 26u
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_LSB 26u
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK_ACCESS "WO"
#define SIO_GPIO_HI_OUT_CLR_USB_DM_RESET 0x0u
#define SIO_GPIO_HI_OUT_CLR_USB_DM_BITS 0x02000000u
#define SIO_GPIO_HI_OUT_CLR_USB_DM_MSB 25u
#define SIO_GPIO_HI_OUT_CLR_USB_DM_LSB 25u
#define SIO_GPIO_HI_OUT_CLR_USB_DM_ACCESS "WO"
#define SIO_GPIO_HI_OUT_CLR_USB_DP_RESET 0x0u
#define SIO_GPIO_HI_OUT_CLR_USB_DP_BITS 0x01000000u
#define SIO_GPIO_HI_OUT_CLR_USB_DP_MSB 24u
#define SIO_GPIO_HI_OUT_CLR_USB_DP_LSB 24u
#define SIO_GPIO_HI_OUT_CLR_USB_DP_ACCESS "WO"
#define SIO_GPIO_HI_OUT_CLR_GPIO_RESET 0x0000u
#define SIO_GPIO_HI_OUT_CLR_GPIO_BITS 0x0000ffffu
#define SIO_GPIO_HI_OUT_CLR_GPIO_MSB 15u
#define SIO_GPIO_HI_OUT_CLR_GPIO_LSB 0u
#define SIO_GPIO_HI_OUT_CLR_GPIO_ACCESS "WO"
#define SIO_GPIO_OUT_XOR_OFFSET 0x00000028u
#define SIO_GPIO_OUT_XOR_BITS 0xffffffffu
#define SIO_GPIO_OUT_XOR_RESET 0x00000000u
#define SIO_GPIO_OUT_XOR_MSB 31u
#define SIO_GPIO_OUT_XOR_LSB 0u
#define SIO_GPIO_OUT_XOR_ACCESS "WO"
#define SIO_GPIO_HI_OUT_XOR_OFFSET 0x0000002cu
#define SIO_GPIO_HI_OUT_XOR_BITS 0xff00ffffu
#define SIO_GPIO_HI_OUT_XOR_RESET 0x00000000u
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_RESET 0x0u
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_BITS 0xf0000000u
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_MSB 31u
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_LSB 28u
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_ACCESS "WO"
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_RESET 0x0u
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_BITS 0x08000000u
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_MSB 27u
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_LSB 27u
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN_ACCESS "WO"
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_RESET 0x0u
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_BITS 0x04000000u
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_MSB 26u
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_LSB 26u
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK_ACCESS "WO"
#define SIO_GPIO_HI_OUT_XOR_USB_DM_RESET 0x0u
#define SIO_GPIO_HI_OUT_XOR_USB_DM_BITS 0x02000000u
#define SIO_GPIO_HI_OUT_XOR_USB_DM_MSB 25u
#define SIO_GPIO_HI_OUT_XOR_USB_DM_LSB 25u
#define SIO_GPIO_HI_OUT_XOR_USB_DM_ACCESS "WO"
#define SIO_GPIO_HI_OUT_XOR_USB_DP_RESET 0x0u
#define SIO_GPIO_HI_OUT_XOR_USB_DP_BITS 0x01000000u
#define SIO_GPIO_HI_OUT_XOR_USB_DP_MSB 24u
#define SIO_GPIO_HI_OUT_XOR_USB_DP_LSB 24u
#define SIO_GPIO_HI_OUT_XOR_USB_DP_ACCESS "WO"
#define SIO_GPIO_HI_OUT_XOR_GPIO_RESET 0x0000u
#define SIO_GPIO_HI_OUT_XOR_GPIO_BITS 0x0000ffffu
#define SIO_GPIO_HI_OUT_XOR_GPIO_MSB 15u
#define SIO_GPIO_HI_OUT_XOR_GPIO_LSB 0u
#define SIO_GPIO_HI_OUT_XOR_GPIO_ACCESS "WO"
#define SIO_GPIO_OE_OFFSET 0x00000030u
#define SIO_GPIO_OE_BITS 0xffffffffu
#define SIO_GPIO_OE_RESET 0x00000000u
#define SIO_GPIO_OE_MSB 31u
#define SIO_GPIO_OE_LSB 0u
#define SIO_GPIO_OE_ACCESS "RW"
#define SIO_GPIO_HI_OE_OFFSET 0x00000034u
#define SIO_GPIO_HI_OE_BITS 0xff00ffffu
#define SIO_GPIO_HI_OE_RESET 0x00000000u
#define SIO_GPIO_HI_OE_QSPI_SD_RESET 0x0u
#define SIO_GPIO_HI_OE_QSPI_SD_BITS 0xf0000000u
#define SIO_GPIO_HI_OE_QSPI_SD_MSB 31u
#define SIO_GPIO_HI_OE_QSPI_SD_LSB 28u
#define SIO_GPIO_HI_OE_QSPI_SD_ACCESS "RW"
#define SIO_GPIO_HI_OE_QSPI_CSN_RESET 0x0u
#define SIO_GPIO_HI_OE_QSPI_CSN_BITS 0x08000000u
#define SIO_GPIO_HI_OE_QSPI_CSN_MSB 27u
#define SIO_GPIO_HI_OE_QSPI_CSN_LSB 27u
