gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define SIO_GPIO_HI_OE_QSPI_CSN_ACCESS "RW"
#define SIO_GPIO_HI_OE_QSPI_SCK_RESET 0x0u
#define SIO_GPIO_HI_OE_QSPI_SCK_BITS 0x04000000u
#define SIO_GPIO_HI_OE_QSPI_SCK_MSB 26u
#define SIO_GPIO_HI_OE_QSPI_SCK_LSB 26u
#define SIO_GPIO_HI_OE_QSPI_SCK_ACCESS "RW"
#define SIO_GPIO_HI_OE_USB_DM_RESET 0x0u
#define SIO_GPIO_HI_OE_USB_DM_BITS 0x02000000u
#define SIO_GPIO_HI_OE_USB_DM_MSB 25u
#define SIO_GPIO_HI_OE_USB_DM_LSB 25u
#define SIO_GPIO_HI_OE_USB_DM_ACCESS "RW"
#define SIO_GPIO_HI_OE_USB_DP_RESET 0x0u
#define SIO_GPIO_HI_OE_USB_DP_BITS 0x01000000u
#define SIO_GPIO_HI_OE_USB_DP_MSB 24u
#define SIO_GPIO_HI_OE_USB_DP_LSB 24u
#define SIO_GPIO_HI_OE_USB_DP_ACCESS "RW"
#define SIO_GPIO_HI_OE_GPIO_RESET 0x0000u
#define SIO_GPIO_HI_OE_GPIO_BITS 0x0000ffffu
#define SIO_GPIO_HI_OE_GPIO_MSB 15u
#define SIO_GPIO_HI_OE_GPIO_LSB 0u
#define SIO_GPIO_HI_OE_GPIO_ACCESS "RW"
#define SIO_GPIO_OE_SET_OFFSET 0x00000038u
#define SIO_GPIO_OE_SET_BITS 0xffffffffu
#define SIO_GPIO_OE_SET_RESET 0x00000000u
#define SIO_GPIO_OE_SET_MSB 31u
#define SIO_GPIO_OE_SET_LSB 0u
#define SIO_GPIO_OE_SET_ACCESS "WO"
#define SIO_GPIO_HI_OE_SET_OFFSET 0x0000003cu
#define SIO_GPIO_HI_OE_SET_BITS 0xff00ffffu
#define SIO_GPIO_HI_OE_SET_RESET 0x00000000u
#define SIO_GPIO_HI_OE_SET_QSPI_SD_RESET 0x0u
#define SIO_GPIO_HI_OE_SET_QSPI_SD_BITS 0xf0000000u
#define SIO_GPIO_HI_OE_SET_QSPI_SD_MSB 31u
#define SIO_GPIO_HI_OE_SET_QSPI_SD_LSB 28u
#define SIO_GPIO_HI_OE_SET_QSPI_SD_ACCESS "WO"
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_RESET 0x0u
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_BITS 0x08000000u
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_MSB 27u
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_LSB 27u
#define SIO_GPIO_HI_OE_SET_QSPI_CSN_ACCESS "WO"
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_RESET 0x0u
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_BITS 0x04000000u
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_MSB 26u
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_LSB 26u
#define SIO_GPIO_HI_OE_SET_QSPI_SCK_ACCESS "WO"
#define SIO_GPIO_HI_OE_SET_USB_DM_RESET 0x0u
#define SIO_GPIO_HI_OE_SET_USB_DM_BITS 0x02000000u
#define SIO_GPIO_HI_OE_SET_USB_DM_MSB 25u
#define SIO_GPIO_HI_OE_SET_USB_DM_LSB 25u
#define SIO_GPIO_HI_OE_SET_USB_DM_ACCESS "WO"
#define SIO_GPIO_HI_OE_SET_USB_DP_RESET 0x0u
#define SIO_GPIO_HI_OE_SET_USB_DP_BITS 0x01000000u
#define SIO_GPIO_HI_OE_SET_USB_DP_MSB 24u
#define SIO_GPIO_HI_OE_SET_USB_DP_LSB 24u
#define SIO_GPIO_HI_OE_SET_USB_DP_ACCESS "WO"
#define SIO_GPIO_HI_OE_SET_GPIO_RESET 0x0000u
#define SIO_GPIO_HI_OE_SET_GPIO_BITS 0x0000ffffu
#define SIO_GPIO_HI_OE_SET_GPIO_MSB 15u
#define SIO_GPIO_HI_OE_SET_GPIO_LSB 0u
#define SIO_GPIO_HI_OE_SET_GPIO_ACCESS "WO"
#define SIO_GPIO_OE_CLR_OFFSET 0x00000040u
#define SIO_GPIO_OE_CLR_BITS 0xffffffffu
#define SIO_GPIO_OE_CLR_RESET 0x00000000u
#define SIO_GPIO_OE_CLR_MSB 31u
#define SIO_GPIO_OE_CLR_LSB 0u
#define SIO_GPIO_OE_CLR_ACCESS "WO"
#define SIO_GPIO_HI_OE_CLR_OFFSET 0x00000044u
#define SIO_GPIO_HI_OE_CLR_BITS 0xff00ffffu
#define SIO_GPIO_HI_OE_CLR_RESET 0x00000000u
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_RESET 0x0u
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_BITS 0xf0000000u
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_MSB 31u
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_LSB 28u
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_ACCESS "WO"
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_RESET 0x0u
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_BITS 0x08000000u
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_MSB 27u
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_LSB 27u
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN_ACCESS "WO"
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_RESET 0x0u
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_BITS 0x04000000u
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_MSB 26u
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_LSB 26u
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK_ACCESS "WO"
#define SIO_GPIO_HI_OE_CLR_USB_DM_RESET 0x0u
#define SIO_GPIO_HI_OE_CLR_USB_DM_BITS 0x02000000u
#define SIO_GPIO_HI_OE_CLR_USB_DM_MSB 25u
#define SIO_GPIO_HI_OE_CLR_USB_DM_LSB 25u
#define SIO_GPIO_HI_OE_CLR_USB_DM_ACCESS "WO"
#define SIO_GPIO_HI_OE_CLR_USB_DP_RESET 0x0u
#define SIO_GPIO_HI_OE_CLR_USB_DP_BITS 0x01000000u
#define SIO_GPIO_HI_OE_CLR_USB_DP_MSB 24u
#define SIO_GPIO_HI_OE_CLR_USB_DP_LSB 24u
#define SIO_GPIO_HI_OE_CLR_USB_DP_ACCESS "WO"
#define SIO_GPIO_HI_OE_CLR_GPIO_RESET 0x0000u
#define SIO_GPIO_HI_OE_CLR_GPIO_BITS 0x0000ffffu
#define SIO_GPIO_HI_OE_CLR_GPIO_MSB 15u
#define SIO_GPIO_HI_OE_CLR_GPIO_LSB 0u
#define SIO_GPIO_HI_OE_CLR_GPIO_ACCESS "WO"
#define SIO_GPIO_OE_XOR_OFFSET 0x00000048u
#define SIO_GPIO_OE_XOR_BITS 0xffffffffu
#define SIO_GPIO_OE_XOR_RESET 0x00000000u
#define SIO_GPIO_OE_XOR_MSB 31u
#define SIO_GPIO_OE_XOR_LSB 0u
#define SIO_GPIO_OE_XOR_ACCESS "WO"
#define SIO_GPIO_HI_OE_XOR_OFFSET 0x0000004cu
#define SIO_GPIO_HI_OE_XOR_BITS 0xff00ffffu
#define SIO_GPIO_HI_OE_XOR_RESET 0x00000000u
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_RESET 0x0u
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_BITS 0xf0000000u
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_MSB 31u
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_LSB 28u
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_ACCESS "WO"
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_RESET 0x0u
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_BITS 0x08000000u
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_MSB 27u
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_LSB 27u
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN_ACCESS "WO"
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_RESET 0x0u
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_BITS 0x04000000u
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_MSB 26u
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_LSB 26u
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK_ACCESS "WO"
#define SIO_GPIO_HI_OE_XOR_USB_DM_RESET 0x0u
#define SIO_GPIO_HI_OE_XOR_USB_DM_BITS 0x02000000u
#define SIO_GPIO_HI_OE_XOR_USB_DM_MSB 25u
#define SIO_GPIO_HI_OE_XOR_USB_DM_LSB 25u
#define SIO_GPIO_HI_OE_XOR_USB_DM_ACCESS "WO"
#define SIO_GPIO_HI_OE_XOR_USB_DP_RESET 0x0u
#define SIO_GPIO_HI_OE_XOR_USB_DP_BITS 0x01000000u
#define SIO_GPIO_HI_OE_XOR_USB_DP_MSB 24u
#define SIO_GPIO_HI_OE_XOR_USB_DP_LSB 24u
#define SIO_GPIO_HI_OE_XOR_USB_DP_ACCESS "WO"
#define SIO_GPIO_HI_OE_XOR_GPIO_RESET 0x0000u
#define SIO_GPIO_HI_OE_XOR_GPIO_BITS 0x0000ffffu
#define SIO_GPIO_HI_OE_XOR_GPIO_MSB 15u
#define SIO_GPIO_HI_OE_XOR_GPIO_LSB 0u
#define SIO_GPIO_HI_OE_XOR_GPIO_ACCESS "WO"
#define SIO_FIFO_ST_OFFSET 0x00000050u
#define SIO_FIFO_ST_BITS 0x0000000fu
#define SIO_FIFO_ST_RESET 0x00000002u
#define SIO_FIFO_ST_ROE_RESET 0x0u
#define SIO_FIFO_ST_ROE_BITS 0x00000008u
#define SIO_FIFO_ST_ROE_MSB 3u
#define SIO_FIFO_ST_ROE_LSB 3u
#define SIO_FIFO_ST_ROE_ACCESS "WC"
#define SIO_FIFO_ST_WOF_RESET 0x0u
#define SIO_FIFO_ST_WOF_BITS 0x00000004u
#define SIO_FIFO_ST_WOF_MSB 2u
#define SIO_FIFO_ST_WOF_LSB 2u
#define SIO_FIFO_ST_WOF_ACCESS "WC"
#define SIO_FIFO_ST_RDY_RESET 0x1u
#define SIO_FIFO_ST_RDY_BITS 0x00000002u
#define SIO_FIFO_ST_RDY_MSB 1u
#define SIO_FIFO_ST_RDY_LSB 1u
#define SIO_FIFO_ST_RDY_ACCESS "RO"
#define SIO_FIFO_ST_VLD_RESET 0x0u
#define SIO_FIFO_ST_VLD_BITS 0x00000001u
#define SIO_FIFO_ST_VLD_MSB 0u
#define SIO_FIFO_ST_VLD_LSB 0u
#define SIO_FIFO_ST_VLD_ACCESS "RO"
#define SIO_FIFO_WR_OFFSET 0x00000054u
#define SIO_FIFO_WR_BITS 0xffffffffu
#define SIO_FIFO_WR_RESET 0x00000000u
#define SIO_FIFO_WR_MSB 31u
#define SIO_FIFO_WR_LSB 0u
#define SIO_FIFO_WR_ACCESS "WF"
#define SIO_FIFO_RD_OFFSET 0x00000058u
#define SIO_FIFO_RD_BITS 0xffffffffu
#define SIO_FIFO_RD_RESET "-"
#define SIO_FIFO_RD_MSB 31u
#define SIO_FIFO_RD_LSB 0u
#define SIO_FIFO_RD_ACCESS "RF"
#define SIO_SPINLOCK_ST_OFFSET 0x0000005cu
#define SIO_SPINLOCK_ST_BITS 0xffffffffu
#define SIO_SPINLOCK_ST_RESET 0x00000000u
#define SIO_SPINLOCK_ST_MSB 31u
#define SIO_SPINLOCK_ST_LSB 0u
#define SIO_SPINLOCK_ST_ACCESS "RO"
#define SIO_INTERP0_ACCUM0_OFFSET 0x00000080u
#define SIO_INTERP0_ACCUM0_BITS 0xffffffffu
#define SIO_INTERP0_ACCUM0_RESET 0x00000000u
#define SIO_INTERP0_ACCUM0_MSB 31u
#define SIO_INTERP0_ACCUM0_LSB 0u
#define SIO_INTERP0_ACCUM0_ACCESS "RW"
#define SIO_INTERP0_ACCUM1_OFFSET 0x00000084u
#define SIO_INTERP0_ACCUM1_BITS 0xffffffffu
#define SIO_INTERP0_ACCUM1_RESET 0x00000000u
#define SIO_INTERP0_ACCUM1_MSB 31u
#define SIO_INTERP0_ACCUM1_LSB 0u
#define SIO_INTERP0_ACCUM1_ACCESS "RW"
#define SIO_INTERP0_BASE0_OFFSET 0x00000088u
#define SIO_INTERP0_BASE0_BITS 0xffffffffu
#define SIO_INTERP0_BASE0_RESET 0x00000000u
#define SIO_INTERP0_BASE0_MSB 31u
#define SIO_INTERP0_BASE0_LSB 0u
#define SIO_INTERP0_BASE0_ACCESS "RW"
#define SIO_INTERP0_BASE1_OFFSET 0x0000008cu
#define SIO_INTERP0_BASE1_BITS 0xffffffffu
#define SIO_INTERP0_BASE1_RESET 0x00000000u
#define SIO_INTERP0_BASE1_MSB 31u
#define SIO_INTERP0_BASE1_LSB 0u
#define SIO_INTERP0_BASE1_ACCESS "RW"
#define SIO_INTERP0_BASE2_OFFSET 0x00000090u
#define SIO_INTERP0_BASE2_BITS 0xffffffffu
#define SIO_INTERP0_BASE2_RESET 0x00000000u
#define SIO_INTERP0_BASE2_MSB 31u
#define SIO_INTERP0_BASE2_LSB 0u
#define SIO_INTERP0_BASE2_ACCESS "RW"
#define SIO_INTERP0_POP_LANE0_OFFSET 0x00000094u
#define SIO_INTERP0_POP_LANE0_BITS 0xffffffffu
#define SIO_INTERP0_POP_LANE0_RESET 0x00000000u
#define SIO_INTERP0_POP_LANE0_MSB 31u
#define SIO_INTERP0_POP_LANE0_LSB 0u
#define SIO_INTERP0_POP_LANE0_ACCESS "RO"
#define SIO_INTERP0_POP_LANE1_OFFSET 0x00000098u
#define SIO_INTERP0_POP_LANE1_BITS 0xffffffffu
#define SIO_INTERP0_POP_LANE1_RESET 0x00000000u
#define SIO_INTERP0_POP_LANE1_MSB 31u
#define SIO_INTERP0_POP_LANE1_LSB 0u
#define SIO_INTERP0_POP_LANE1_ACCESS "RO"
#define SIO_INTERP0_POP_FULL_OFFSET 0x0000009cu
#define SIO_INTERP0_POP_FULL_BITS 0xffffffffu
#define SIO_INTERP0_POP_FULL_RESET 0x00000000u
#define SIO_INTERP0_POP_FULL_MSB 31u
#define SIO_INTERP0_POP_FULL_LSB 0u
#define SIO_INTERP0_POP_FULL_ACCESS "RO"
#define SIO_INTERP0_PEEK_LANE0_OFFSET 0x000000a0u
#define SIO_INTERP0_PEEK_LANE0_BITS 0xffffffffu
#define SIO_INTERP0_PEEK_LANE0_RESET 0x00000000u
#define SIO_INTERP0_PEEK_LANE0_MSB 31u
#define SIO_INTERP0_PEEK_LANE0_LSB 0u
#define SIO_INTERP0_PEEK_LANE0_ACCESS "RO"
#define SIO_INTERP0_PEEK_LANE1_OFFSET 0x000000a4u
#define SIO_INTERP0_PEEK_LANE1_BITS 0xffffffffu
#define SIO_INTERP0_PEEK_LANE1_RESET 0x00000000u
#define SIO_INTERP0_PEEK_LANE1_MSB 31u
#define SIO_INTERP0_PEEK_LANE1_LSB 0u
#define SIO_INTERP0_PEEK_LANE1_ACCESS "RO"
#define SIO_INTERP0_PEEK_FULL_OFFSET 0x000000a8u
#define SIO_INTERP0_PEEK_FULL_BITS 0xffffffffu
#define SIO_INTERP0_PEEK_FULL_RESET 0x00000000u
#define SIO_INTERP0_PEEK_FULL_MSB 31u
#define SIO_INTERP0_PEEK_FULL_LSB 0u
#define SIO_INTERP0_PEEK_FULL_ACCESS "RO"
#define SIO_INTERP0_CTRL_LANE0_OFFSET 0x000000acu
#define SIO_INTERP0_CTRL_LANE0_BITS 0x03bfffffu
#define SIO_INTERP0_CTRL_LANE0_RESET 0x00000000u
#define SIO_INTERP0_CTRL_LANE0_OVERF_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE0_OVERF_BITS 0x02000000u
#define SIO_INTERP0_CTRL_LANE0_OVERF_MSB 25u
#define SIO_INTERP0_CTRL_LANE0_OVERF_LSB 25u
#define SIO_INTERP0_CTRL_LANE0_OVERF_ACCESS "RO"
#define SIO_INTERP0_CTRL_LANE0_OVERF1_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE0_OVERF1_BITS 0x01000000u
#define SIO_INTERP0_CTRL_LANE0_OVERF1_MSB 24u
#define SIO_INTERP0_CTRL_LANE0_OVERF1_LSB 24u
#define SIO_INTERP0_CTRL_LANE0_OVERF1_ACCESS "RO"
#define SIO_INTERP0_CTRL_LANE0_OVERF0_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE0_OVERF0_BITS 0x00800000u
#define SIO_INTERP0_CTRL_LANE0_OVERF0_MSB 23u
#define SIO_INTERP0_CTRL_LANE0_OVERF0_LSB 23u
#define SIO_INTERP0_CTRL_LANE0_OVERF0_ACCESS "RO"
#define SIO_INTERP0_CTRL_LANE0_BLEND_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE0_BLEND_BITS 0x00200000u
#define SIO_INTERP0_CTRL_LANE0_BLEND_MSB 21u
#define SIO_INTERP0_CTRL_LANE0_BLEND_LSB 21u
#define SIO_INTERP0_CTRL_LANE0_BLEND_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_BITS 0x00180000u
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_MSB 20u
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_LSB 19u
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_BITS 0x00040000u
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_MSB 18u
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_LSB 18u
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_BITS 0x00020000u
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_MSB 17u
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_LSB 17u
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_BITS 0x00010000u
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_MSB 16u
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_LSB 16u
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE0_SIGNED_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE0_SIGNED_BITS 0x00008000u
#define SIO_INTERP0_CTRL_LANE0_SIGNED_MSB 15u
#define SIO_INTERP0_CTRL_LANE0_SIGNED_LSB 15u
#define SIO_INTERP0_CTRL_LANE0_SIGNED_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE0_MASK_MSB_RESET 0x00u
#define SIO_INTERP0_CTRL_LANE0_MASK_MSB_BITS 0x00007c00u
#define SIO_INTERP0_CTRL_LANE0_MASK_MSB_MSB 14u
#define SIO_INTERP0_CTRL_LANE0_MASK_MSB_LSB 10u
#define SIO_INTERP0_CTRL_LANE0_MASK_MSB_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE0_MASK_LSB_RESET 0x00u
#define SIO_INTERP0_CTRL_LANE0_MASK_LSB_BITS 0x000003e0u
#define SIO_INTERP0_CTRL_LANE0_MASK_LSB_MSB 9u
#define SIO_INTERP0_CTRL_LANE0_MASK_LSB_LSB 5u
#define SIO_INTERP0_CTRL_LANE0_MASK_LSB_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE0_SHIFT_RESET 0x00u
#define SIO_INTERP0_CTRL_LANE0_SHIFT_BITS 0x0000001fu
#define SIO_INTERP0_CTRL_LANE0_SHIFT_MSB 4u
#define SIO_INTERP0_CTRL_LANE0_SHIFT_LSB 0u
#define SIO_INTERP0_CTRL_LANE0_SHIFT_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE1_OFFSET 0x000000b0u
#define SIO_INTERP0_CTRL_LANE1_BITS 0x001fffffu
#define SIO_INTERP0_CTRL_LANE1_RESET 0x00000000u
#define SIO_INTERP0_CTRL_LANE1_FORCE_MSB_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE1_FORCE_MSB_BITS 0x00180000u
#define SIO_INTERP0_CTRL_LANE1_FORCE_MSB_MSB 20u
#define SIO_INTERP0_CTRL_LANE1_FORCE_MSB_LSB 19u
#define SIO_INTERP0_CTRL_LANE1_FORCE_MSB_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE1_ADD_RAW_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE1_ADD_RAW_BITS 0x00040000u
#define SIO_INTERP0_CTRL_LANE1_ADD_RAW_MSB 18u
#define SIO_INTERP0_CTRL_LANE1_ADD_RAW_LSB 18u
#define SIO_INTERP0_CTRL_LANE1_ADD_RAW_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_BITS 0x00020000u
#define SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_MSB 17u
#define SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_LSB 17u
#define SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_BITS 0x00010000u
#define SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_MSB 16u
#define SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_LSB 16u
#define SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE1_SIGNED_RESET 0x0u
#define SIO_INTERP0_CTRL_LANE1_SIGNED_BITS 0x00008000u
#define SIO_INTERP0_CTRL_LANE1_SIGNED_MSB 15u
#define SIO_INTERP0_CTRL_LANE1_SIGNED_LSB 15u
#define SIO_INTERP0_CTRL_LANE1_SIGNED_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE1_MASK_MSB_RESET 0x00u
#define SIO_INTERP0_CTRL_LANE1_MASK_MSB_BITS 0x00007c00u
#define SIO_INTERP0_CTRL_LANE1_MASK_MSB_MSB 14u
#define SIO_INTERP0_CTRL_LANE1_MASK_MSB_LSB 10u
#define SIO_INTERP0_CTRL_LANE1_MASK_MSB_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE1_MASK_LSB_RESET 0x00u
#define SIO_INTERP0_CTRL_LANE1_MASK_LSB_BITS 0x000003e0u
#define SIO_INTERP0_CTRL_LANE1_MASK_LSB_MSB 9u
#define SIO_INTERP0_CTRL_LANE1_MASK_LSB_LSB 5u
#define SIO_INTERP0_CTRL_LANE1_MASK_LSB_ACCESS "RW"
#define SIO_INTERP0_CTRL_LANE1_SHIFT_RESET 0x00u
#define SIO_INTERP0_CTRL_LANE1_SHIFT_BITS 0x0000001fu
#define SIO_INTERP0_CTRL_LANE1_SHIFT_MSB 4u
#define SIO_INTERP0_CTRL_LANE1_SHIFT_LSB 0u
#define SIO_INTERP0_CTRL_LANE1_SHIFT_ACCESS "RW"
#define SIO_INTERP0_ACCUM0_ADD_OFFSET 0x000000b4u
#define SIO_INTERP0_ACCUM0_ADD_BITS 0x00ffffffu
#define SIO_INTERP0_ACCUM0_ADD_RESET 0x00000000u
#define SIO_INTERP0_ACCUM0_ADD_MSB 23u
#define SIO_INTERP0_ACCUM0_ADD_LSB 0u
#define SIO_INTERP0_ACCUM0_ADD_ACCESS "RW"
#define SIO_INTERP0_ACCUM1_ADD_OFFSET 0x000000b8u
#define SIO_INTERP0_ACCUM1_ADD_BITS 0x00ffffffu
#define SIO_INTERP0_ACCUM1_ADD_RESET 0x00000000u
#define SIO_INTERP0_ACCUM1_ADD_MSB 23u
#define SIO_INTERP0_ACCUM1_ADD_LSB 0u
#define SIO_INTERP0_ACCUM1_ADD_ACCESS "RW"
#define SIO_INTERP0_BASE_1AND0_OFFSET 0x000000bcu
#define SIO_INTERP0_BASE_1AND0_BITS 0xffffffffu
#define SIO_INTERP0_BASE_1AND0_RESET 0x00000000u
#define SIO_INTERP0_BASE_1AND0_MSB 31u
#define SIO_INTERP0_BASE_1AND0_LSB 0u
#define SIO_INTERP0_BASE_1AND0_ACCESS "WO"
#define SIO_INTERP1_ACCUM0_OFFSET 0x000000c0u
#define SIO_INTERP1_ACCUM0_BITS 0xffffffffu
#define SIO_INTERP1_ACCUM0_RESET 0x00000000u
#define SIO_INTERP1_ACCUM0_MSB 31u
#define SIO_INTERP1_ACCUM0_LSB 0u
#define SIO_INTERP1_ACCUM0_ACCESS "RW"
#define SIO_INTERP1_ACCUM1_OFFSET 0x000000c4u
#define SIO_INTERP1_ACCUM1_BITS 0xffffffffu
#define SIO_INTERP1_ACCUM1_RESET 0x00000000u
#define SIO_INTERP1_ACCUM1_MSB 31u
#define SIO_INTERP1_ACCUM1_LSB 0u
#define SIO_INTERP1_ACCUM1_ACCESS "RW"
#define SIO_INTERP1_BASE0_OFFSET 0x000000c8u
#define SIO_INTERP1_BASE0_BITS 0xffffffffu
#define SIO_INTERP1_BASE0_RESET 0x00000000u
#define SIO_INTERP1_BASE0_MSB 31u
#define SIO_INTERP1_BASE0_LSB 0u
#define SIO_INTERP1_BASE0_ACCESS "RW"
#define SIO_INTERP1_BASE1_OFFSET 0x000000ccu
#define SIO_INTERP1_BASE1_BITS 0xffffffffu
#define SIO_INTERP1_BASE1_RESET 0x00000000u
#define SIO_INTERP1_BASE1_MSB 31u
#define SIO_INTERP1_BASE1_LSB 0u
#define SIO_INTERP1_BASE1_ACCESS "RW"
#define SIO_INTERP1_BASE2_OFFSET 0x000000d0u
#define SIO_INTERP1_BASE2_BITS 0xffffffffu
#define SIO_INTERP1_BASE2_RESET 0x00000000u
#define SIO_INTERP1_BASE2_MSB 31u
#define SIO_INTERP1_BASE2_LSB 0u
#define SIO_INTERP1_BASE2_ACCESS "RW"
#define SIO_INTERP1_POP_LANE0_OFFSET 0x000000d4u
#define SIO_INTERP1_POP_LANE0_BITS 0xffffffffu
#define SIO_INTERP1_POP_LANE0_RESET 0x00000000u
#define SIO_INTERP1_POP_LANE0_MSB 31u
#define SIO_INTERP1_POP_LANE0_LSB 0u
#define SIO_INTERP1_POP_LANE0_ACCESS "RO"
#define SIO_INTERP1_POP_LANE1_OFFSET 0x000000d8u
#define SIO_INTERP1_POP_LANE1_BITS 0xffffffffu
#define SIO_INTERP1_POP_LANE1_RESET 0x00000000u
#define SIO_INTERP1_POP_LANE1_MSB 31u
#define SIO_INTERP1_POP_LANE1_LSB 0u
#define SIO_INTERP1_POP_LANE1_ACCESS "RO"
#define SIO_INTERP1_POP_FULL_OFFSET 0x000000dcu
#define SIO_INTERP1_POP_FULL_BITS 0xffffffffu
#define SIO_INTERP1_POP_FULL_RESET 0x00000000u
#define SIO_INTERP1_POP_FULL_MSB 31u
#define SIO_INTERP1_POP_FULL_LSB 0u
#define SIO_INTERP1_POP_FULL_ACCESS "RO"
#define SIO_INTERP1_PEEK_LANE0_OFFSET 0x000000e0u
#define SIO_INTERP1_PEEK_LANE0_BITS 0xffffffffu
#define SIO_INTERP1_PEEK_LANE0_RESET 0x00000000u
#define SIO_INTERP1_PEEK_LANE0_MSB 31u
#define SIO_INTERP1_PEEK_LANE0_LSB 0u
#define SIO_INTERP1_PEEK_LANE0_ACCESS "RO"
#define SIO_INTERP1_PEEK_LANE1_OFFSET 0x000000e4u
#define SIO_INTERP1_PEEK_LANE1_BITS 0xffffffffu
#define SIO_INTERP1_PEEK_LANE1_RESET 0x00000000u
#define SIO_INTERP1_PEEK_LANE1_MSB 31u
#define SIO_INTERP1_PEEK_LANE1_LSB 0u
#define SIO_INTERP1_PEEK_LANE1_ACCESS "RO"
#define SIO_INTERP1_PEEK_FULL_OFFSET 0x000000e8u
#define SIO_INTERP1_PEEK_FULL_BITS 0xffffffffu
#define SIO_INTERP1_PEEK_FULL_RESET 0x00000000u
#define SIO_INTERP1_PEEK_FULL_MSB 31u
#define SIO_INTERP1_PEEK_FULL_LSB 0u
#define SIO_INTERP1_PEEK_FULL_ACCESS "RO"
#define SIO_INTERP1_CTRL_LANE0_OFFSET 0x000000ecu
#define SIO_INTERP1_CTRL_LANE0_BITS 0x03dfffffu
#define SIO_INTERP1_CTRL_LANE0_RESET 0x00000000u
#define SIO_INTERP1_CTRL_LANE0_OVERF_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE0_OVERF_BITS 0x02000000u
#define SIO_INTERP1_CTRL_LANE0_OVERF_MSB 25u
#define SIO_INTERP1_CTRL_LANE0_OVERF_LSB 25u
#define SIO_INTERP1_CTRL_LANE0_OVERF_ACCESS "RO"
#define SIO_INTERP1_CTRL_LANE0_OVERF1_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE0_OVERF1_BITS 0x01000000u
#define SIO_INTERP1_CTRL_LANE0_OVERF1_MSB 24u
#define SIO_INTERP1_CTRL_LANE0_OVERF1_LSB 24u
#define SIO_INTERP1_CTRL_LANE0_OVERF1_ACCESS "RO"
#define SIO_INTERP1_CTRL_LANE0_OVERF0_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE0_OVERF0_BITS 0x00800000u
#define SIO_INTERP1_CTRL_LANE0_OVERF0_MSB 23u
#define SIO_INTERP1_CTRL_LANE0_OVERF0_LSB 23u
#define SIO_INTERP1_CTRL_LANE0_OVERF0_ACCESS "RO"
#define SIO_INTERP1_CTRL_LANE0_CLAMP_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE0_CLAMP_BITS 0x00400000u
#define SIO_INTERP1_CTRL_LANE0_CLAMP_MSB 22u
#define SIO_INTERP1_CTRL_LANE0_CLAMP_LSB 22u
#define SIO_INTERP1_CTRL_LANE0_CLAMP_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE0_FORCE_MSB_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE0_FORCE_MSB_BITS 0x00180000u
#define SIO_INTERP1_CTRL_LANE0_FORCE_MSB_MSB 20u
#define SIO_INTERP1_CTRL_LANE0_FORCE_MSB_LSB 19u
#define SIO_INTERP1_CTRL_LANE0_FORCE_MSB_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE0_ADD_RAW_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE0_ADD_RAW_BITS 0x00040000u
#define SIO_INTERP1_CTRL_LANE0_ADD_RAW_MSB 18u
#define SIO_INTERP1_CTRL_LANE0_ADD_RAW_LSB 18u
#define SIO_INTERP1_CTRL_LANE0_ADD_RAW_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_BITS 0x00020000u
#define SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_MSB 17u
#define SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_LSB 17u
#define SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_BITS 0x00010000u
#define SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_MSB 16u
#define SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_LSB 16u
#define SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE0_SIGNED_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE0_SIGNED_BITS 0x00008000u
#define SIO_INTERP1_CTRL_LANE0_SIGNED_MSB 15u
#define SIO_INTERP1_CTRL_LANE0_SIGNED_LSB 15u
#define SIO_INTERP1_CTRL_LANE0_SIGNED_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE0_MASK_MSB_RESET 0x00u
#define SIO_INTERP1_CTRL_LANE0_MASK_MSB_BITS 0x00007c00u
#define SIO_INTERP1_CTRL_LANE0_MASK_MSB_MSB 14u
#define SIO_INTERP1_CTRL_LANE0_MASK_MSB_LSB 10u
#define SIO_INTERP1_CTRL_LANE0_MASK_MSB_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE0_MASK_LSB_RESET 0x00u
#define SIO_INTERP1_CTRL_LANE0_MASK_LSB_BITS 0x000003e0u
#define SIO_INTERP1_CTRL_LANE0_MASK_LSB_MSB 9u
#define SIO_INTERP1_CTRL_LANE0_MASK_LSB_LSB 5u
#define SIO_INTERP1_CTRL_LANE0_MASK_LSB_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE0_SHIFT_RESET 0x00u
#define SIO_INTERP1_CTRL_LANE0_SHIFT_BITS 0x0000001fu
#define SIO_INTERP1_CTRL_LANE0_SHIFT_MSB 4u
#define SIO_INTERP1_CTRL_LANE0_SHIFT_LSB 0u
#define SIO_INTERP1_CTRL_LANE0_SHIFT_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE1_OFFSET 0x000000f0u
#define SIO_INTERP1_CTRL_LANE1_BITS 0x001fffffu
#define SIO_INTERP1_CTRL_LANE1_RESET 0x00000000u
#define SIO_INTERP1_CTRL_LANE1_FORCE_MSB_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE1_FORCE_MSB_BITS 0x00180000u
#define SIO_INTERP1_CTRL_LANE1_FORCE_MSB_MSB 20u
#define SIO_INTERP1_CTRL_LANE1_FORCE_MSB_LSB 19u
#define SIO_INTERP1_CTRL_LANE1_FORCE_MSB_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE1_ADD_RAW_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE1_ADD_RAW_BITS 0x00040000u
#define SIO_INTERP1_CTRL_LANE1_ADD_RAW_MSB 18u
#define SIO_INTERP1_CTRL_LANE1_ADD_RAW_LSB 18u
#define SIO_INTERP1_CTRL_LANE1_ADD_RAW_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_BITS 0x00020000u
#define SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_MSB 17u
#define SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_LSB 17u
#define SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_BITS 0x00010000u
#define SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_MSB 16u
#define SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_LSB 16u
#define SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE1_SIGNED_RESET 0x0u
#define SIO_INTERP1_CTRL_LANE1_SIGNED_BITS 0x00008000u
#define SIO_INTERP1_CTRL_LANE1_SIGNED_MSB 15u
#define SIO_INTERP1_CTRL_LANE1_SIGNED_LSB 15u
#define SIO_INTERP1_CTRL_LANE1_SIGNED_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE1_MASK_MSB_RESET 0x00u
#define SIO_INTERP1_CTRL_LANE1_MASK_MSB_BITS 0x00007c00u
