gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#pragma GCC diagnostic ignored "-Warray-bounds"
    return *(uint8_t*)0x13;
    
#pragma GCC diagnostic pop
}
__inline__ __attribute__((__always_inline__)) static int32_t __mul_instruction(int32_t a, int32_t b) {
    __asm (".syntax unified\n" "muls %0, %1" : "+l" (a) : "l" (b) : "cc");
    return a;
}
#define __fast_mul(a,b) __builtin_choose_expr(__builtin_constant_p(b) && !__builtin_constant_p(a), (__builtin_popcount(b) >= 2 ? __mul_instruction(a,b) : (a)*(b)), (a)*(b))
#define _PICO_ERROR_H 
enum pico_error_codes {
    PICO_OK = 0,
    PICO_ERROR_NONE = 0,
    PICO_ERROR_GENERIC = -1,
    PICO_ERROR_TIMEOUT = -2,
    PICO_ERROR_NO_DATA = -3,
    PICO_ERROR_NOT_PERMITTED = -4,
    PICO_ERROR_INVALID_ARG = -5,
    PICO_ERROR_IO = -6,
    PICO_ERROR_BADAUTH = -7,
    PICO_ERROR_CONNECT_FAILED = -8,
    PICO_ERROR_INSUFFICIENT_RESOURCES = -9,
    PICO_ERROR_INVALID_ADDRESS = -10,
    PICO_ERROR_BAD_ALIGNMENT = -11,
    PICO_ERROR_INVALID_STATE = -12,
    PICO_ERROR_BUFFER_TOO_SMALL = -13,
    PICO_ERROR_PRECONDITION_NOT_MET = -14,
    PICO_ERROR_MODIFIED_DATA = -15,
    PICO_ERROR_INVALID_DATA = -16,
    PICO_ERROR_NOT_FOUND = -17,
    PICO_ERROR_UNSUPPORTED_MODIFICATION = -18,
    PICO_ERROR_LOCK_REQUIRED = -19,
    PICO_ERROR_VERSION_MISMATCH = -20,
    PICO_ERROR_RESOURCE_IN_USE = -21
};
#define _PICO_TIME_H 
#define _HARDWARE_TIMER_H 
#define _HARDWARE_STRUCTS_TIMER_H 
#define _HARDWARE_ADDRESS_MAPPED_H 
#define check_hw_layout(type,member,offset) static_assert(offsetof(type, member) == (offset), "hw offset mismatch")
#define check_hw_size(type,size) static_assert(sizeof(type) == (size), "hw size mismatch")
#define PARAM_ASSERTIONS_ENABLED_ADDRESS_ALIAS 0
typedef volatile uint64_t io_rw_64;
typedef const volatile uint64_t io_ro_64;
typedef volatile uint64_t io_wo_64;
typedef volatile uint32_t io_rw_32;
typedef const volatile uint32_t io_ro_32;
typedef volatile uint32_t io_wo_32;
typedef volatile uint16_t io_rw_16;
typedef const volatile uint16_t io_ro_16;
typedef volatile uint16_t io_wo_16;
typedef volatile uint8_t io_rw_8;
typedef const volatile uint8_t io_ro_8;
typedef volatile uint8_t io_wo_8;
typedef volatile uint8_t *const ioptr;
typedef ioptr const const_ioptr;
#define _REG_(x) 
#define hw_alias_check_addr(addr) ((uintptr_t)(addr))
#define hw_set_alias_untyped(addr) ((void *)(REG_ALIAS_SET_BITS + hw_alias_check_addr(addr)))
#define hw_clear_alias_untyped(addr) ((void *)(REG_ALIAS_CLR_BITS + hw_alias_check_addr(addr)))
#define hw_xor_alias_untyped(addr) ((void *)(REG_ALIAS_XOR_BITS + hw_alias_check_addr(addr)))
#define hw_set_alias(p) ((typeof(p))hw_set_alias_untyped(p))
#define hw_clear_alias(p) ((typeof(p))hw_clear_alias_untyped(p))
#define hw_xor_alias(p) ((typeof(p))hw_xor_alias_untyped(p))
#define xip_noalloc_alias(p) ((typeof(p))xip_noalloc_alias_untyped(p))
#define xip_nocache_alias(p) ((typeof(p))xip_nocache_alias_untyped(p))
#define xip_nocache_noalloc_alias(p) ((typeof(p))xip_nocache_noalloc_alias_untyped(p))
__inline__ __attribute__((__always_inline__)) static void hw_set_bits(io_rw_32 *addr, uint32_t mask) {
    *(io_rw_32 *) ((void *)((0x2u << 12u) + ((uintptr_t)((volatile void *) addr)))) = mask;
}
__inline__ __attribute__((__always_inline__)) static void hw_clear_bits(io_rw_32 *addr, uint32_t mask) {
    *(io_rw_32 *) ((void *)((0x3u << 12u) + ((uintptr_t)((volatile void *) addr)))) = mask;
}
__inline__ __attribute__((__always_inline__)) static void hw_xor_bits(io_rw_32 *addr, uint32_t mask) {
    *(io_rw_32 *) ((void *)((0x1u << 12u) + ((uintptr_t)((volatile void *) addr)))) = mask;
}
__inline__ __attribute__((__always_inline__)) static void hw_write_masked(io_rw_32 *addr, uint32_t values, uint32_t write_mask) {
    hw_xor_bits(addr, (*addr ^ values) & write_mask);
}
#define _HARDWARE_STRUCTS_ACCESSCTRL_H 
#define _HARDWARE_REGS_ACCESSCTRL_H 
#define ACCESSCTRL_LOCK_OFFSET 0x00000000u
#define ACCESSCTRL_LOCK_BITS 0x0000000fu
#define ACCESSCTRL_LOCK_RESET 0x00000004u
#define ACCESSCTRL_LOCK_DEBUG_RESET 0x0u
#define ACCESSCTRL_LOCK_DEBUG_BITS 0x00000008u
#define ACCESSCTRL_LOCK_DEBUG_MSB 3u
#define ACCESSCTRL_LOCK_DEBUG_LSB 3u
#define ACCESSCTRL_LOCK_DEBUG_ACCESS "RW"
#define ACCESSCTRL_LOCK_DMA_RESET 0x1u
#define ACCESSCTRL_LOCK_DMA_BITS 0x00000004u
#define ACCESSCTRL_LOCK_DMA_MSB 2u
#define ACCESSCTRL_LOCK_DMA_LSB 2u
#define ACCESSCTRL_LOCK_DMA_ACCESS "RO"
#define ACCESSCTRL_LOCK_CORE1_RESET 0x0u
#define ACCESSCTRL_LOCK_CORE1_BITS 0x00000002u
#define ACCESSCTRL_LOCK_CORE1_MSB 1u
#define ACCESSCTRL_LOCK_CORE1_LSB 1u
#define ACCESSCTRL_LOCK_CORE1_ACCESS "RW"
#define ACCESSCTRL_LOCK_CORE0_RESET 0x0u
#define ACCESSCTRL_LOCK_CORE0_BITS 0x00000001u
#define ACCESSCTRL_LOCK_CORE0_MSB 0u
#define ACCESSCTRL_LOCK_CORE0_LSB 0u
#define ACCESSCTRL_LOCK_CORE0_ACCESS "RW"
#define ACCESSCTRL_FORCE_CORE_NS_OFFSET 0x00000004u
#define ACCESSCTRL_FORCE_CORE_NS_BITS 0x00000002u
#define ACCESSCTRL_FORCE_CORE_NS_RESET 0x00000000u
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_RESET 0x0u
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_BITS 0x00000002u
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_MSB 1u
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_LSB 1u
#define ACCESSCTRL_FORCE_CORE_NS_CORE1_ACCESS "RW"
#define ACCESSCTRL_CFGRESET_OFFSET 0x00000008u
#define ACCESSCTRL_CFGRESET_BITS 0x00000001u
#define ACCESSCTRL_CFGRESET_RESET 0x00000000u
#define ACCESSCTRL_CFGRESET_MSB 0u
#define ACCESSCTRL_CFGRESET_LSB 0u
#define ACCESSCTRL_CFGRESET_ACCESS "SC"
#define ACCESSCTRL_GPIO_NSMASK0_OFFSET 0x0000000cu
#define ACCESSCTRL_GPIO_NSMASK0_BITS 0xffffffffu
#define ACCESSCTRL_GPIO_NSMASK0_RESET 0x00000000u
#define ACCESSCTRL_GPIO_NSMASK0_MSB 31u
#define ACCESSCTRL_GPIO_NSMASK0_LSB 0u
#define ACCESSCTRL_GPIO_NSMASK0_ACCESS "RW"
#define ACCESSCTRL_GPIO_NSMASK1_OFFSET 0x00000010u
#define ACCESSCTRL_GPIO_NSMASK1_BITS 0xff00ffffu
#define ACCESSCTRL_GPIO_NSMASK1_RESET 0x00000000u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_RESET 0x0u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_BITS 0xf0000000u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_MSB 31u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_LSB 28u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_ACCESS "RW"
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_RESET 0x0u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_BITS 0x08000000u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_MSB 27u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_LSB 27u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_ACCESS "RW"
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_RESET 0x0u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_BITS 0x04000000u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_MSB 26u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_LSB 26u
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_ACCESS "RW"
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_RESET 0x0u
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_BITS 0x02000000u
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_MSB 25u
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_LSB 25u
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM_ACCESS "RW"
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_RESET 0x0u
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_BITS 0x01000000u
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_MSB 24u
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_LSB 24u
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP_ACCESS "RW"
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_RESET 0x0000u
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_BITS 0x0000ffffu
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_MSB 15u
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_LSB 0u
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_ACCESS "RW"
#define ACCESSCTRL_ROM_OFFSET 0x00000014u
#define ACCESSCTRL_ROM_BITS 0x000000ffu
#define ACCESSCTRL_ROM_RESET 0x000000ffu
#define ACCESSCTRL_ROM_DBG_RESET 0x1u
#define ACCESSCTRL_ROM_DBG_BITS 0x00000080u
#define ACCESSCTRL_ROM_DBG_MSB 7u
#define ACCESSCTRL_ROM_DBG_LSB 7u
#define ACCESSCTRL_ROM_DBG_ACCESS "RW"
#define ACCESSCTRL_ROM_DMA_RESET 0x1u
#define ACCESSCTRL_ROM_DMA_BITS 0x00000040u
#define ACCESSCTRL_ROM_DMA_MSB 6u
#define ACCESSCTRL_ROM_DMA_LSB 6u
#define ACCESSCTRL_ROM_DMA_ACCESS "RW"
#define ACCESSCTRL_ROM_CORE1_RESET 0x1u
#define ACCESSCTRL_ROM_CORE1_BITS 0x00000020u
#define ACCESSCTRL_ROM_CORE1_MSB 5u
#define ACCESSCTRL_ROM_CORE1_LSB 5u
#define ACCESSCTRL_ROM_CORE1_ACCESS "RW"
#define ACCESSCTRL_ROM_CORE0_RESET 0x1u
#define ACCESSCTRL_ROM_CORE0_BITS 0x00000010u
#define ACCESSCTRL_ROM_CORE0_MSB 4u
#define ACCESSCTRL_ROM_CORE0_LSB 4u
#define ACCESSCTRL_ROM_CORE0_ACCESS "RW"
#define ACCESSCTRL_ROM_SP_RESET 0x1u
#define ACCESSCTRL_ROM_SP_BITS 0x00000008u
#define ACCESSCTRL_ROM_SP_MSB 3u
#define ACCESSCTRL_ROM_SP_LSB 3u
#define ACCESSCTRL_ROM_SP_ACCESS "RW"
#define ACCESSCTRL_ROM_SU_RESET 0x1u
#define ACCESSCTRL_ROM_SU_BITS 0x00000004u
#define ACCESSCTRL_ROM_SU_MSB 2u
#define ACCESSCTRL_ROM_SU_LSB 2u
#define ACCESSCTRL_ROM_SU_ACCESS "RW"
#define ACCESSCTRL_ROM_NSP_RESET 0x1u
#define ACCESSCTRL_ROM_NSP_BITS 0x00000002u
#define ACCESSCTRL_ROM_NSP_MSB 1u
#define ACCESSCTRL_ROM_NSP_LSB 1u
#define ACCESSCTRL_ROM_NSP_ACCESS "RW"
#define ACCESSCTRL_ROM_NSU_RESET 0x1u
#define ACCESSCTRL_ROM_NSU_BITS 0x00000001u
#define ACCESSCTRL_ROM_NSU_MSB 0u
#define ACCESSCTRL_ROM_NSU_LSB 0u
#define ACCESSCTRL_ROM_NSU_ACCESS "RW"
#define ACCESSCTRL_XIP_MAIN_OFFSET 0x00000018u
#define ACCESSCTRL_XIP_MAIN_BITS 0x000000ffu
#define ACCESSCTRL_XIP_MAIN_RESET 0x000000ffu
#define ACCESSCTRL_XIP_MAIN_DBG_RESET 0x1u
#define ACCESSCTRL_XIP_MAIN_DBG_BITS 0x00000080u
#define ACCESSCTRL_XIP_MAIN_DBG_MSB 7u
#define ACCESSCTRL_XIP_MAIN_DBG_LSB 7u
#define ACCESSCTRL_XIP_MAIN_DBG_ACCESS "RW"
#define ACCESSCTRL_XIP_MAIN_DMA_RESET 0x1u
#define ACCESSCTRL_XIP_MAIN_DMA_BITS 0x00000040u
#define ACCESSCTRL_XIP_MAIN_DMA_MSB 6u
#define ACCESSCTRL_XIP_MAIN_DMA_LSB 6u
#define ACCESSCTRL_XIP_MAIN_DMA_ACCESS "RW"
#define ACCESSCTRL_XIP_MAIN_CORE1_RESET 0x1u
#define ACCESSCTRL_XIP_MAIN_CORE1_BITS 0x00000020u
#define ACCESSCTRL_XIP_MAIN_CORE1_MSB 5u
#define ACCESSCTRL_XIP_MAIN_CORE1_LSB 5u
#define ACCESSCTRL_XIP_MAIN_CORE1_ACCESS "RW"
#define ACCESSCTRL_XIP_MAIN_CORE0_RESET 0x1u
#define ACCESSCTRL_XIP_MAIN_CORE0_BITS 0x00000010u
#define ACCESSCTRL_XIP_MAIN_CORE0_MSB 4u
#define ACCESSCTRL_XIP_MAIN_CORE0_LSB 4u
#define ACCESSCTRL_XIP_MAIN_CORE0_ACCESS "RW"
#define ACCESSCTRL_XIP_MAIN_SP_RESET 0x1u
#define ACCESSCTRL_XIP_MAIN_SP_BITS 0x00000008u
#define ACCESSCTRL_XIP_MAIN_SP_MSB 3u
#define ACCESSCTRL_XIP_MAIN_SP_LSB 3u
#define ACCESSCTRL_XIP_MAIN_SP_ACCESS "RW"
#define ACCESSCTRL_XIP_MAIN_SU_RESET 0x1u
#define ACCESSCTRL_XIP_MAIN_SU_BITS 0x00000004u
#define ACCESSCTRL_XIP_MAIN_SU_MSB 2u
#define ACCESSCTRL_XIP_MAIN_SU_LSB 2u
#define ACCESSCTRL_XIP_MAIN_SU_ACCESS "RW"
#define ACCESSCTRL_XIP_MAIN_NSP_RESET 0x1u
#define ACCESSCTRL_XIP_MAIN_NSP_BITS 0x00000002u
#define ACCESSCTRL_XIP_MAIN_NSP_MSB 1u
#define ACCESSCTRL_XIP_MAIN_NSP_LSB 1u
#define ACCESSCTRL_XIP_MAIN_NSP_ACCESS "RW"
#define ACCESSCTRL_XIP_MAIN_NSU_RESET 0x1u
#define ACCESSCTRL_XIP_MAIN_NSU_BITS 0x00000001u
#define ACCESSCTRL_XIP_MAIN_NSU_MSB 0u
#define ACCESSCTRL_XIP_MAIN_NSU_LSB 0u
#define ACCESSCTRL_XIP_MAIN_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM0_OFFSET 0x0000001cu
#define ACCESSCTRL_SRAM0_BITS 0x000000ffu
#define ACCESSCTRL_SRAM0_RESET 0x000000ffu
#define ACCESSCTRL_SRAM0_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM0_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM0_DBG_MSB 7u
#define ACCESSCTRL_SRAM0_DBG_LSB 7u
#define ACCESSCTRL_SRAM0_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM0_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM0_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM0_DMA_MSB 6u
#define ACCESSCTRL_SRAM0_DMA_LSB 6u
#define ACCESSCTRL_SRAM0_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM0_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM0_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM0_CORE1_MSB 5u
#define ACCESSCTRL_SRAM0_CORE1_LSB 5u
#define ACCESSCTRL_SRAM0_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM0_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM0_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM0_CORE0_MSB 4u
#define ACCESSCTRL_SRAM0_CORE0_LSB 4u
#define ACCESSCTRL_SRAM0_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM0_SP_RESET 0x1u
#define ACCESSCTRL_SRAM0_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM0_SP_MSB 3u
#define ACCESSCTRL_SRAM0_SP_LSB 3u
#define ACCESSCTRL_SRAM0_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM0_SU_RESET 0x1u
#define ACCESSCTRL_SRAM0_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM0_SU_MSB 2u
#define ACCESSCTRL_SRAM0_SU_LSB 2u
#define ACCESSCTRL_SRAM0_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM0_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM0_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM0_NSP_MSB 1u
#define ACCESSCTRL_SRAM0_NSP_LSB 1u
#define ACCESSCTRL_SRAM0_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM0_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM0_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM0_NSU_MSB 0u
#define ACCESSCTRL_SRAM0_NSU_LSB 0u
#define ACCESSCTRL_SRAM0_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM1_OFFSET 0x00000020u
#define ACCESSCTRL_SRAM1_BITS 0x000000ffu
#define ACCESSCTRL_SRAM1_RESET 0x000000ffu
#define ACCESSCTRL_SRAM1_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM1_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM1_DBG_MSB 7u
#define ACCESSCTRL_SRAM1_DBG_LSB 7u
#define ACCESSCTRL_SRAM1_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM1_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM1_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM1_DMA_MSB 6u
#define ACCESSCTRL_SRAM1_DMA_LSB 6u
#define ACCESSCTRL_SRAM1_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM1_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM1_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM1_CORE1_MSB 5u
#define ACCESSCTRL_SRAM1_CORE1_LSB 5u
#define ACCESSCTRL_SRAM1_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM1_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM1_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM1_CORE0_MSB 4u
#define ACCESSCTRL_SRAM1_CORE0_LSB 4u
#define ACCESSCTRL_SRAM1_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM1_SP_RESET 0x1u
#define ACCESSCTRL_SRAM1_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM1_SP_MSB 3u
#define ACCESSCTRL_SRAM1_SP_LSB 3u
#define ACCESSCTRL_SRAM1_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM1_SU_RESET 0x1u
#define ACCESSCTRL_SRAM1_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM1_SU_MSB 2u
#define ACCESSCTRL_SRAM1_SU_LSB 2u
#define ACCESSCTRL_SRAM1_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM1_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM1_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM1_NSP_MSB 1u
#define ACCESSCTRL_SRAM1_NSP_LSB 1u
#define ACCESSCTRL_SRAM1_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM1_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM1_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM1_NSU_MSB 0u
#define ACCESSCTRL_SRAM1_NSU_LSB 0u
#define ACCESSCTRL_SRAM1_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM2_OFFSET 0x00000024u
#define ACCESSCTRL_SRAM2_BITS 0x000000ffu
#define ACCESSCTRL_SRAM2_RESET 0x000000ffu
#define ACCESSCTRL_SRAM2_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM2_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM2_DBG_MSB 7u
#define ACCESSCTRL_SRAM2_DBG_LSB 7u
#define ACCESSCTRL_SRAM2_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM2_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM2_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM2_DMA_MSB 6u
#define ACCESSCTRL_SRAM2_DMA_LSB 6u
#define ACCESSCTRL_SRAM2_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM2_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM2_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM2_CORE1_MSB 5u
#define ACCESSCTRL_SRAM2_CORE1_LSB 5u
#define ACCESSCTRL_SRAM2_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM2_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM2_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM2_CORE0_MSB 4u
#define ACCESSCTRL_SRAM2_CORE0_LSB 4u
#define ACCESSCTRL_SRAM2_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM2_SP_RESET 0x1u
#define ACCESSCTRL_SRAM2_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM2_SP_MSB 3u
#define ACCESSCTRL_SRAM2_SP_LSB 3u
#define ACCESSCTRL_SRAM2_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM2_SU_RESET 0x1u
#define ACCESSCTRL_SRAM2_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM2_SU_MSB 2u
#define ACCESSCTRL_SRAM2_SU_LSB 2u
#define ACCESSCTRL_SRAM2_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM2_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM2_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM2_NSP_MSB 1u
#define ACCESSCTRL_SRAM2_NSP_LSB 1u
#define ACCESSCTRL_SRAM2_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM2_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM2_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM2_NSU_MSB 0u
#define ACCESSCTRL_SRAM2_NSU_LSB 0u
#define ACCESSCTRL_SRAM2_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM3_OFFSET 0x00000028u
#define ACCESSCTRL_SRAM3_BITS 0x000000ffu
#define ACCESSCTRL_SRAM3_RESET 0x000000ffu
#define ACCESSCTRL_SRAM3_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM3_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM3_DBG_MSB 7u
#define ACCESSCTRL_SRAM3_DBG_LSB 7u
#define ACCESSCTRL_SRAM3_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM3_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM3_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM3_DMA_MSB 6u
#define ACCESSCTRL_SRAM3_DMA_LSB 6u
#define ACCESSCTRL_SRAM3_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM3_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM3_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM3_CORE1_MSB 5u
#define ACCESSCTRL_SRAM3_CORE1_LSB 5u
#define ACCESSCTRL_SRAM3_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM3_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM3_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM3_CORE0_MSB 4u
#define ACCESSCTRL_SRAM3_CORE0_LSB 4u
#define ACCESSCTRL_SRAM3_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM3_SP_RESET 0x1u
#define ACCESSCTRL_SRAM3_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM3_SP_MSB 3u
#define ACCESSCTRL_SRAM3_SP_LSB 3u
#define ACCESSCTRL_SRAM3_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM3_SU_RESET 0x1u
#define ACCESSCTRL_SRAM3_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM3_SU_MSB 2u
#define ACCESSCTRL_SRAM3_SU_LSB 2u
#define ACCESSCTRL_SRAM3_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM3_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM3_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM3_NSP_MSB 1u
#define ACCESSCTRL_SRAM3_NSP_LSB 1u
#define ACCESSCTRL_SRAM3_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM3_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM3_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM3_NSU_MSB 0u
#define ACCESSCTRL_SRAM3_NSU_LSB 0u
#define ACCESSCTRL_SRAM3_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM4_OFFSET 0x0000002cu
#define ACCESSCTRL_SRAM4_BITS 0x000000ffu
#define ACCESSCTRL_SRAM4_RESET 0x000000ffu
#define ACCESSCTRL_SRAM4_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM4_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM4_DBG_MSB 7u
#define ACCESSCTRL_SRAM4_DBG_LSB 7u
#define ACCESSCTRL_SRAM4_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM4_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM4_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM4_DMA_MSB 6u
#define ACCESSCTRL_SRAM4_DMA_LSB 6u
#define ACCESSCTRL_SRAM4_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM4_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM4_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM4_CORE1_MSB 5u
#define ACCESSCTRL_SRAM4_CORE1_LSB 5u
#define ACCESSCTRL_SRAM4_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM4_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM4_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM4_CORE0_MSB 4u
#define ACCESSCTRL_SRAM4_CORE0_LSB 4u
#define ACCESSCTRL_SRAM4_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM4_SP_RESET 0x1u
#define ACCESSCTRL_SRAM4_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM4_SP_MSB 3u
#define ACCESSCTRL_SRAM4_SP_LSB 3u
#define ACCESSCTRL_SRAM4_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM4_SU_RESET 0x1u
#define ACCESSCTRL_SRAM4_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM4_SU_MSB 2u
#define ACCESSCTRL_SRAM4_SU_LSB 2u
#define ACCESSCTRL_SRAM4_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM4_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM4_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM4_NSP_MSB 1u
#define ACCESSCTRL_SRAM4_NSP_LSB 1u
#define ACCESSCTRL_SRAM4_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM4_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM4_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM4_NSU_MSB 0u
#define ACCESSCTRL_SRAM4_NSU_LSB 0u
#define ACCESSCTRL_SRAM4_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM5_OFFSET 0x00000030u
#define ACCESSCTRL_SRAM5_BITS 0x000000ffu
#define ACCESSCTRL_SRAM5_RESET 0x000000ffu
#define ACCESSCTRL_SRAM5_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM5_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM5_DBG_MSB 7u
#define ACCESSCTRL_SRAM5_DBG_LSB 7u
#define ACCESSCTRL_SRAM5_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM5_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM5_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM5_DMA_MSB 6u
#define ACCESSCTRL_SRAM5_DMA_LSB 6u
#define ACCESSCTRL_SRAM5_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM5_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM5_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM5_CORE1_MSB 5u
#define ACCESSCTRL_SRAM5_CORE1_LSB 5u
#define ACCESSCTRL_SRAM5_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM5_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM5_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM5_CORE0_MSB 4u
#define ACCESSCTRL_SRAM5_CORE0_LSB 4u
#define ACCESSCTRL_SRAM5_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM5_SP_RESET 0x1u
#define ACCESSCTRL_SRAM5_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM5_SP_MSB 3u
#define ACCESSCTRL_SRAM5_SP_LSB 3u
#define ACCESSCTRL_SRAM5_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM5_SU_RESET 0x1u
#define ACCESSCTRL_SRAM5_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM5_SU_MSB 2u
#define ACCESSCTRL_SRAM5_SU_LSB 2u
#define ACCESSCTRL_SRAM5_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM5_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM5_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM5_NSP_MSB 1u
#define ACCESSCTRL_SRAM5_NSP_LSB 1u
#define ACCESSCTRL_SRAM5_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM5_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM5_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM5_NSU_MSB 0u
#define ACCESSCTRL_SRAM5_NSU_LSB 0u
#define ACCESSCTRL_SRAM5_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM6_OFFSET 0x00000034u
#define ACCESSCTRL_SRAM6_BITS 0x000000ffu
#define ACCESSCTRL_SRAM6_RESET 0x000000ffu
#define ACCESSCTRL_SRAM6_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM6_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM6_DBG_MSB 7u
#define ACCESSCTRL_SRAM6_DBG_LSB 7u
#define ACCESSCTRL_SRAM6_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM6_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM6_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM6_DMA_MSB 6u
#define ACCESSCTRL_SRAM6_DMA_LSB 6u
#define ACCESSCTRL_SRAM6_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM6_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM6_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM6_CORE1_MSB 5u
#define ACCESSCTRL_SRAM6_CORE1_LSB 5u
#define ACCESSCTRL_SRAM6_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM6_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM6_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM6_CORE0_MSB 4u
#define ACCESSCTRL_SRAM6_CORE0_LSB 4u
#define ACCESSCTRL_SRAM6_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM6_SP_RESET 0x1u
#define ACCESSCTRL_SRAM6_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM6_SP_MSB 3u
#define ACCESSCTRL_SRAM6_SP_LSB 3u
#define ACCESSCTRL_SRAM6_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM6_SU_RESET 0x1u
#define ACCESSCTRL_SRAM6_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM6_SU_MSB 2u
#define ACCESSCTRL_SRAM6_SU_LSB 2u
#define ACCESSCTRL_SRAM6_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM6_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM6_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM6_NSP_MSB 1u
#define ACCESSCTRL_SRAM6_NSP_LSB 1u
#define ACCESSCTRL_SRAM6_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM6_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM6_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM6_NSU_MSB 0u
#define ACCESSCTRL_SRAM6_NSU_LSB 0u
#define ACCESSCTRL_SRAM6_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM7_OFFSET 0x00000038u
#define ACCESSCTRL_SRAM7_BITS 0x000000ffu
#define ACCESSCTRL_SRAM7_RESET 0x000000ffu
#define ACCESSCTRL_SRAM7_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM7_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM7_DBG_MSB 7u
#define ACCESSCTRL_SRAM7_DBG_LSB 7u
#define ACCESSCTRL_SRAM7_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM7_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM7_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM7_DMA_MSB 6u
#define ACCESSCTRL_SRAM7_DMA_LSB 6u
#define ACCESSCTRL_SRAM7_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM7_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM7_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM7_CORE1_MSB 5u
#define ACCESSCTRL_SRAM7_CORE1_LSB 5u
#define ACCESSCTRL_SRAM7_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM7_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM7_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM7_CORE0_MSB 4u
#define ACCESSCTRL_SRAM7_CORE0_LSB 4u
#define ACCESSCTRL_SRAM7_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM7_SP_RESET 0x1u
