gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
    io_ro_32 timerawh;
   
    io_ro_32 timerawl;
   
    io_rw_32 dbgpause;
   
    io_rw_32 pause;
   
    io_rw_32 locked;
   
    io_rw_32 source;
   
    io_rw_32 intr;
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
} timer_hw_t;
#define timer0_hw ((timer_hw_t *)TIMER0_BASE)
#define timer1_hw ((timer_hw_t *)TIMER1_BASE)
_Static_assert(sizeof (timer_hw_t) == 0x004c, "");
#define _INTCTRL_H 
typedef enum irq_num_rp2350 {
    TIMER0_IRQ_0 = 0,
    TIMER0_IRQ_1 = 1,
    TIMER0_IRQ_2 = 2,
    TIMER0_IRQ_3 = 3,
    TIMER1_IRQ_0 = 4,
    TIMER1_IRQ_1 = 5,
    TIMER1_IRQ_2 = 6,
    TIMER1_IRQ_3 = 7,
    PWM_IRQ_WRAP_0 = 8,
    PWM_IRQ_WRAP_1 = 9,
    DMA_IRQ_0 = 10,
    DMA_IRQ_1 = 11,
    DMA_IRQ_2 = 12,
    DMA_IRQ_3 = 13,
    USBCTRL_IRQ = 14,
    PIO0_IRQ_0 = 15,
    PIO0_IRQ_1 = 16,
    PIO1_IRQ_0 = 17,
    PIO1_IRQ_1 = 18,
    PIO2_IRQ_0 = 19,
    PIO2_IRQ_1 = 20,
    IO_IRQ_BANK0 = 21,
    IO_IRQ_BANK0_NS = 22,
    IO_IRQ_QSPI = 23,
    IO_IRQ_QSPI_NS = 24,
    SIO_IRQ_FIFO = 25,
    SIO_IRQ_BELL = 26,
    SIO_IRQ_FIFO_NS = 27,
    SIO_IRQ_BELL_NS = 28,
    SIO_IRQ_MTIMECMP = 29,
    CLOCKS_IRQ = 30,
    SPI0_IRQ = 31,
    SPI1_IRQ = 32,
    UART0_IRQ = 33,
    UART1_IRQ = 34,
    ADC_IRQ_FIFO = 35,
    I2C0_IRQ = 36,
    I2C1_IRQ = 37,
    OTP_IRQ = 38,
    TRNG_IRQ = 39,
    PROC0_IRQ_CTI = 40,
    PROC1_IRQ_CTI = 41,
    PLL_SYS_IRQ = 42,
    PLL_USB_IRQ = 43,
    POWMAN_IRQ_POW = 44,
    POWMAN_IRQ_TIMER = 45,
    SPARE_IRQ_0 = 46,
    SPARE_IRQ_1 = 47,
    SPARE_IRQ_2 = 48,
    SPARE_IRQ_3 = 49,
    SPARE_IRQ_4 = 50,
    SPARE_IRQ_5 = 51,
    IRQ_COUNT
} irq_num_t;
#define isr_timer0_0 isr_irq0
#define isr_timer0_1 isr_irq1
#define isr_timer0_2 isr_irq2
#define isr_timer0_3 isr_irq3
#define isr_timer1_0 isr_irq4
#define isr_timer1_1 isr_irq5
#define isr_timer1_2 isr_irq6
#define isr_timer1_3 isr_irq7
#define isr_pwm_wrap_0 isr_irq8
#define isr_pwm_wrap_1 isr_irq9
#define isr_dma_0 isr_irq10
#define isr_dma_1 isr_irq11
#define isr_dma_2 isr_irq12
#define isr_dma_3 isr_irq13
#define isr_usbctrl isr_irq14
#define isr_pio0_0 isr_irq15
#define isr_pio0_1 isr_irq16
#define isr_pio1_0 isr_irq17
#define isr_pio1_1 isr_irq18
#define isr_pio2_0 isr_irq19
#define isr_pio2_1 isr_irq20
#define isr_io_bank0 isr_irq21
#define isr_io_bank0_ns isr_irq22
#define isr_io_qspi isr_irq23
#define isr_io_qspi_ns isr_irq24
#define isr_sio_fifo isr_irq25
#define isr_sio_bell isr_irq26
#define isr_sio_fifo_ns isr_irq27
#define isr_sio_bell_ns isr_irq28
#define isr_sio_mtimecmp isr_irq29
#define isr_clocks isr_irq30
#define isr_spi0 isr_irq31
#define isr_spi1 isr_irq32
#define isr_uart0 isr_irq33
#define isr_uart1 isr_irq34
#define isr_adc_fifo isr_irq35
#define isr_i2c0 isr_irq36
#define isr_i2c1 isr_irq37
#define isr_otp isr_irq38
#define isr_trng isr_irq39
#define isr_proc0_cti isr_irq40
#define isr_proc1_cti isr_irq41
#define isr_pll_sys isr_irq42
#define isr_pll_usb isr_irq43
#define isr_powman_pow isr_irq44
#define isr_powman_timer isr_irq45
#define isr_spare_0 isr_irq46
#define isr_spare_1 isr_irq47
#define isr_spare_2 isr_irq48
#define isr_spare_3 isr_irq49
#define isr_spare_4 isr_irq50
#define isr_spare_5 isr_irq51
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_TIMER 0
#define TIMER_NUM(timer) ((timer) == timer1_hw)
#define TIMER_INSTANCE(num) ((num) ? timer1_hw : timer0_hw)
_Static_assert(TIMER1_IRQ_3 == TIMER0_IRQ_0 + 7, "");
#define TIMER_ALARM_IRQ_NUM(timer,alarm_num) (TIMER0_IRQ_0 + TIMER_NUM(timer) * NUM_ALARMS + (alarm_num))
_Static_assert(TIMER1_IRQ_3 == TIMER0_IRQ_0 + 7, "");
#define TIMER_ALARM_NUM_FROM_IRQ(irq_num) (((irq_num) - TIMER0_IRQ_0) & 3u)
_Static_assert(TIMER1_IRQ_3 == TIMER0_IRQ_0 + 7, "");
#define TIMER_NUM_FROM_IRQ(irq_num) (((irq_num) - TIMER0_IRQ_0) >> 2)
#define PICO_DEFAULT_TIMER 0
#define PICO_DEFAULT_TIMER_INSTANCE() (__CONCAT(__CONCAT(timer,PICO_DEFAULT_TIMER), _hw))
#define timer_hw PICO_DEFAULT_TIMER_INSTANCE()
static inline void check_hardware_alarm_num_param(__attribute__((__unused__)) uint alarm_num) {
    ({if (((0 || 0) && !0)) ((!(alarm_num >= 4u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_timer/include/hardware/timer.h", 189, __func__, "!(alarm_num >= 4u)"));});
}
static inline uint32_t timer_time_us_32(timer_hw_t *timer) {
    return timer->timerawl;
}
static inline uint32_t time_us_32(void) {
    return timer_time_us_32((((timer_hw_t *)0x400b0000u)));
}
uint64_t timer_time_us_64(timer_hw_t *timer);
uint64_t time_us_64(void);
void timer_busy_wait_us_32(timer_hw_t *timer, uint32_t delay_us);
void busy_wait_us_32(uint32_t delay_us);
void timer_busy_wait_us(timer_hw_t *timer, uint64_t delay_us);
void busy_wait_us(uint64_t delay_us);
void timer_busy_wait_ms(timer_hw_t *timer, uint32_t delay_ms);
void busy_wait_ms(uint32_t delay_ms);
void timer_busy_wait_until(timer_hw_t *timer, absolute_time_t t);
void busy_wait_until(absolute_time_t t);
static inline _Bool timer_time_reached(timer_hw_t *timer, absolute_time_t t) {
    uint64_t target = to_us_since_boot(t);
    uint32_t hi_target = (uint32_t)(target >> 32u);
    uint32_t hi = timer->timerawh;
    return (hi >= hi_target && (timer->timerawl >= (uint32_t) target || hi != hi_target));
}
static inline _Bool time_reached(absolute_time_t t) {
    return timer_time_reached((((timer_hw_t *)0x400b0000u)), t);
}
typedef void (*hardware_alarm_callback_t)(uint alarm_num);
void timer_hardware_alarm_claim(timer_hw_t *timer, uint alarm_num);
void hardware_alarm_claim(uint alarm_num);
int timer_hardware_alarm_claim_unused(timer_hw_t *timer, _Bool required);
int hardware_alarm_claim_unused(_Bool required);
void timer_hardware_alarm_unclaim(timer_hw_t *timer, uint alarm_num);
void hardware_alarm_unclaim(uint alarm_num);
_Bool timer_hardware_alarm_is_claimed(timer_hw_t *timer, uint alarm_num);
_Bool hardware_alarm_is_claimed(uint alarm_num);
void timer_hardware_alarm_set_callback(timer_hw_t *timer, uint alarm_num, hardware_alarm_callback_t callback);
void hardware_alarm_set_callback(uint alarm_num, hardware_alarm_callback_t callback);
_Bool timer_hardware_alarm_set_target(timer_hw_t *timer, uint alarm_num, absolute_time_t t);
_Bool hardware_alarm_set_target(uint alarm_num, absolute_time_t t);
void timer_hardware_alarm_cancel(timer_hw_t *timer, uint alarm_num);
void hardware_alarm_cancel(uint alarm_num);
void timer_hardware_alarm_force_irq(timer_hw_t *timer, uint alarm_num);
void hardware_alarm_force_irq(uint alarm_num);
static inline uint timer_hardware_alarm_get_irq_num(timer_hw_t *timer, uint alarm_num) {
    check_hardware_alarm_num_param(alarm_num);
    return (TIMER0_IRQ_0 + ((timer) == ((timer_hw_t *)0x400b8000u)) * 4u + (alarm_num));
}
static inline uint hardware_alarm_get_irq_num(uint alarm_num) {
    return timer_hardware_alarm_get_irq_num((((timer_hw_t *)0x400b0000u)), alarm_num);
}
static inline uint timer_get_index(timer_hw_t *timer) {
    return ((timer) == ((timer_hw_t *)0x400b8000u));
}
static inline timer_hw_t *timer_get_instance(uint timer_num) {
    ({if (((0 || 0) && !0)) ((!(timer_num >= 2u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_timer/include/hardware/timer.h", 591, __func__, "!(timer_num >= 2u)"));});
    return ((timer_num) ? ((timer_hw_t *)0x400b8000u) : ((timer_hw_t *)0x400b0000u));
}
#define PARAM_ASSERTIONS_ENABLED_PICO_TIME 0
#define PICO_TIME_SLEEP_OVERHEAD_ADJUST_US 6
static inline absolute_time_t get_absolute_time(void) {
    absolute_time_t t;
    update_us_since_boot(&t, time_us_64());
    return t;
}
static inline uint32_t us_to_ms(uint64_t us) {
    if (us >> 32u) {
        return (uint32_t)(us / 1000u);
    } else {
        return ((uint32_t)us) / 1000u;
    }
}
static inline uint32_t to_ms_since_boot(absolute_time_t t) {
    uint64_t us = to_us_since_boot(t);
    return us_to_ms(us);
}
static inline absolute_time_t delayed_by_us(const absolute_time_t t, uint64_t us) {
    absolute_time_t t2;
    uint64_t base = to_us_since_boot(t);
    uint64_t delayed = base + us;
    if ((int64_t)delayed < 0) {
        delayed = (0x7fffffffffffffffLL);
    }
    update_us_since_boot(&t2, delayed);
    return t2;
}
static inline absolute_time_t delayed_by_ms(const absolute_time_t t, uint32_t ms) {
    absolute_time_t t2;
    uint64_t base = to_us_since_boot(t);
    uint64_t delayed = base + ms * 1000ull;
    if ((int64_t)delayed < 0) {
        delayed = (0x7fffffffffffffffLL);
    }
    update_us_since_boot(&t2, delayed);
    return t2;
}
static inline absolute_time_t make_timeout_time_us(uint64_t us) {
    return delayed_by_us(get_absolute_time(), us);
}
static inline absolute_time_t make_timeout_time_ms(uint32_t ms) {
    return delayed_by_ms(get_absolute_time(), ms);
}
static inline int64_t absolute_time_diff_us(absolute_time_t from, absolute_time_t to) {
    return (int64_t)(to_us_since_boot(to) - to_us_since_boot(from));
}
static inline absolute_time_t absolute_time_min(absolute_time_t a, absolute_time_t b) {
    return to_us_since_boot(a) < to_us_since_boot(b) ? a : b;
}
extern const absolute_time_t at_the_end_of_time;
static inline _Bool is_at_the_end_of_time(absolute_time_t t) {
    return to_us_since_boot(t) == to_us_since_boot(at_the_end_of_time);
}
extern const absolute_time_t nil_time;
static inline _Bool is_nil_time(absolute_time_t t) {
    return !to_us_since_boot(t);
}
void sleep_until(absolute_time_t target);
void sleep_us(uint64_t us);
void sleep_ms(uint32_t ms);
_Bool best_effort_wfe_or_timeout(absolute_time_t timeout_timestamp);
#define PICO_TIME_DEFAULT_ALARM_POOL_DISABLED 0
#define PICO_TIME_DEFAULT_ALARM_POOL_HARDWARE_ALARM_NUM 3
#define PICO_TIME_DEFAULT_ALARM_POOL_MAX_TIMERS 16
typedef int32_t alarm_id_t;
typedef int64_t (*alarm_callback_t)(alarm_id_t id, void *user_data);
typedef struct alarm_pool alarm_pool_t;
typedef void alarm_pool_timer_t;
void alarm_pool_init_default(void);
void runtime_init_default_alarm_pool(void);
alarm_pool_t *alarm_pool_get_default(void);
alarm_pool_t *alarm_pool_create_on_timer(alarm_pool_timer_t *timer, uint timer_alarm_num, uint max_timers);
alarm_pool_timer_t *alarm_pool_timer_for_timer_num(uint timer_num);
alarm_pool_timer_t *alarm_pool_get_default_timer(void);
static inline alarm_pool_t *alarm_pool_create(uint timer_alarm_num, uint max_timers) {
    return alarm_pool_create_on_timer(alarm_pool_get_default_timer(), timer_alarm_num, max_timers);
}
alarm_pool_t *alarm_pool_create_on_timer_with_unused_hardware_alarm(alarm_pool_timer_t *timer, uint max_timers);
static inline alarm_pool_t *alarm_pool_create_with_unused_hardware_alarm(uint max_timers) {
    return alarm_pool_create_on_timer_with_unused_hardware_alarm(alarm_pool_get_default_timer(), max_timers);
}
uint alarm_pool_timer_alarm_num(alarm_pool_t *pool);
static inline uint alarm_pool_hardware_alarm_num(alarm_pool_t *pool) {
    return alarm_pool_timer_alarm_num(pool);
}
uint alarm_pool_core_num(alarm_pool_t *pool);
void alarm_pool_destroy(alarm_pool_t *pool);
alarm_id_t alarm_pool_add_alarm_at(alarm_pool_t *pool, absolute_time_t time, alarm_callback_t callback, void *user_data, _Bool fire_if_past);
alarm_id_t alarm_pool_add_alarm_at_force_in_context(alarm_pool_t *pool, absolute_time_t time, alarm_callback_t callback,
                                                    void *user_data);
static inline alarm_id_t alarm_pool_add_alarm_in_us(alarm_pool_t *pool, uint64_t us, alarm_callback_t callback, void *user_data, _Bool fire_if_past) {
    return alarm_pool_add_alarm_at(pool, delayed_by_us(get_absolute_time(), us), callback, user_data, fire_if_past);
}
static inline alarm_id_t alarm_pool_add_alarm_in_ms(alarm_pool_t *pool, uint32_t ms, alarm_callback_t callback, void *user_data, _Bool fire_if_past) {
    return alarm_pool_add_alarm_at(pool, delayed_by_ms(get_absolute_time(), ms), callback, user_data, fire_if_past);
}
int64_t alarm_pool_remaining_alarm_time_us(alarm_pool_t *pool, alarm_id_t alarm_id);
int32_t alarm_pool_remaining_alarm_time_ms(alarm_pool_t *pool, alarm_id_t alarm_id);
_Bool alarm_pool_cancel_alarm(alarm_pool_t *pool, alarm_id_t alarm_id);
static inline alarm_id_t add_alarm_at(absolute_time_t time, alarm_callback_t callback, void *user_data, _Bool fire_if_past) {
    return alarm_pool_add_alarm_at(alarm_pool_get_default(), time, callback, user_data, fire_if_past);
}
static inline alarm_id_t add_alarm_in_us(uint64_t us, alarm_callback_t callback, void *user_data, _Bool fire_if_past) {
    return alarm_pool_add_alarm_in_us(alarm_pool_get_default(), us, callback, user_data, fire_if_past);
}
static inline alarm_id_t add_alarm_in_ms(uint32_t ms, alarm_callback_t callback, void *user_data, _Bool fire_if_past) {
    return alarm_pool_add_alarm_in_ms(alarm_pool_get_default(), ms, callback, user_data, fire_if_past);
}
static inline _Bool cancel_alarm(alarm_id_t alarm_id) {
    return alarm_pool_cancel_alarm(alarm_pool_get_default(), alarm_id);
}
int64_t remaining_alarm_time_us(alarm_id_t alarm_id);
int32_t remaining_alarm_time_ms(alarm_id_t alarm_id);
typedef struct repeating_timer repeating_timer_t;
typedef _Bool (*repeating_timer_callback_t)(repeating_timer_t *rt);
struct repeating_timer {
    int64_t delay_us;
    alarm_pool_t *pool;
    alarm_id_t alarm_id;
    repeating_timer_callback_t callback;
    void *user_data;
};
