gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define IP_ADDR_PCB_VERSION_MATCH(addr,pcb) 1
#define IP_ADDR_PCB_VERSION_MATCH_EXACT(pcb,ipaddr) 1
#define ip_addr_set_any_val(is_ipv6,ipaddr) ip_addr_set_any(is_ipv6, &(ipaddr))
#define ip_addr_set_loopback_val(is_ipv6,ipaddr) ip_addr_set_loopback(is_ipv6, &(ipaddr))
typedef ip4_addr_t ip_addr_t;
#define IPADDR4_INIT(u32val) { u32val }
#define IPADDR4_INIT_BYTES(a,b,c,d) IPADDR4_INIT(PP_HTONL(LWIP_MAKEU32(a,b,c,d)))
#define IP_IS_V4_VAL(ipaddr) 1
#define IP_IS_V6_VAL(ipaddr) 0
#define IP_IS_V4(ipaddr) 1
#define IP_IS_V6(ipaddr) 0
#define IP_IS_ANY_TYPE_VAL(ipaddr) 0
#define IP_SET_TYPE_VAL(ipaddr,iptype) 
#define IP_SET_TYPE(ipaddr,iptype) 
#define IP_GET_TYPE(ipaddr) IPADDR_TYPE_V4
#define IP_ADDR_RAW_SIZE(ipaddr) sizeof(ip4_addr_t)
#define ip_2_ip4(ipaddr) (ipaddr)
#define IP_ADDR4(ipaddr,a,b,c,d) IP4_ADDR(ipaddr,a,b,c,d)
#define ip_addr_copy(dest,src) ip4_addr_copy(dest, src)
#define ip_addr_copy_from_ip4(dest,src) ip4_addr_copy(dest, src)
#define ip_addr_set_ip4_u32(ipaddr,val) ip4_addr_set_u32(ip_2_ip4(ipaddr), val)
#define ip_addr_set_ip4_u32_val(ipaddr,val) ip_addr_set_ip4_u32(&(ipaddr), val)
#define ip_addr_get_ip4_u32(ipaddr) ip4_addr_get_u32(ip_2_ip4(ipaddr))
#define ip_addr_set(dest,src) ip4_addr_set(dest, src)
#define ip_addr_set_ipaddr(dest,src) ip4_addr_set(dest, src)
#define ip_addr_set_zero(ipaddr) ip4_addr_set_zero(ipaddr)
#define ip_addr_set_zero_ip4(ipaddr) ip4_addr_set_zero(ipaddr)
#define ip_addr_set_any(is_ipv6,ipaddr) ip4_addr_set_any(ipaddr)
#define ip_addr_set_loopback(is_ipv6,ipaddr) ip4_addr_set_loopback(ipaddr)
#define ip_addr_set_hton(dest,src) ip4_addr_set_hton(dest, src)
#define ip_addr_get_network(target,host,mask) ip4_addr_get_network(target, host, mask)
#define ip_addr_netcmp(addr1,addr2,mask) ip4_addr_net_eq(addr1, addr2, mask)
#define ip_addr_net_eq(addr1,addr2,mask) ip4_addr_net_eq(addr1, addr2, mask)
#define ip_addr_cmp(addr1,addr2) ip4_addr_eq(addr1, addr2)
#define ip_addr_eq(addr1,addr2) ip4_addr_eq(addr1, addr2)
#define ip_addr_isany(ipaddr) ip4_addr_isany(ipaddr)
#define ip_addr_isany_val(ipaddr) ip4_addr_isany_val(ipaddr)
#define ip_addr_isloopback(ipaddr) ip4_addr_isloopback(ipaddr)
#define ip_addr_islinklocal(ipaddr) ip4_addr_islinklocal(ipaddr)
#define ip_addr_isbroadcast(addr,netif) ip4_addr_isbroadcast(addr, netif)
#define ip_addr_ismulticast(ipaddr) ip4_addr_ismulticast(ipaddr)
#define ip_addr_debug_print(debug,ipaddr) ip4_addr_debug_print(debug, ipaddr)
#define ip_addr_debug_print_val(debug,ipaddr) ip4_addr_debug_print_val(debug, ipaddr)
#define ipaddr_ntoa(ipaddr) ip4addr_ntoa(ipaddr)
#define ipaddr_ntoa_r(ipaddr,buf,buflen) ip4addr_ntoa_r(ipaddr, buf, buflen)
#define ipaddr_aton(cp,addr) ip4addr_aton(cp, addr)
#define IPADDR_STRLEN_MAX IP4ADDR_STRLEN_MAX
#define IP46_ADDR_ANY(type) (IP4_ADDR_ANY)
extern const ip_addr_t ip_addr_any;
extern const ip_addr_t ip_addr_broadcast;
#define IP_ADDR_ANY IP4_ADDR_ANY
#define IP4_ADDR_ANY (&ip_addr_any)
#define IP4_ADDR_ANY4 (ip_2_ip4(&ip_addr_any))
#define IP_ADDR_BROADCAST (&ip_addr_broadcast)
#define IP4_ADDR_BROADCAST (ip_2_ip4(&ip_addr_broadcast))
#define IP_ANY_TYPE IP_ADDR_ANY
#define LWIP_HDR_ERR_H 
typedef enum {
  ERR_OK = 0,
  ERR_MEM = -1,
  ERR_BUF = -2,
  ERR_TIMEOUT = -3,
  ERR_RTE = -4,
  ERR_INPROGRESS = -5,
  ERR_VAL = -6,
  ERR_WOULDBLOCK = -7,
  ERR_USE = -8,
  ERR_ALREADY = -9,
  ERR_ISCONN = -10,
  ERR_CONN = -11,
  ERR_IF = -12,
  ERR_ABRT = -13,
  ERR_RST = -14,
  ERR_CLSD = -15,
  ERR_ARG = -16
} err_enum_t;
typedef s8_t err_t;
#define lwip_strerr(x) ""
#define LWIP_HDR_ALTCP_H 
#define LWIP_HDR_TCP_H 
#define LWIP_HDR_TCPBASE_H 
typedef u16_t tcpwnd_size_t;
enum tcp_state {
  CLOSED = 0,
  LISTEN = 1,
  SYN_SENT = 2,
  SYN_RCVD = 3,
  ESTABLISHED = 4,
  FIN_WAIT_1 = 5,
  FIN_WAIT_2 = 6,
  CLOSE_WAIT = 7,
  CLOSING = 8,
  LAST_ACK = 9,
  TIME_WAIT = 10
};
#define TCP_STATE_IS_CLOSING(state) ((state) >= FIN_WAIT_1)
#define TCP_WRITE_FLAG_COPY 0x01
#define TCP_WRITE_FLAG_MORE 0x02
#define TCP_PRIO_MIN 1
#define TCP_PRIO_NORMAL 64
#define TCP_PRIO_MAX 127
const char* tcp_debug_state_str(enum tcp_state s);
#define LWIP_HDR_MEM_H 
typedef size_t mem_size_t;
#define MEM_SIZE_F SZT_F
void mem_init(void);
void *mem_trim(void *mem, mem_size_t size);
void *mem_malloc(mem_size_t size);
void *mem_calloc(mem_size_t count, mem_size_t size);
void mem_free(void *mem);
#define LWIP_HDR_PBUF_H 
#define LWIP_SUPPORT_CUSTOM_PBUF ((IP_FRAG && !LWIP_NETIF_TX_SINGLE_PBUF) || (LWIP_IPV6 && LWIP_IPV6_FRAG))
#define PBUF_NEEDS_COPY(p) ((p)->type_internal & PBUF_TYPE_FLAG_DATA_VOLATILE)
#define PBUF_TRANSPORT_HLEN 20
#define PBUF_IP_HLEN 20
typedef enum {
  PBUF_TRANSPORT = 0 + (14 + 0) + 20 + 20,
  PBUF_IP = 0 + (14 + 0) + 20,
  PBUF_LINK = 0 + (14 + 0),
  PBUF_RAW_TX = 0,
  PBUF_RAW = 0
} pbuf_layer;
#define PBUF_TYPE_FLAG_STRUCT_DATA_CONTIGUOUS 0x80
#define PBUF_TYPE_FLAG_DATA_VOLATILE 0x40
#define PBUF_TYPE_ALLOC_SRC_MASK 0x0F
#define PBUF_ALLOC_FLAG_RX 0x0100
#define PBUF_ALLOC_FLAG_DATA_CONTIGUOUS 0x0200
#define PBUF_TYPE_ALLOC_SRC_MASK_STD_HEAP 0x00
#define PBUF_TYPE_ALLOC_SRC_MASK_STD_MEMP_PBUF 0x01
#define PBUF_TYPE_ALLOC_SRC_MASK_STD_MEMP_PBUF_POOL 0x02
#define PBUF_TYPE_ALLOC_SRC_MASK_APP_MIN 0x03
#define PBUF_TYPE_ALLOC_SRC_MASK_APP_MAX PBUF_TYPE_ALLOC_SRC_MASK
typedef enum {
  PBUF_RAM = (0x0200 | 0x80 | 0x00),
  PBUF_ROM = 0x01,
  PBUF_REF = (0x40 | 0x01),
  PBUF_POOL = (0x0100 | 0x80 | 0x02)
} pbuf_type;
#define PBUF_FLAG_PUSH 0x01U
#define PBUF_FLAG_IS_CUSTOM 0x02U
#define PBUF_FLAG_MCASTLOOP 0x04U
#define PBUF_FLAG_LLBCAST 0x08U
#define PBUF_FLAG_LLMCAST 0x10U
#define PBUF_FLAG_TCP_FIN 0x20U
struct pbuf {
  struct pbuf *next;
  void *payload;
  u16_t tot_len;
  u16_t len;
  u8_t type_internal;
  u8_t flags;
  u8_t ref;
  u8_t if_idx;
 
};
struct pbuf_rom {
  struct pbuf *next;
  const void *payload;
};
#define PBUF_POOL_FREE_OOSEQ 1
extern volatile u8_t pbuf_free_ooseq_pending;
void pbuf_free_ooseq(void);
#define PBUF_CHECK_FREE_OOSEQ() do { if(pbuf_free_ooseq_pending) { pbuf_free_ooseq(); }}while(0)
#define pbuf_init() 
struct pbuf *pbuf_alloc(pbuf_layer l, u16_t length, pbuf_type type);
struct pbuf *pbuf_alloc_reference(void *payload, u16_t length, pbuf_type type);
void pbuf_realloc(struct pbuf *p, u16_t size);
#define pbuf_get_allocsrc(p) ((p)->type_internal & PBUF_TYPE_ALLOC_SRC_MASK)
#define pbuf_match_allocsrc(p,type) (pbuf_get_allocsrc(p) == ((type) & PBUF_TYPE_ALLOC_SRC_MASK))
#define pbuf_match_type(p,type) pbuf_match_allocsrc(p, type)
u8_t pbuf_header(struct pbuf *p, s16_t header_size);
u8_t pbuf_header_force(struct pbuf *p, s16_t header_size);
u8_t pbuf_add_header(struct pbuf *p, size_t header_size_increment);
u8_t pbuf_add_header_force(struct pbuf *p, size_t header_size_increment);
u8_t pbuf_remove_header(struct pbuf *p, size_t header_size);
struct pbuf *pbuf_free_header(struct pbuf *q, u16_t size);
void pbuf_ref(struct pbuf *p);
u8_t pbuf_free(struct pbuf *p);
u16_t pbuf_clen(const struct pbuf *p);
void pbuf_cat(struct pbuf *head, struct pbuf *tail);
void pbuf_chain(struct pbuf *head, struct pbuf *tail);
struct pbuf *pbuf_dechain(struct pbuf *p);
err_t pbuf_copy(struct pbuf *p_to, const struct pbuf *p_from);
err_t pbuf_copy_partial_pbuf(struct pbuf *p_to, const struct pbuf *p_from, u16_t copy_len, u16_t offset);
u16_t pbuf_copy_partial(const struct pbuf *p, void *dataptr, u16_t len, u16_t offset);
void *pbuf_get_contiguous(const struct pbuf *p, void *buffer, size_t bufsize, u16_t len, u16_t offset);
err_t pbuf_take(struct pbuf *buf, const void *dataptr, u16_t len);
err_t pbuf_take_at(struct pbuf *buf, const void *dataptr, u16_t len, u16_t offset);
struct pbuf *pbuf_skip(struct pbuf* in, u16_t in_offset, u16_t* out_offset);
struct pbuf *pbuf_coalesce(struct pbuf *p, pbuf_layer layer);
struct pbuf *pbuf_clone(pbuf_layer l, pbuf_type type, struct pbuf *p);
u8_t pbuf_get_at(const struct pbuf* p, u16_t offset);
int pbuf_try_get_at(const struct pbuf* p, u16_t offset);
void pbuf_put_at(struct pbuf* p, u16_t offset, u8_t data);
u16_t pbuf_memcmp(const struct pbuf* p, u16_t offset, const void* s2, u16_t n);
u16_t pbuf_memfind(const struct pbuf* p, const void* mem, u16_t mem_len, u16_t start_offset);
u16_t pbuf_strstr(const struct pbuf* p, const char* substr);
#define LWIP_HDR_IP_H 
#define LWIP_HDR_NETIF_H 
#define ENABLE_LOOPBACK (LWIP_NETIF_LOOPBACK || LWIP_HAVE_LOOPIF)
#define LWIP_HDR_STATS_H 
#define LWIP_HDR_MEMP_H 
#define LWIP_MEMPOOL(name,num,size,desc) 
#define LWIP_MALLOC_MEMPOOL(num,size) LWIP_MEMPOOL(POOL_ ##size, num, (size + LWIP_MEM_ALIGN_SIZE(sizeof(struct memp_malloc_helper))), "MALLOC_"#size)
#define LWIP_MALLOC_MEMPOOL_START 
#define LWIP_MALLOC_MEMPOOL_END 
#define LWIP_PBUF_MEMPOOL(name,num,payload,desc) LWIP_MEMPOOL(name, num, (LWIP_MEM_ALIGN_SIZE(sizeof(struct pbuf)) + LWIP_MEM_ALIGN_SIZE(payload)), desc)









#undef LWIP_MEMPOOL
#undef LWIP_MALLOC_MEMPOOL
#undef LWIP_MALLOC_MEMPOOL_START
#undef LWIP_MALLOC_MEMPOOL_END
#undef LWIP_PBUF_MEMPOOL
typedef enum {
#define LWIP_MEMPOOL(name,num,size,desc) MEMP_ ##name,
#define LWIP_MALLOC_MEMPOOL(num,size) LWIP_MEMPOOL(POOL_ ##size, num, (size + LWIP_MEM_ALIGN_SIZE(sizeof(struct memp_malloc_helper))), "MALLOC_"#size)
#define LWIP_MALLOC_MEMPOOL_START 
#define LWIP_MALLOC_MEMPOOL_END 
#define LWIP_PBUF_MEMPOOL(name,num,payload,desc) LWIP_MEMPOOL(name, num, (LWIP_MEM_ALIGN_SIZE(sizeof(struct pbuf)) + LWIP_MEM_ALIGN_SIZE(payload)), desc)
MEMP_RAW_PCB,
MEMP_UDP_PCB,
MEMP_TCP_PCB,
MEMP_TCP_PCB_LISTEN,
MEMP_TCP_SEG,
MEMP_REASSDATA,
MEMP_SYS_TIMEOUT,
MEMP_PBUF,
MEMP_PBUF_POOL,
#undef LWIP_MEMPOOL
#undef LWIP_MALLOC_MEMPOOL
#undef LWIP_MALLOC_MEMPOOL_START
#undef LWIP_MALLOC_MEMPOOL_END
#undef LWIP_PBUF_MEMPOOL
  MEMP_MAX
} memp_t;
#define LWIP_HDR_MEMP_PRIV_H 
#define LWIP_HDR_MEM_PRIV_H 
#define MEMP_SIZE 0
#define MEMP_ALIGN_SIZE(x) (LWIP_MEM_ALIGN_SIZE(x))
struct memp {
  struct memp *next;
};
