gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
struct netif;
enum netif_mac_filter_action {
  NETIF_DEL_MAC_FILTER = 0,
  NETIF_ADD_MAC_FILTER = 1
};
typedef err_t (*netif_init_fn)(struct netif *netif);
typedef err_t (*netif_input_fn)(struct pbuf *p, struct netif *inp);
typedef err_t (*netif_output_fn)(struct netif *netif, struct pbuf *p,
       const ip4_addr_t *ipaddr);
typedef err_t (*netif_linkoutput_fn)(struct netif *netif, struct pbuf *p);
typedef void (*netif_status_callback_fn)(struct netif *netif);
#define netif_set_client_data(netif,id,data) netif_get_client_data(netif, id) = (data)
#define netif_get_client_data(netif,id) (netif)->client_data[(id)]
typedef u8_t netif_addr_idx_t;
#define NETIF_ADDR_IDX_MAX 0x7F
#define LWIP_NETIF_USE_HINTS 0
struct netif {
  struct netif *next;
  ip_addr_t ip_addr;
  ip_addr_t netmask;
  ip_addr_t gw;
  netif_input_fn input;
  netif_output_fn output;
  netif_linkoutput_fn linkoutput;
  netif_status_callback_fn status_callback;
  netif_status_callback_fn link_callback;
  void *state;
  void* client_data[LWIP_NETIF_CLIENT_DATA_INDEX_MAX + 0];
  const char* hostname;
  u16_t mtu;
  u8_t hwaddr[6U];
  u8_t hwaddr_len;
  u8_t flags;
  char name[2];
  u8_t num;
};
#define NETIF_CHECKSUM_ENABLED(netif,chksumflag) 0
#define NETIF_SET_CHECKSUM_CTRL(netif,chksumflags) 
#define IF__NETIF_CHECKSUM_ENABLED(netif,chksumflag) 
extern struct netif *netif_list;
#define NETIF_FOREACH(netif) for ((netif) = netif_list; (netif) != NULL; (netif) = (netif)->next)
extern struct netif *netif_default;
void netif_init(void);
struct netif *netif_add_noaddr(struct netif *netif, void *state, netif_init_fn init, netif_input_fn input);
struct netif *netif_add(struct netif *netif,
                            const ip4_addr_t *ipaddr, const ip4_addr_t *netmask, const ip4_addr_t *gw,
                            void *state, netif_init_fn init, netif_input_fn input);
void netif_set_addr(struct netif *netif, const ip4_addr_t *ipaddr, const ip4_addr_t *netmask,
                    const ip4_addr_t *gw);
void netif_remove(struct netif * netif);
struct netif *netif_find(const char *name);
void netif_set_default(struct netif *netif);
void netif_set_ipaddr(struct netif *netif, const ip4_addr_t *ipaddr);
void netif_set_netmask(struct netif *netif, const ip4_addr_t *netmask);
void netif_set_gw(struct netif *netif, const ip4_addr_t *gw);
#define netif_ip4_addr(netif) ((const ip4_addr_t*)ip_2_ip4(&((netif)->ip_addr)))
#define netif_ip4_netmask(netif) ((const ip4_addr_t*)ip_2_ip4(&((netif)->netmask)))
#define netif_ip4_gw(netif) ((const ip4_addr_t*)ip_2_ip4(&((netif)->gw)))
#define netif_ip_addr4(netif) ((const ip_addr_t*)&((netif)->ip_addr))
#define netif_ip_netmask4(netif) ((const ip_addr_t*)&((netif)->netmask))
#define netif_ip_gw4(netif) ((const ip_addr_t*)&((netif)->gw))
#define netif_set_flags(netif,set_flags) do { (netif)->flags = (u8_t)((netif)->flags | (set_flags)); } while(0)
#define netif_clear_flags(netif,clr_flags) do { (netif)->flags = (u8_t)((netif)->flags & (u8_t)(~(clr_flags) & 0xff)); } while(0)
#define netif_is_flag_set(netif,flag) (((netif)->flags & (flag)) != 0)
void netif_set_up(struct netif *netif);
void netif_set_down(struct netif *netif);
#define netif_is_up(netif) (((netif)->flags & NETIF_FLAG_UP) ? (u8_t)1 : (u8_t)0)
void netif_set_status_callback(struct netif *netif, netif_status_callback_fn status_callback);
void netif_set_link_up(struct netif *netif);
void netif_set_link_down(struct netif *netif);
#define netif_is_link_up(netif) (((netif)->flags & NETIF_FLAG_LINK_UP) ? (u8_t)1 : (u8_t)0)
void netif_set_link_callback(struct netif *netif, netif_status_callback_fn link_callback);
#define netif_set_hostname(netif,name) do { if((netif) != NULL) { (netif)->hostname = name; }}while(0)
#define netif_get_hostname(netif) (((netif) != NULL) ? ((netif)->hostname) : NULL)
err_t netif_input(struct pbuf *p, struct netif *inp);
#define NETIF_SET_HINTS(netif,netifhint) 
#define NETIF_RESET_HINTS(netif) 
u8_t netif_name_to_index(const char *name);
char * netif_index_to_name(u8_t idx, char *name);
struct netif* netif_get_by_index(u8_t idx);
#define netif_get_index(netif) ((u8_t)((netif)->num + 1))
#define NETIF_NO_INDEX (0)
typedef u16_t netif_nsc_reason_t;
#define LWIP_NSC_NONE 0x0000
#define LWIP_NSC_NETIF_ADDED 0x0001
#define LWIP_NSC_NETIF_REMOVED 0x0002
#define LWIP_NSC_LINK_CHANGED 0x0004
#define LWIP_NSC_STATUS_CHANGED 0x0008
#define LWIP_NSC_IPV4_ADDRESS_CHANGED 0x0010
#define LWIP_NSC_IPV4_GATEWAY_CHANGED 0x0020
#define LWIP_NSC_IPV4_NETMASK_CHANGED 0x0040
#define LWIP_NSC_IPV4_SETTINGS_CHANGED 0x0080
#define LWIP_NSC_IPV6_SET 0x0100
#define LWIP_NSC_IPV6_ADDR_STATE_CHANGED 0x0200
#define LWIP_NSC_IPV4_ADDR_VALID 0x0400
typedef union
{
  struct link_changed_s
  {
    u8_t state;
  } link_changed;
  struct status_changed_s
  {
    u8_t state;
  } status_changed;
  struct ipv4_changed_s
  {
    const ip_addr_t* old_address;
    const ip_addr_t* old_netmask;
    const ip_addr_t* old_gw;
  } ipv4_changed;
  struct ipv6_set_s
  {
    s8_t addr_index;
    const ip_addr_t* old_address;
  } ipv6_set;
  struct ipv6_addr_state_changed_s
  {
    s8_t addr_index;
    u8_t old_state;
    const ip_addr_t* address;
  } ipv6_addr_state_changed;
} netif_ext_callback_args_t;
typedef void (*netif_ext_callback_fn)(struct netif* netif, netif_nsc_reason_t reason, const netif_ext_callback_args_t* args);
#define NETIF_DECLARE_EXT_CALLBACK(name) 
#define netif_add_ext_callback(callback,fn) 
#define netif_remove_ext_callback(callback) 
#define netif_invoke_ext_callback(netif,reason,args) 
#define LWIP_HDR_IP4_H 
#define LWIP_HDR_PROT_IP4_H 

struct ip4_addr_packed {
  u32_t addr;
} __attribute__ ((__packed__));

typedef struct ip4_addr_packed ip4_addr_p_t;
#define IP_HLEN 20
#define IP_HLEN_MAX 60

struct ip_hdr {
  u8_t _v_hl;
  u8_t _tos;
  u16_t _len;
  u16_t _id;
  u16_t _offset;
#define IP_RF 0x8000U
#define IP_DF 0x4000U
#define IP_MF 0x2000U
#define IP_OFFMASK 0x1fffU
  u8_t _ttl;
  u8_t _proto;
  u16_t _chksum;
  ip4_addr_p_t src;
  ip4_addr_p_t dest;
} __attribute__ ((__packed__));

#define IPH_V(hdr) ((hdr)->_v_hl >> 4)
#define IPH_HL(hdr) ((hdr)->_v_hl & 0x0f)
#define IPH_HL_BYTES(hdr) ((u8_t)(IPH_HL(hdr) * 4))
#define IPH_TOS(hdr) ((hdr)->_tos)
#define IPH_LEN(hdr) ((hdr)->_len)
#define IPH_ID(hdr) ((hdr)->_id)
#define IPH_OFFSET(hdr) ((hdr)->_offset)
#define IPH_OFFSET_BYTES(hdr) ((u16_t)((lwip_ntohs(IPH_OFFSET(hdr)) & IP_OFFMASK) * 8U))
#define IPH_TTL(hdr) ((hdr)->_ttl)
#define IPH_PROTO(hdr) ((hdr)->_proto)
#define IPH_CHKSUM(hdr) ((hdr)->_chksum)
#define IPH_VHL_SET(hdr,v,hl) (hdr)->_v_hl = (u8_t)((((v) << 4) | (hl)))
#define IPH_TOS_SET(hdr,tos) (hdr)->_tos = (tos)
#define IPH_LEN_SET(hdr,len) (hdr)->_len = (len)
#define IPH_ID_SET(hdr,id) (hdr)->_id = (id)
#define IPH_OFFSET_SET(hdr,off) (hdr)->_offset = (off)
#define IPH_TTL_SET(hdr,ttl) (hdr)->_ttl = (u8_t)(ttl)
#define IPH_PROTO_SET(hdr,proto) (hdr)->_proto = (u8_t)(proto)
#define IPH_CHKSUM_SET(hdr,chksum) (hdr)->_chksum = (chksum)
#define LWIP_IPV4_SRC_ROUTING 0
#define IP_OPTIONS_SEND (LWIP_IPV4 && LWIP_IGMP)
#define ip_init() 
struct netif *ip4_route(const ip4_addr_t *dest);
#define ip4_route_src(src,dest) ip4_route(dest)
err_t ip4_input(struct pbuf *p, struct netif *inp);
err_t ip4_output(struct pbuf *p, const ip4_addr_t *src, const ip4_addr_t *dest,
       u8_t ttl, u8_t tos, u8_t proto);
err_t ip4_output_if(struct pbuf *p, const ip4_addr_t *src, const ip4_addr_t *dest,
       u8_t ttl, u8_t tos, u8_t proto, struct netif *netif);
err_t ip4_output_if_src(struct pbuf *p, const ip4_addr_t *src, const ip4_addr_t *dest,
       u8_t ttl, u8_t tos, u8_t proto, struct netif *netif);
#define ip4_netif_get_local_ip(netif) (((netif) != NULL) ? netif_ip_addr4(netif) : NULL)
#define ip4_debug_print(p) 
#define LWIP_HDR_IP6_H 
#define LWIP_HDR_PROT_IP_H 
#define IP_PROTO_ICMP 1
#define IP_PROTO_IGMP 2
#define IP_PROTO_UDP 17
#define IP_PROTO_UDPLITE 136
#define IP_PROTO_TCP 6
#define IP_HDR_GET_VERSION(ptr) ((*(u8_t*)(ptr)) >> 4)
#define LWIP_IP_HDRINCL NULL
#define LWIP_IP_CHECK_PBUF_REF_COUNT_FOR_TX(p) LWIP_ASSERT("p->ref == 1", (p)->ref == 1)
#define IP_PCB_NETIFHINT 
#define IP_PCB ip_addr_t local_ip; ip_addr_t remote_ip; u8_t netif_idx; u8_t so_options; u8_t tos; u8_t ttl IP_PCB_NETIFHINT
struct ip_pcb {
  ip_addr_t local_ip; ip_addr_t remote_ip; u8_t netif_idx; u8_t so_options; u8_t tos; u8_t ttl ;
};
#define pcb_tci_init(pcb) 
#define SOF_REUSEADDR 0x04U
#define SOF_KEEPALIVE 0x08U
#define SOF_BROADCAST 0x20U
#define SOF_INHERITED (SOF_REUSEADDR|SOF_KEEPALIVE)
struct ip_globals
{
  struct netif *current_netif;
  struct netif *current_input_netif;
  const struct ip_hdr *current_ip4_header;
  u16_t current_ip_header_tot_len;
  ip_addr_t current_iphdr_src;
  ip_addr_t current_iphdr_dest;
};
extern struct ip_globals ip_data;
#define ip_current_netif() (ip_data.current_netif)
#define ip_current_input_netif() (ip_data.current_input_netif)
#define ip_current_header_tot_len() (ip_data.current_ip_header_tot_len)
#define ip_current_src_addr() (&ip_data.current_iphdr_src)
#define ip_current_dest_addr() (&ip_data.current_iphdr_dest)
#define ip4_current_header() ip_data.current_ip4_header
#define ip_current_is_v6() 0
#define ip_current_header_proto() IPH_PROTO(ip4_current_header())
#define ip_next_header_ptr() ((const void*)((const u8_t*)ip4_current_header() + ip_current_header_tot_len()))
#define ip4_current_src_addr() (&ip_data.current_iphdr_src)
#define ip4_current_dest_addr() (&ip_data.current_iphdr_dest)
#define ip_current_src_addr() (&ip_data.current_iphdr_src)
#define ip_current_dest_addr() (&ip_data.current_iphdr_dest)
#define ip_get_option(pcb,opt) ((pcb)->so_options & (opt))
#define ip_set_option(pcb,opt) ((pcb)->so_options = (u8_t)((pcb)->so_options | (opt)))
#define ip_reset_option(pcb,opt) ((pcb)->so_options = (u8_t)((pcb)->so_options & ~(opt)))
#define ip_output(p,src,dest,ttl,tos,proto) ip4_output(p, src, dest, ttl, tos, proto)
#define ip_output_if(p,src,dest,ttl,tos,proto,netif) ip4_output_if(p, src, dest, ttl, tos, proto, netif)
#define ip_output_if_src(p,src,dest,ttl,tos,proto,netif) ip4_output_if_src(p, src, dest, ttl, tos, proto, netif)
#define ip_output_hinted(p,src,dest,ttl,tos,proto,netif_hint) ip4_output_hinted(p, src, dest, ttl, tos, proto, netif_hint)
#define ip_output_if_hdrincl(p,src,dest,netif) ip4_output_if(p, src, LWIP_IP_HDRINCL, 0, 0, 0, netif)
#define ip_route(src,dest) ip4_route_src(src, dest)
#define ip_netif_get_local_ip(netif,dest) ip4_netif_get_local_ip(netif)
#define ip_debug_print(is_ipv6,p) ip4_debug_print(p)
#define ip_input ip4_input
#define ip_route_get_local_ip(src,dest,netif,ipaddr) do { (netif) = ip_route(src, dest); (ipaddr) = ip_netif_get_local_ip(netif, dest); }while(0)
#define LWIP_HDR_ICMP_H 
#define LWIP_HDR_PROT_ICMP_H 
#define ICMP_ER 0
#define ICMP_DUR 3
#define ICMP_SQ 4
#define ICMP_RD 5
#define ICMP_ECHO 8
#define ICMP_TE 11
#define ICMP_PP 12
#define ICMP_TS 13
#define ICMP_TSR 14
#define ICMP_IRQ 15
#define ICMP_IR 16
#define ICMP_AM 17
#define ICMP_AMR 18

struct icmp_hdr {
  u8_t type;
  u8_t code;
  u16_t chksum;
  u32_t data;
} __attribute__ ((__packed__));

#define ICMPH_TYPE(hdr) ((hdr)->type)
#define ICMPH_CODE(hdr) ((hdr)->code)
#define ICMPH_TYPE_SET(hdr,t) ((hdr)->type = (t))
#define ICMPH_CODE_SET(hdr,c) ((hdr)->code = (c))

struct icmp_echo_hdr {
  u8_t type;
  u8_t code;
  u16_t chksum;
  u16_t id;
  u16_t seqno;
} __attribute__ ((__packed__));

