gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
enum icmp_dur_type {
  ICMP_DUR_NET = 0,
  ICMP_DUR_HOST = 1,
  ICMP_DUR_PROTO = 2,
  ICMP_DUR_PORT = 3,
  ICMP_DUR_FRAG = 4,
  ICMP_DUR_SR = 5
};
enum icmp_te_type {
  ICMP_TE_TTL = 0,
  ICMP_TE_FRAG = 1
};
void icmp_input(struct pbuf *p, struct netif *inp);
void icmp_dest_unreach(struct pbuf *p, enum icmp_dur_type t);
void icmp_time_exceeded(struct pbuf *p, enum icmp_te_type t);
#define icmp_port_unreach(isipv6,pbuf) icmp_dest_unreach(pbuf, ICMP_DUR_PORT)
struct tcp_pcb;
struct tcp_pcb_listen;
typedef err_t (*tcp_accept_fn)(void *arg, struct tcp_pcb *newpcb, err_t err);
typedef err_t (*tcp_recv_fn)(void *arg, struct tcp_pcb *tpcb,
                             struct pbuf *p, err_t err);
typedef err_t (*tcp_sent_fn)(void *arg, struct tcp_pcb *tpcb,
                              u16_t len);
typedef err_t (*tcp_poll_fn)(void *arg, struct tcp_pcb *tpcb);
typedef void (*tcp_err_fn)(void *arg, err_t err);
typedef err_t (*tcp_connected_fn)(void *arg, struct tcp_pcb *tpcb, err_t err);
#define RCV_WND_SCALE(pcb,wnd) (wnd)
#define SND_WND_SCALE(pcb,wnd) (wnd)
#define TCPWND16(x) (x)
#define TCP_WND_MAX(pcb) TCP_WND
#define TCP_WND_INC(wnd,inc) do { if ((tcpwnd_size_t)(wnd + inc) >= wnd) { wnd = (tcpwnd_size_t)(wnd + inc); } else { wnd = (tcpwnd_size_t)-1; } } while(0)
typedef void (*tcp_extarg_callback_pcb_destroyed_fn)(u8_t id, void *data);
typedef err_t (*tcp_extarg_callback_passive_open_fn)(u8_t id, struct tcp_pcb_listen *lpcb, struct tcp_pcb *cpcb);
struct tcp_ext_arg_callbacks {
  tcp_extarg_callback_pcb_destroyed_fn destroy;
  tcp_extarg_callback_passive_open_fn passive_open;
};
#define LWIP_TCP_PCB_NUM_EXT_ARG_ID_INVALID 0xFF
#define TCP_PCB_EXTARGS 
typedef u16_t tcpflags_t;
#define TCP_ALLFLAGS 0xffffU
#define TCP_PCB_COMMON(type) type *next; void *callback_arg; TCP_PCB_EXTARGS enum tcp_state state; u8_t prio; u16_t local_port
struct tcp_pcb_listen {
  ip_addr_t local_ip; ip_addr_t remote_ip; u8_t netif_idx; u8_t so_options; u8_t tos; u8_t ttl ;
  struct tcp_pcb_listen *next; void *callback_arg; enum tcp_state state; u8_t prio; u16_t local_port;
  tcp_accept_fn accept;
};
struct tcp_pcb {
  ip_addr_t local_ip; ip_addr_t remote_ip; u8_t netif_idx; u8_t so_options; u8_t tos; u8_t ttl ;
  struct tcp_pcb *next; void *callback_arg; enum tcp_state state; u8_t prio; u16_t local_port;
  u16_t remote_port;
  tcpflags_t flags;
#define TF_ACK_DELAY 0x01U
#define TF_ACK_NOW 0x02U
#define TF_INFR 0x04U
#define TF_CLOSEPEND 0x08U
#define TF_RXCLOSED 0x10U
#define TF_FIN 0x20U
#define TF_NODELAY 0x40U
#define TF_NAGLEMEMERR 0x80U
#define TF_RTO 0x0800U
  u8_t polltmr, pollinterval;
  u8_t last_timer;
  u32_t tmr;
  u32_t rcv_nxt;
  tcpwnd_size_t rcv_wnd;
  tcpwnd_size_t rcv_ann_wnd;
  u32_t rcv_ann_right_edge;
  s16_t rtime;
  u16_t mss;
  u32_t rttest;
  u32_t rtseq;
  s16_t sa, sv;
  s16_t rto;
  u8_t nrtx;
  u8_t dupacks;
  u32_t lastack;
  tcpwnd_size_t cwnd;
  tcpwnd_size_t ssthresh;
  u32_t rto_end;
  u32_t snd_nxt;
  u32_t snd_wl1, snd_wl2;
  u32_t snd_lbb;
  tcpwnd_size_t snd_wnd;
  tcpwnd_size_t snd_wnd_max;
  tcpwnd_size_t snd_buf;
#define TCP_SNDQUEUELEN_OVERFLOW (0xffffU-3)
  u16_t snd_queuelen;
  u16_t unsent_oversize;
  tcpwnd_size_t bytes_acked;
  struct tcp_seg *unsent;
  struct tcp_seg *unacked;
  struct tcp_seg *ooseq;
  struct pbuf *refused_data;
  struct tcp_pcb_listen* listener;
  tcp_sent_fn sent;
  tcp_recv_fn recv;
  tcp_connected_fn connected;
  tcp_poll_fn poll;
  tcp_err_fn errf;
  u32_t keep_idle;
  u32_t keep_intvl;
  u32_t keep_cnt;
  u8_t persist_cnt;
  u8_t persist_backoff;
  u8_t persist_probe;
  u8_t keep_cnt_sent;
};
struct tcp_pcb * tcp_new (void);
struct tcp_pcb * tcp_new_ip_type (u8_t type);
void tcp_arg (struct tcp_pcb *pcb, void *arg);
void tcp_recv (struct tcp_pcb *pcb, tcp_recv_fn recv);
void tcp_sent (struct tcp_pcb *pcb, tcp_sent_fn sent);
void tcp_err (struct tcp_pcb *pcb, tcp_err_fn err);
void tcp_accept (struct tcp_pcb *pcb, tcp_accept_fn accept);
void tcp_poll (struct tcp_pcb *pcb, tcp_poll_fn poll, u8_t interval);
#define tcp_set_flags(pcb,set_flags) do { (pcb)->flags = (tcpflags_t)((pcb)->flags | (set_flags)); } while(0)
#define tcp_clear_flags(pcb,clr_flags) do { (pcb)->flags = (tcpflags_t)((pcb)->flags & (tcpflags_t)(~(clr_flags) & TCP_ALLFLAGS)); } while(0)
#define tcp_is_flag_set(pcb,flag) (((pcb)->flags & (flag)) != 0)
#define tcp_mss(pcb) ((pcb)->mss)
#define tcp_sndbuf(pcb) (TCPWND16((pcb)->snd_buf))
#define tcp_sndqueuelen(pcb) ((pcb)->snd_queuelen)
#define tcp_nagle_disable(pcb) tcp_set_flags(pcb, TF_NODELAY)
#define tcp_nagle_enable(pcb) tcp_clear_flags(pcb, TF_NODELAY)
#define tcp_nagle_disabled(pcb) tcp_is_flag_set(pcb, TF_NODELAY)
#define tcp_backlog_set(pcb,new_backlog) 
#define tcp_backlog_delayed(pcb) 
#define tcp_backlog_accepted(pcb) 
#define tcp_accepted(pcb) do { LWIP_UNUSED_ARG(pcb); } while(0)
void tcp_recved (struct tcp_pcb *pcb, u16_t len);
err_t tcp_bind (struct tcp_pcb *pcb, const ip_addr_t *ipaddr,
                              u16_t port);
void tcp_bind_netif(struct tcp_pcb *pcb, const struct netif *netif);
err_t tcp_connect (struct tcp_pcb *pcb, const ip_addr_t *ipaddr,
                              u16_t port, tcp_connected_fn connected);
struct tcp_pcb * tcp_listen_with_backlog_and_err(struct tcp_pcb *pcb, u8_t backlog, err_t *err);
struct tcp_pcb * tcp_listen_with_backlog(struct tcp_pcb *pcb, u8_t backlog);
#define tcp_listen(pcb) tcp_listen_with_backlog(pcb, TCP_DEFAULT_LISTEN_BACKLOG)
void tcp_abort (struct tcp_pcb *pcb);
err_t tcp_close (struct tcp_pcb *pcb);
err_t tcp_shutdown(struct tcp_pcb *pcb, int shut_rx, int shut_tx);
err_t tcp_write (struct tcp_pcb *pcb, const void *dataptr, u16_t len,
                              u8_t apiflags);
void tcp_setprio (struct tcp_pcb *pcb, u8_t prio);
err_t tcp_output (struct tcp_pcb *pcb);
err_t tcp_tcp_get_tcp_addrinfo(struct tcp_pcb *pcb, int local, ip_addr_t *addr, u16_t *port);
#define tcp_dbg_get_tcp_state(pcb) ((pcb)->state)
#define tcp_new_ip6() tcp_new_ip_type(IPADDR_TYPE_V6)
#define altcp_accept_fn tcp_accept_fn
#define altcp_connected_fn tcp_connected_fn
#define altcp_recv_fn tcp_recv_fn
#define altcp_sent_fn tcp_sent_fn
#define altcp_poll_fn tcp_poll_fn
#define altcp_err_fn tcp_err_fn
#define altcp_pcb tcp_pcb
#define altcp_tcp_new_ip_type tcp_new_ip_type
#define altcp_tcp_new tcp_new
#define altcp_tcp_new_ip6 tcp_new_ip6
#define altcp_new(allocator) tcp_new()
#define altcp_new_ip6(allocator) tcp_new_ip6()
#define altcp_new_ip_type(allocator,ip_type) tcp_new_ip_type(ip_type)
#define altcp_arg tcp_arg
#define altcp_accept tcp_accept
#define altcp_recv tcp_recv
#define altcp_sent tcp_sent
#define altcp_poll tcp_poll
#define altcp_err tcp_err
#define altcp_recved tcp_recved
#define altcp_bind tcp_bind
#define altcp_connect tcp_connect
#define altcp_listen_with_backlog_and_err tcp_listen_with_backlog_and_err
#define altcp_listen_with_backlog tcp_listen_with_backlog
#define altcp_listen tcp_listen
#define altcp_abort tcp_abort
#define altcp_close tcp_close
#define altcp_shutdown tcp_shutdown
#define altcp_write tcp_write
#define altcp_output tcp_output
#define altcp_mss tcp_mss
#define altcp_sndbuf tcp_sndbuf
#define altcp_sndqueuelen tcp_sndqueuelen
#define altcp_nagle_disable tcp_nagle_disable
#define altcp_nagle_enable tcp_nagle_enable
#define altcp_nagle_disabled tcp_nagle_disabled
#define altcp_setprio tcp_setprio
#define altcp_get_tcp_addrinfo tcp_get_tcp_addrinfo
#define altcp_get_ip(pcb,local) ((local) ? (&(pcb)->local_ip) : (&(pcb)->remote_ip))
#define LWIP_HDR_PROT_IANA_H 
enum lwip_iana_hwtype {
  LWIP_IANA_HWTYPE_ETHERNET = 1
};
enum lwip_iana_port_number {
  LWIP_IANA_PORT_SMTP = 25,
  LWIP_IANA_PORT_DHCP_SERVER = 67,
  LWIP_IANA_PORT_DHCP_CLIENT = 68,
  LWIP_IANA_PORT_TFTP = 69,
  LWIP_IANA_PORT_HTTP = 80,
  LWIP_IANA_PORT_SNTP = 123,
  LWIP_IANA_PORT_NETBIOS = 137,
  LWIP_IANA_PORT_SNMP = 161,
  LWIP_IANA_PORT_SNMP_TRAP = 162,
  LWIP_IANA_PORT_HTTPS = 443,
  LWIP_IANA_PORT_SMTPS = 465,
  LWIP_IANA_PORT_MQTT = 1883,
  LWIP_IANA_PORT_MDNS = 5353,
  LWIP_IANA_PORT_SECURE_MQTT = 8883
};
#define LWIP_HTTPC_HAVE_FILE_IO 0
#define HTTP_DEFAULT_PORT LWIP_IANA_PORT_HTTP
typedef enum ehttpc_result {
  HTTPC_RESULT_OK = 0,
  HTTPC_RESULT_ERR_UNKNOWN = 1,
  HTTPC_RESULT_ERR_CONNECT = 2,
  HTTPC_RESULT_ERR_HOSTNAME = 3,
  HTTPC_RESULT_ERR_CLOSED = 4,
  HTTPC_RESULT_ERR_TIMEOUT = 5,
  HTTPC_RESULT_ERR_SVR_RESP = 6,
  HTTPC_RESULT_ERR_MEM = 7,
  HTTPC_RESULT_LOCAL_ABORT = 8,
  HTTPC_RESULT_ERR_CONTENT_LEN = 9
} httpc_result_t;
typedef struct _httpc_state httpc_state_t;
typedef void (*httpc_result_fn)(void *arg, httpc_result_t httpc_result, u32_t rx_content_len, u32_t srv_res, err_t err);
typedef err_t (*httpc_headers_done_fn)(httpc_state_t *connection, void *arg, struct pbuf *hdr, u16_t hdr_len, u32_t content_len);
typedef struct _httpc_connection {
  ip_addr_t proxy_addr;
  u16_t proxy_port;
  u8_t use_proxy;
  httpc_result_fn result_fn;
  httpc_headers_done_fn headers_done_fn;
} httpc_connection_t;
err_t httpc_get_file(const ip_addr_t* server_addr, u16_t port, const char* uri, const httpc_connection_t *settings,
                     tcp_recv_fn recv_fn, void* callback_arg, httpc_state_t **connection);
err_t httpc_get_file_dns(const char* server_name, u16_t port, const char* uri, const httpc_connection_t *settings,
                     tcp_recv_fn recv_fn, void* callback_arg, httpc_state_t **connection);
#define LWIP_HDR_ALTCP_TLS_H 
#define _HARDWARE_ADC_H 
#define _HARDWARE_STRUCTS_ADC_H 
#define _HARDWARE_REGS_ADC_H 
#define ADC_CS_OFFSET 0x00000000u
#define ADC_CS_BITS 0x01fff70fu
#define ADC_CS_RESET 0x00000000u
#define ADC_CS_RROBIN_RESET 0x000u
#define ADC_CS_RROBIN_BITS 0x01ff0000u
#define ADC_CS_RROBIN_MSB 24u
#define ADC_CS_RROBIN_LSB 16u
#define ADC_CS_RROBIN_ACCESS "RW"
#define ADC_CS_AINSEL_RESET 0x0u
#define ADC_CS_AINSEL_BITS 0x0000f000u
#define ADC_CS_AINSEL_MSB 15u
#define ADC_CS_AINSEL_LSB 12u
#define ADC_CS_AINSEL_ACCESS "RW"
#define ADC_CS_ERR_STICKY_RESET 0x0u
#define ADC_CS_ERR_STICKY_BITS 0x00000400u
#define ADC_CS_ERR_STICKY_MSB 10u
#define ADC_CS_ERR_STICKY_LSB 10u
#define ADC_CS_ERR_STICKY_ACCESS "WC"
#define ADC_CS_ERR_RESET 0x0u
#define ADC_CS_ERR_BITS 0x00000200u
#define ADC_CS_ERR_MSB 9u
#define ADC_CS_ERR_LSB 9u
#define ADC_CS_ERR_ACCESS "RO"
#define ADC_CS_READY_RESET 0x0u
#define ADC_CS_READY_BITS 0x00000100u
#define ADC_CS_READY_MSB 8u
#define ADC_CS_READY_LSB 8u
#define ADC_CS_READY_ACCESS "RO"
#define ADC_CS_START_MANY_RESET 0x0u
#define ADC_CS_START_MANY_BITS 0x00000008u
#define ADC_CS_START_MANY_MSB 3u
#define ADC_CS_START_MANY_LSB 3u
#define ADC_CS_START_MANY_ACCESS "RW"
#define ADC_CS_START_ONCE_RESET 0x0u
#define ADC_CS_START_ONCE_BITS 0x00000004u
#define ADC_CS_START_ONCE_MSB 2u
#define ADC_CS_START_ONCE_LSB 2u
#define ADC_CS_START_ONCE_ACCESS "SC"
#define ADC_CS_TS_EN_RESET 0x0u
#define ADC_CS_TS_EN_BITS 0x00000002u
#define ADC_CS_TS_EN_MSB 1u
#define ADC_CS_TS_EN_LSB 1u
#define ADC_CS_TS_EN_ACCESS "RW"
#define ADC_CS_EN_RESET 0x0u
#define ADC_CS_EN_BITS 0x00000001u
#define ADC_CS_EN_MSB 0u
#define ADC_CS_EN_LSB 0u
#define ADC_CS_EN_ACCESS "RW"
#define ADC_RESULT_OFFSET 0x00000004u
#define ADC_RESULT_BITS 0x00000fffu
#define ADC_RESULT_RESET 0x00000000u
#define ADC_RESULT_MSB 11u
#define ADC_RESULT_LSB 0u
#define ADC_RESULT_ACCESS "RO"
#define ADC_FCS_OFFSET 0x00000008u
#define ADC_FCS_BITS 0x0f0f0f0fu
#define ADC_FCS_RESET 0x00000000u
#define ADC_FCS_THRESH_RESET 0x0u
#define ADC_FCS_THRESH_BITS 0x0f000000u
#define ADC_FCS_THRESH_MSB 27u
#define ADC_FCS_THRESH_LSB 24u
#define ADC_FCS_THRESH_ACCESS "RW"
#define ADC_FCS_LEVEL_RESET 0x0u
#define ADC_FCS_LEVEL_BITS 0x000f0000u
#define ADC_FCS_LEVEL_MSB 19u
#define ADC_FCS_LEVEL_LSB 16u
#define ADC_FCS_LEVEL_ACCESS "RO"
#define ADC_FCS_OVER_RESET 0x0u
#define ADC_FCS_OVER_BITS 0x00000800u
#define ADC_FCS_OVER_MSB 11u
#define ADC_FCS_OVER_LSB 11u
#define ADC_FCS_OVER_ACCESS "WC"
#define ADC_FCS_UNDER_RESET 0x0u
#define ADC_FCS_UNDER_BITS 0x00000400u
#define ADC_FCS_UNDER_MSB 10u
#define ADC_FCS_UNDER_LSB 10u
#define ADC_FCS_UNDER_ACCESS "WC"
#define ADC_FCS_FULL_RESET 0x0u
#define ADC_FCS_FULL_BITS 0x00000200u
#define ADC_FCS_FULL_MSB 9u
#define ADC_FCS_FULL_LSB 9u
#define ADC_FCS_FULL_ACCESS "RO"
#define ADC_FCS_EMPTY_RESET 0x0u
#define ADC_FCS_EMPTY_BITS 0x00000100u
#define ADC_FCS_EMPTY_MSB 8u
#define ADC_FCS_EMPTY_LSB 8u
#define ADC_FCS_EMPTY_ACCESS "RO"
#define ADC_FCS_DREQ_EN_RESET 0x0u
#define ADC_FCS_DREQ_EN_BITS 0x00000008u
#define ADC_FCS_DREQ_EN_MSB 3u
#define ADC_FCS_DREQ_EN_LSB 3u
#define ADC_FCS_DREQ_EN_ACCESS "RW"
#define ADC_FCS_ERR_RESET 0x0u
#define ADC_FCS_ERR_BITS 0x00000004u
#define ADC_FCS_ERR_MSB 2u
#define ADC_FCS_ERR_LSB 2u
#define ADC_FCS_ERR_ACCESS "RW"
#define ADC_FCS_SHIFT_RESET 0x0u
#define ADC_FCS_SHIFT_BITS 0x00000002u
#define ADC_FCS_SHIFT_MSB 1u
#define ADC_FCS_SHIFT_LSB 1u
#define ADC_FCS_SHIFT_ACCESS "RW"
#define ADC_FCS_EN_RESET 0x0u
#define ADC_FCS_EN_BITS 0x00000001u
#define ADC_FCS_EN_MSB 0u
#define ADC_FCS_EN_LSB 0u
#define ADC_FCS_EN_ACCESS "RW"
#define ADC_FIFO_OFFSET 0x0000000cu
#define ADC_FIFO_BITS 0x00008fffu
#define ADC_FIFO_RESET 0x00000000u
#define ADC_FIFO_ERR_RESET "-"
#define ADC_FIFO_ERR_BITS 0x00008000u
#define ADC_FIFO_ERR_MSB 15u
#define ADC_FIFO_ERR_LSB 15u
#define ADC_FIFO_ERR_ACCESS "RF"
#define ADC_FIFO_VAL_RESET "-"
#define ADC_FIFO_VAL_BITS 0x00000fffu
#define ADC_FIFO_VAL_MSB 11u
#define ADC_FIFO_VAL_LSB 0u
#define ADC_FIFO_VAL_ACCESS "RF"
#define ADC_DIV_OFFSET 0x00000010u
#define ADC_DIV_BITS 0x00ffffffu
#define ADC_DIV_RESET 0x00000000u
#define ADC_DIV_INT_RESET 0x0000u
#define ADC_DIV_INT_BITS 0x00ffff00u
#define ADC_DIV_INT_MSB 23u
#define ADC_DIV_INT_LSB 8u
#define ADC_DIV_INT_ACCESS "RW"
#define ADC_DIV_FRAC_RESET 0x00u
#define ADC_DIV_FRAC_BITS 0x000000ffu
#define ADC_DIV_FRAC_MSB 7u
#define ADC_DIV_FRAC_LSB 0u
#define ADC_DIV_FRAC_ACCESS "RW"
#define ADC_INTR_OFFSET 0x00000014u
#define ADC_INTR_BITS 0x00000001u
#define ADC_INTR_RESET 0x00000000u
#define ADC_INTR_FIFO_RESET 0x0u
#define ADC_INTR_FIFO_BITS 0x00000001u
#define ADC_INTR_FIFO_MSB 0u
#define ADC_INTR_FIFO_LSB 0u
#define ADC_INTR_FIFO_ACCESS "RO"
#define ADC_INTE_OFFSET 0x00000018u
#define ADC_INTE_BITS 0x00000001u
#define ADC_INTE_RESET 0x00000000u
#define ADC_INTE_FIFO_RESET 0x0u
#define ADC_INTE_FIFO_BITS 0x00000001u
#define ADC_INTE_FIFO_MSB 0u
#define ADC_INTE_FIFO_LSB 0u
#define ADC_INTE_FIFO_ACCESS "RW"
#define ADC_INTF_OFFSET 0x0000001cu
#define ADC_INTF_BITS 0x00000001u
#define ADC_INTF_RESET 0x00000000u
#define ADC_INTF_FIFO_RESET 0x0u
#define ADC_INTF_FIFO_BITS 0x00000001u
#define ADC_INTF_FIFO_MSB 0u
#define ADC_INTF_FIFO_LSB 0u
#define ADC_INTF_FIFO_ACCESS "RW"
#define ADC_INTS_OFFSET 0x00000020u
#define ADC_INTS_BITS 0x00000001u
#define ADC_INTS_RESET 0x00000000u
#define ADC_INTS_FIFO_RESET 0x0u
#define ADC_INTS_FIFO_BITS 0x00000001u
#define ADC_INTS_FIFO_MSB 0u
#define ADC_INTS_FIFO_LSB 0u
#define ADC_INTS_FIFO_ACCESS "RO"
typedef struct {
   
    io_rw_32 cs;
   
