gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define PADS_BANK0_GPIO34_PDE_LSB 2u
#define PADS_BANK0_GPIO34_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO34_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO34_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO34_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO34_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO34_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO34_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO34_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO34_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO34_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO34_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO35_OFFSET 0x00000090u
#define PADS_BANK0_GPIO35_BITS 0x000001ffu
#define PADS_BANK0_GPIO35_RESET 0x00000116u
#define PADS_BANK0_GPIO35_ISO_RESET 0x1u
#define PADS_BANK0_GPIO35_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO35_ISO_MSB 8u
#define PADS_BANK0_GPIO35_ISO_LSB 8u
#define PADS_BANK0_GPIO35_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO35_OD_RESET 0x0u
#define PADS_BANK0_GPIO35_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO35_OD_MSB 7u
#define PADS_BANK0_GPIO35_OD_LSB 7u
#define PADS_BANK0_GPIO35_OD_ACCESS "RW"
#define PADS_BANK0_GPIO35_IE_RESET 0x0u
#define PADS_BANK0_GPIO35_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO35_IE_MSB 6u
#define PADS_BANK0_GPIO35_IE_LSB 6u
#define PADS_BANK0_GPIO35_IE_ACCESS "RW"
#define PADS_BANK0_GPIO35_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO35_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO35_DRIVE_MSB 5u
#define PADS_BANK0_GPIO35_DRIVE_LSB 4u
#define PADS_BANK0_GPIO35_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO35_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO35_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO35_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO35_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO35_PUE_RESET 0x0u
#define PADS_BANK0_GPIO35_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO35_PUE_MSB 3u
#define PADS_BANK0_GPIO35_PUE_LSB 3u
#define PADS_BANK0_GPIO35_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO35_PDE_RESET 0x1u
#define PADS_BANK0_GPIO35_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO35_PDE_MSB 2u
#define PADS_BANK0_GPIO35_PDE_LSB 2u
#define PADS_BANK0_GPIO35_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO35_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO35_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO35_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO35_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO35_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO35_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO35_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO35_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO35_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO35_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO36_OFFSET 0x00000094u
#define PADS_BANK0_GPIO36_BITS 0x000001ffu
#define PADS_BANK0_GPIO36_RESET 0x00000116u
#define PADS_BANK0_GPIO36_ISO_RESET 0x1u
#define PADS_BANK0_GPIO36_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO36_ISO_MSB 8u
#define PADS_BANK0_GPIO36_ISO_LSB 8u
#define PADS_BANK0_GPIO36_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO36_OD_RESET 0x0u
#define PADS_BANK0_GPIO36_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO36_OD_MSB 7u
#define PADS_BANK0_GPIO36_OD_LSB 7u
#define PADS_BANK0_GPIO36_OD_ACCESS "RW"
#define PADS_BANK0_GPIO36_IE_RESET 0x0u
#define PADS_BANK0_GPIO36_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO36_IE_MSB 6u
#define PADS_BANK0_GPIO36_IE_LSB 6u
#define PADS_BANK0_GPIO36_IE_ACCESS "RW"
#define PADS_BANK0_GPIO36_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO36_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO36_DRIVE_MSB 5u
#define PADS_BANK0_GPIO36_DRIVE_LSB 4u
#define PADS_BANK0_GPIO36_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO36_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO36_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO36_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO36_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO36_PUE_RESET 0x0u
#define PADS_BANK0_GPIO36_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO36_PUE_MSB 3u
#define PADS_BANK0_GPIO36_PUE_LSB 3u
#define PADS_BANK0_GPIO36_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO36_PDE_RESET 0x1u
#define PADS_BANK0_GPIO36_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO36_PDE_MSB 2u
#define PADS_BANK0_GPIO36_PDE_LSB 2u
#define PADS_BANK0_GPIO36_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO36_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO36_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO36_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO36_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO36_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO36_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO36_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO36_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO36_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO36_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO37_OFFSET 0x00000098u
#define PADS_BANK0_GPIO37_BITS 0x000001ffu
#define PADS_BANK0_GPIO37_RESET 0x00000116u
#define PADS_BANK0_GPIO37_ISO_RESET 0x1u
#define PADS_BANK0_GPIO37_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO37_ISO_MSB 8u
#define PADS_BANK0_GPIO37_ISO_LSB 8u
#define PADS_BANK0_GPIO37_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO37_OD_RESET 0x0u
#define PADS_BANK0_GPIO37_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO37_OD_MSB 7u
#define PADS_BANK0_GPIO37_OD_LSB 7u
#define PADS_BANK0_GPIO37_OD_ACCESS "RW"
#define PADS_BANK0_GPIO37_IE_RESET 0x0u
#define PADS_BANK0_GPIO37_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO37_IE_MSB 6u
#define PADS_BANK0_GPIO37_IE_LSB 6u
#define PADS_BANK0_GPIO37_IE_ACCESS "RW"
#define PADS_BANK0_GPIO37_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO37_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO37_DRIVE_MSB 5u
#define PADS_BANK0_GPIO37_DRIVE_LSB 4u
#define PADS_BANK0_GPIO37_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO37_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO37_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO37_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO37_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO37_PUE_RESET 0x0u
#define PADS_BANK0_GPIO37_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO37_PUE_MSB 3u
#define PADS_BANK0_GPIO37_PUE_LSB 3u
#define PADS_BANK0_GPIO37_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO37_PDE_RESET 0x1u
#define PADS_BANK0_GPIO37_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO37_PDE_MSB 2u
#define PADS_BANK0_GPIO37_PDE_LSB 2u
#define PADS_BANK0_GPIO37_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO37_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO37_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO37_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO37_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO37_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO37_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO37_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO37_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO37_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO37_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO38_OFFSET 0x0000009cu
#define PADS_BANK0_GPIO38_BITS 0x000001ffu
#define PADS_BANK0_GPIO38_RESET 0x00000116u
#define PADS_BANK0_GPIO38_ISO_RESET 0x1u
#define PADS_BANK0_GPIO38_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO38_ISO_MSB 8u
#define PADS_BANK0_GPIO38_ISO_LSB 8u
#define PADS_BANK0_GPIO38_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO38_OD_RESET 0x0u
#define PADS_BANK0_GPIO38_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO38_OD_MSB 7u
#define PADS_BANK0_GPIO38_OD_LSB 7u
#define PADS_BANK0_GPIO38_OD_ACCESS "RW"
#define PADS_BANK0_GPIO38_IE_RESET 0x0u
#define PADS_BANK0_GPIO38_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO38_IE_MSB 6u
#define PADS_BANK0_GPIO38_IE_LSB 6u
#define PADS_BANK0_GPIO38_IE_ACCESS "RW"
#define PADS_BANK0_GPIO38_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO38_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO38_DRIVE_MSB 5u
#define PADS_BANK0_GPIO38_DRIVE_LSB 4u
#define PADS_BANK0_GPIO38_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO38_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO38_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO38_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO38_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO38_PUE_RESET 0x0u
#define PADS_BANK0_GPIO38_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO38_PUE_MSB 3u
#define PADS_BANK0_GPIO38_PUE_LSB 3u
#define PADS_BANK0_GPIO38_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO38_PDE_RESET 0x1u
#define PADS_BANK0_GPIO38_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO38_PDE_MSB 2u
#define PADS_BANK0_GPIO38_PDE_LSB 2u
#define PADS_BANK0_GPIO38_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO38_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO38_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO38_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO38_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO38_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO38_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO38_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO38_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO38_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO38_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO39_OFFSET 0x000000a0u
#define PADS_BANK0_GPIO39_BITS 0x000001ffu
#define PADS_BANK0_GPIO39_RESET 0x00000116u
#define PADS_BANK0_GPIO39_ISO_RESET 0x1u
#define PADS_BANK0_GPIO39_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO39_ISO_MSB 8u
#define PADS_BANK0_GPIO39_ISO_LSB 8u
#define PADS_BANK0_GPIO39_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO39_OD_RESET 0x0u
#define PADS_BANK0_GPIO39_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO39_OD_MSB 7u
#define PADS_BANK0_GPIO39_OD_LSB 7u
#define PADS_BANK0_GPIO39_OD_ACCESS "RW"
#define PADS_BANK0_GPIO39_IE_RESET 0x0u
#define PADS_BANK0_GPIO39_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO39_IE_MSB 6u
#define PADS_BANK0_GPIO39_IE_LSB 6u
#define PADS_BANK0_GPIO39_IE_ACCESS "RW"
#define PADS_BANK0_GPIO39_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO39_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO39_DRIVE_MSB 5u
#define PADS_BANK0_GPIO39_DRIVE_LSB 4u
#define PADS_BANK0_GPIO39_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO39_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO39_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO39_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO39_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO39_PUE_RESET 0x0u
#define PADS_BANK0_GPIO39_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO39_PUE_MSB 3u
#define PADS_BANK0_GPIO39_PUE_LSB 3u
#define PADS_BANK0_GPIO39_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO39_PDE_RESET 0x1u
#define PADS_BANK0_GPIO39_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO39_PDE_MSB 2u
#define PADS_BANK0_GPIO39_PDE_LSB 2u
#define PADS_BANK0_GPIO39_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO39_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO39_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO39_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO39_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO39_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO39_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO39_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO39_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO39_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO39_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO40_OFFSET 0x000000a4u
#define PADS_BANK0_GPIO40_BITS 0x000001ffu
#define PADS_BANK0_GPIO40_RESET 0x00000116u
#define PADS_BANK0_GPIO40_ISO_RESET 0x1u
#define PADS_BANK0_GPIO40_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO40_ISO_MSB 8u
#define PADS_BANK0_GPIO40_ISO_LSB 8u
#define PADS_BANK0_GPIO40_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO40_OD_RESET 0x0u
#define PADS_BANK0_GPIO40_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO40_OD_MSB 7u
#define PADS_BANK0_GPIO40_OD_LSB 7u
#define PADS_BANK0_GPIO40_OD_ACCESS "RW"
#define PADS_BANK0_GPIO40_IE_RESET 0x0u
#define PADS_BANK0_GPIO40_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO40_IE_MSB 6u
#define PADS_BANK0_GPIO40_IE_LSB 6u
#define PADS_BANK0_GPIO40_IE_ACCESS "RW"
#define PADS_BANK0_GPIO40_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO40_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO40_DRIVE_MSB 5u
#define PADS_BANK0_GPIO40_DRIVE_LSB 4u
#define PADS_BANK0_GPIO40_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO40_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO40_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO40_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO40_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO40_PUE_RESET 0x0u
#define PADS_BANK0_GPIO40_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO40_PUE_MSB 3u
#define PADS_BANK0_GPIO40_PUE_LSB 3u
#define PADS_BANK0_GPIO40_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO40_PDE_RESET 0x1u
#define PADS_BANK0_GPIO40_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO40_PDE_MSB 2u
#define PADS_BANK0_GPIO40_PDE_LSB 2u
#define PADS_BANK0_GPIO40_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO40_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO40_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO40_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO40_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO40_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO40_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO40_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO40_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO40_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO40_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO41_OFFSET 0x000000a8u
#define PADS_BANK0_GPIO41_BITS 0x000001ffu
#define PADS_BANK0_GPIO41_RESET 0x00000116u
#define PADS_BANK0_GPIO41_ISO_RESET 0x1u
#define PADS_BANK0_GPIO41_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO41_ISO_MSB 8u
#define PADS_BANK0_GPIO41_ISO_LSB 8u
#define PADS_BANK0_GPIO41_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO41_OD_RESET 0x0u
#define PADS_BANK0_GPIO41_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO41_OD_MSB 7u
#define PADS_BANK0_GPIO41_OD_LSB 7u
#define PADS_BANK0_GPIO41_OD_ACCESS "RW"
#define PADS_BANK0_GPIO41_IE_RESET 0x0u
#define PADS_BANK0_GPIO41_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO41_IE_MSB 6u
#define PADS_BANK0_GPIO41_IE_LSB 6u
#define PADS_BANK0_GPIO41_IE_ACCESS "RW"
#define PADS_BANK0_GPIO41_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO41_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO41_DRIVE_MSB 5u
#define PADS_BANK0_GPIO41_DRIVE_LSB 4u
#define PADS_BANK0_GPIO41_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO41_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO41_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO41_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO41_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO41_PUE_RESET 0x0u
#define PADS_BANK0_GPIO41_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO41_PUE_MSB 3u
#define PADS_BANK0_GPIO41_PUE_LSB 3u
#define PADS_BANK0_GPIO41_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO41_PDE_RESET 0x1u
#define PADS_BANK0_GPIO41_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO41_PDE_MSB 2u
#define PADS_BANK0_GPIO41_PDE_LSB 2u
#define PADS_BANK0_GPIO41_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO41_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO41_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO41_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO41_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO41_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO41_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO41_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO41_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO41_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO41_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO42_OFFSET 0x000000acu
#define PADS_BANK0_GPIO42_BITS 0x000001ffu
#define PADS_BANK0_GPIO42_RESET 0x00000116u
#define PADS_BANK0_GPIO42_ISO_RESET 0x1u
#define PADS_BANK0_GPIO42_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO42_ISO_MSB 8u
#define PADS_BANK0_GPIO42_ISO_LSB 8u
#define PADS_BANK0_GPIO42_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO42_OD_RESET 0x0u
#define PADS_BANK0_GPIO42_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO42_OD_MSB 7u
#define PADS_BANK0_GPIO42_OD_LSB 7u
#define PADS_BANK0_GPIO42_OD_ACCESS "RW"
#define PADS_BANK0_GPIO42_IE_RESET 0x0u
#define PADS_BANK0_GPIO42_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO42_IE_MSB 6u
#define PADS_BANK0_GPIO42_IE_LSB 6u
#define PADS_BANK0_GPIO42_IE_ACCESS "RW"
#define PADS_BANK0_GPIO42_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO42_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO42_DRIVE_MSB 5u
#define PADS_BANK0_GPIO42_DRIVE_LSB 4u
#define PADS_BANK0_GPIO42_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO42_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO42_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO42_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO42_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO42_PUE_RESET 0x0u
#define PADS_BANK0_GPIO42_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO42_PUE_MSB 3u
#define PADS_BANK0_GPIO42_PUE_LSB 3u
#define PADS_BANK0_GPIO42_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO42_PDE_RESET 0x1u
#define PADS_BANK0_GPIO42_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO42_PDE_MSB 2u
#define PADS_BANK0_GPIO42_PDE_LSB 2u
#define PADS_BANK0_GPIO42_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO42_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO42_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO42_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO42_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO42_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO42_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO42_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO42_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO42_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO42_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO43_OFFSET 0x000000b0u
#define PADS_BANK0_GPIO43_BITS 0x000001ffu
#define PADS_BANK0_GPIO43_RESET 0x00000116u
#define PADS_BANK0_GPIO43_ISO_RESET 0x1u
#define PADS_BANK0_GPIO43_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO43_ISO_MSB 8u
#define PADS_BANK0_GPIO43_ISO_LSB 8u
#define PADS_BANK0_GPIO43_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO43_OD_RESET 0x0u
#define PADS_BANK0_GPIO43_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO43_OD_MSB 7u
#define PADS_BANK0_GPIO43_OD_LSB 7u
#define PADS_BANK0_GPIO43_OD_ACCESS "RW"
#define PADS_BANK0_GPIO43_IE_RESET 0x0u
#define PADS_BANK0_GPIO43_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO43_IE_MSB 6u
#define PADS_BANK0_GPIO43_IE_LSB 6u
#define PADS_BANK0_GPIO43_IE_ACCESS "RW"
#define PADS_BANK0_GPIO43_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO43_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO43_DRIVE_MSB 5u
#define PADS_BANK0_GPIO43_DRIVE_LSB 4u
#define PADS_BANK0_GPIO43_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO43_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO43_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO43_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO43_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO43_PUE_RESET 0x0u
#define PADS_BANK0_GPIO43_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO43_PUE_MSB 3u
#define PADS_BANK0_GPIO43_PUE_LSB 3u
#define PADS_BANK0_GPIO43_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO43_PDE_RESET 0x1u
#define PADS_BANK0_GPIO43_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO43_PDE_MSB 2u
#define PADS_BANK0_GPIO43_PDE_LSB 2u
#define PADS_BANK0_GPIO43_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO43_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO43_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO43_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO43_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO43_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO43_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO43_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO43_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO43_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO43_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO44_OFFSET 0x000000b4u
#define PADS_BANK0_GPIO44_BITS 0x000001ffu
#define PADS_BANK0_GPIO44_RESET 0x00000116u
#define PADS_BANK0_GPIO44_ISO_RESET 0x1u
#define PADS_BANK0_GPIO44_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO44_ISO_MSB 8u
#define PADS_BANK0_GPIO44_ISO_LSB 8u
#define PADS_BANK0_GPIO44_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO44_OD_RESET 0x0u
#define PADS_BANK0_GPIO44_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO44_OD_MSB 7u
#define PADS_BANK0_GPIO44_OD_LSB 7u
#define PADS_BANK0_GPIO44_OD_ACCESS "RW"
#define PADS_BANK0_GPIO44_IE_RESET 0x0u
#define PADS_BANK0_GPIO44_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO44_IE_MSB 6u
#define PADS_BANK0_GPIO44_IE_LSB 6u
#define PADS_BANK0_GPIO44_IE_ACCESS "RW"
#define PADS_BANK0_GPIO44_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO44_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO44_DRIVE_MSB 5u
#define PADS_BANK0_GPIO44_DRIVE_LSB 4u
#define PADS_BANK0_GPIO44_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO44_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO44_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO44_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO44_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO44_PUE_RESET 0x0u
#define PADS_BANK0_GPIO44_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO44_PUE_MSB 3u
#define PADS_BANK0_GPIO44_PUE_LSB 3u
#define PADS_BANK0_GPIO44_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO44_PDE_RESET 0x1u
#define PADS_BANK0_GPIO44_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO44_PDE_MSB 2u
#define PADS_BANK0_GPIO44_PDE_LSB 2u
#define PADS_BANK0_GPIO44_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO44_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO44_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO44_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO44_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO44_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO44_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO44_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO44_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO44_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO44_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO45_OFFSET 0x000000b8u
#define PADS_BANK0_GPIO45_BITS 0x000001ffu
#define PADS_BANK0_GPIO45_RESET 0x00000116u
#define PADS_BANK0_GPIO45_ISO_RESET 0x1u
#define PADS_BANK0_GPIO45_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO45_ISO_MSB 8u
#define PADS_BANK0_GPIO45_ISO_LSB 8u
#define PADS_BANK0_GPIO45_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO45_OD_RESET 0x0u
#define PADS_BANK0_GPIO45_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO45_OD_MSB 7u
#define PADS_BANK0_GPIO45_OD_LSB 7u
#define PADS_BANK0_GPIO45_OD_ACCESS "RW"
#define PADS_BANK0_GPIO45_IE_RESET 0x0u
#define PADS_BANK0_GPIO45_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO45_IE_MSB 6u
#define PADS_BANK0_GPIO45_IE_LSB 6u
#define PADS_BANK0_GPIO45_IE_ACCESS "RW"
#define PADS_BANK0_GPIO45_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO45_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO45_DRIVE_MSB 5u
#define PADS_BANK0_GPIO45_DRIVE_LSB 4u
#define PADS_BANK0_GPIO45_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO45_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO45_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO45_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO45_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO45_PUE_RESET 0x0u
#define PADS_BANK0_GPIO45_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO45_PUE_MSB 3u
#define PADS_BANK0_GPIO45_PUE_LSB 3u
#define PADS_BANK0_GPIO45_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO45_PDE_RESET 0x1u
#define PADS_BANK0_GPIO45_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO45_PDE_MSB 2u
#define PADS_BANK0_GPIO45_PDE_LSB 2u
#define PADS_BANK0_GPIO45_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO45_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO45_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO45_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO45_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO45_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO45_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO45_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO45_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO45_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO45_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO46_OFFSET 0x000000bcu
#define PADS_BANK0_GPIO46_BITS 0x000001ffu
#define PADS_BANK0_GPIO46_RESET 0x00000116u
#define PADS_BANK0_GPIO46_ISO_RESET 0x1u
#define PADS_BANK0_GPIO46_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO46_ISO_MSB 8u
#define PADS_BANK0_GPIO46_ISO_LSB 8u
#define PADS_BANK0_GPIO46_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO46_OD_RESET 0x0u
#define PADS_BANK0_GPIO46_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO46_OD_MSB 7u
#define PADS_BANK0_GPIO46_OD_LSB 7u
#define PADS_BANK0_GPIO46_OD_ACCESS "RW"
#define PADS_BANK0_GPIO46_IE_RESET 0x0u
#define PADS_BANK0_GPIO46_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO46_IE_MSB 6u
#define PADS_BANK0_GPIO46_IE_LSB 6u
#define PADS_BANK0_GPIO46_IE_ACCESS "RW"
#define PADS_BANK0_GPIO46_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO46_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO46_DRIVE_MSB 5u
#define PADS_BANK0_GPIO46_DRIVE_LSB 4u
#define PADS_BANK0_GPIO46_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO46_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO46_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO46_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO46_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO46_PUE_RESET 0x0u
#define PADS_BANK0_GPIO46_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO46_PUE_MSB 3u
#define PADS_BANK0_GPIO46_PUE_LSB 3u
#define PADS_BANK0_GPIO46_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO46_PDE_RESET 0x1u
#define PADS_BANK0_GPIO46_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO46_PDE_MSB 2u
