gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define pads_bank0_hw ((pads_bank0_hw_t *)PADS_BANK0_BASE)
_Static_assert(sizeof (pads_bank0_hw_t) == 0x00c4, "");
#define _HARDWARE_STRUCTS_IO_BANK0_H 
#define _HARDWARE_REGS_IO_BANK0_H 
#define IO_BANK0_GPIO0_STATUS_OFFSET 0x00000000u
#define IO_BANK0_GPIO0_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO0_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO0_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO0_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO0_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO0_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO0_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO0_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO0_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO0_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO0_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO0_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO0_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO0_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO0_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO0_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO0_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO0_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO0_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO0_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO0_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO0_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO0_CTRL_OFFSET 0x00000004u
#define IO_BANK0_GPIO0_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO0_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO0_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO0_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO0_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO0_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO0_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO0_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO0_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO0_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO0_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO0_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO0_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO0_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO0_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO0_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO0_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO0_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO0_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO0_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO0_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO0_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO0_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO0_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO0_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO0_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO0_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO0_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO0_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO0_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO0_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO0_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO0_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO0_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO0_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO0_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO0_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO0_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_JTAG_TCK 0x00u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_SPI0_RX 0x01u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_UART0_TX 0x02u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_PWM_A_0 0x04u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_SIOB_PROC_0 0x05u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_PIO0_0 0x06u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_PIO1_0 0x07u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_PIO2_0 0x08u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_XIP_SS_N_1 0x09u
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO0_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO1_STATUS_OFFSET 0x00000008u
#define IO_BANK0_GPIO1_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO1_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO1_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO1_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO1_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO1_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO1_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO1_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO1_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO1_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO1_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO1_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO1_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO1_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO1_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO1_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO1_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO1_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO1_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO1_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO1_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO1_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO1_CTRL_OFFSET 0x0000000cu
#define IO_BANK0_GPIO1_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO1_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO1_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO1_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO1_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO1_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO1_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO1_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO1_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO1_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO1_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO1_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO1_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO1_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO1_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO1_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO1_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO1_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO1_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO1_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO1_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO1_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO1_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO1_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO1_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO1_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO1_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO1_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO1_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO1_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO1_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO1_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO1_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO1_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO1_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO1_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO1_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO1_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_JTAG_TMS 0x00u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_SPI0_SS_N 0x01u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_UART0_RX 0x02u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_PWM_B_0 0x04u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_SIOB_PROC_1 0x05u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_PIO0_1 0x06u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_PIO1_1 0x07u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_PIO2_1 0x08u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_CORESIGHT_TRACECLK 0x09u
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO1_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO2_STATUS_OFFSET 0x00000010u
#define IO_BANK0_GPIO2_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO2_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO2_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO2_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO2_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO2_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO2_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO2_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO2_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO2_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO2_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO2_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO2_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO2_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO2_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO2_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO2_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO2_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO2_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO2_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO2_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO2_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO2_CTRL_OFFSET 0x00000014u
#define IO_BANK0_GPIO2_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO2_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO2_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO2_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO2_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO2_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO2_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO2_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO2_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO2_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO2_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO2_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO2_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO2_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO2_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO2_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO2_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO2_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO2_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO2_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO2_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO2_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO2_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO2_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO2_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO2_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO2_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO2_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO2_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO2_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO2_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO2_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO2_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO2_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO2_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO2_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO2_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO2_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_JTAG_TDI 0x00u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_SPI0_SCLK 0x01u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_UART0_CTS 0x02u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_PWM_A_1 0x04u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_SIOB_PROC_2 0x05u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_PIO0_2 0x06u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_PIO1_2 0x07u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_PIO2_2 0x08u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_CORESIGHT_TRACEDATA_0 0x09u
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_UART0_TX 0x0bu
#define IO_BANK0_GPIO2_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO3_STATUS_OFFSET 0x00000018u
#define IO_BANK0_GPIO3_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO3_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO3_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO3_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO3_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO3_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO3_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO3_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO3_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO3_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO3_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO3_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO3_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO3_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO3_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO3_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO3_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO3_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO3_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO3_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO3_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO3_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO3_CTRL_OFFSET 0x0000001cu
#define IO_BANK0_GPIO3_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO3_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO3_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO3_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO3_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO3_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO3_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO3_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO3_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO3_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO3_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO3_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO3_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO3_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO3_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO3_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO3_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO3_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO3_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO3_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO3_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO3_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO3_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO3_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO3_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO3_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO3_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO3_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO3_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO3_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO3_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO3_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO3_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO3_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO3_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO3_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO3_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO3_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_JTAG_TDO 0x00u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_SPI0_TX 0x01u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_UART0_RTS 0x02u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_PWM_B_1 0x04u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_SIOB_PROC_3 0x05u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_PIO0_3 0x06u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_PIO1_3 0x07u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_PIO2_3 0x08u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_CORESIGHT_TRACEDATA_1 0x09u
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_UART0_RX 0x0bu
#define IO_BANK0_GPIO3_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO4_STATUS_OFFSET 0x00000020u
#define IO_BANK0_GPIO4_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO4_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO4_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO4_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO4_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO4_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO4_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO4_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO4_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO4_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO4_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO4_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO4_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO4_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO4_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO4_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO4_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO4_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO4_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO4_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO4_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO4_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO4_CTRL_OFFSET 0x00000024u
#define IO_BANK0_GPIO4_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO4_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO4_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO4_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO4_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO4_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO4_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO4_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO4_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO4_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO4_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO4_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO4_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO4_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO4_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO4_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO4_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO4_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO4_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO4_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO4_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO4_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO4_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO4_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO4_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO4_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO4_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO4_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO4_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO4_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO4_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO4_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO4_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO4_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO4_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO4_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO4_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO4_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_SPI0_RX 0x01u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_UART1_TX 0x02u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_PWM_A_2 0x04u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_SIOB_PROC_4 0x05u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_PIO0_4 0x06u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_PIO1_4 0x07u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_PIO2_4 0x08u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_CORESIGHT_TRACEDATA_2 0x09u
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO4_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO5_STATUS_OFFSET 0x00000028u
#define IO_BANK0_GPIO5_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO5_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO5_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO5_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO5_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO5_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO5_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO5_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO5_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO5_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO5_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO5_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO5_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO5_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO5_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO5_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO5_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO5_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO5_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO5_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO5_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO5_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO5_CTRL_OFFSET 0x0000002cu
#define IO_BANK0_GPIO5_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO5_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO5_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO5_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO5_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO5_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO5_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO5_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO5_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO5_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO5_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO5_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO5_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO5_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO5_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO5_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO5_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO5_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO5_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO5_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO5_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO5_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO5_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO5_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO5_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO5_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO5_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO5_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO5_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO5_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO5_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO5_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO5_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO5_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO5_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO5_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO5_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO5_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_SPI0_SS_N 0x01u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_UART1_RX 0x02u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_PWM_B_2 0x04u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_SIOB_PROC_5 0x05u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_PIO0_5 0x06u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_PIO1_5 0x07u
