gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define IO_BANK0_GPIO29_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO29_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_SPI1_SS_N 0x01u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_UART0_RX 0x02u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_PWM_B_6 0x04u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_SIOB_PROC_29 0x05u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_PIO0_29 0x06u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_PIO1_29 0x07u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_PIO2_29 0x08u
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO29_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO30_STATUS_OFFSET 0x000000f0u
#define IO_BANK0_GPIO30_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO30_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO30_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO30_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO30_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO30_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO30_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO30_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO30_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO30_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO30_CTRL_OFFSET 0x000000f4u
#define IO_BANK0_GPIO30_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO30_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO30_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO30_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO30_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO30_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO30_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO30_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO30_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO30_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO30_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO30_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO30_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO30_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO30_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO30_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO30_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO30_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO30_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO30_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO30_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO30_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO30_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO30_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO30_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO30_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO30_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO30_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO30_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO30_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO30_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO30_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO30_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO30_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_SPI1_SCLK 0x01u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_UART0_CTS 0x02u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_PWM_A_7 0x04u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_SIOB_PROC_30 0x05u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_PIO0_30 0x06u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_PIO1_30 0x07u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_PIO2_30 0x08u
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_UART0_TX 0x0bu
#define IO_BANK0_GPIO30_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO31_STATUS_OFFSET 0x000000f8u
#define IO_BANK0_GPIO31_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO31_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO31_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO31_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO31_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO31_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO31_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO31_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO31_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO31_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO31_CTRL_OFFSET 0x000000fcu
#define IO_BANK0_GPIO31_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO31_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO31_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO31_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO31_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO31_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO31_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO31_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO31_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO31_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO31_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO31_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO31_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO31_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO31_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO31_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO31_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO31_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO31_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO31_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO31_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO31_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO31_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO31_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO31_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO31_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO31_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO31_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO31_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO31_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO31_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO31_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO31_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO31_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_SPI1_TX 0x01u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_UART0_RTS 0x02u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_PWM_B_7 0x04u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_SIOB_PROC_31 0x05u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_PIO0_31 0x06u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_PIO1_31 0x07u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_PIO2_31 0x08u
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_UART0_RX 0x0bu
#define IO_BANK0_GPIO31_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO32_STATUS_OFFSET 0x00000100u
#define IO_BANK0_GPIO32_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO32_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO32_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO32_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO32_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO32_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO32_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO32_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO32_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO32_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO32_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO32_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO32_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO32_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO32_CTRL_OFFSET 0x00000104u
#define IO_BANK0_GPIO32_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO32_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO32_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO32_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO32_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO32_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO32_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO32_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO32_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO32_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO32_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO32_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO32_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO32_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO32_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO32_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO32_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO32_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO32_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO32_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO32_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO32_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO32_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO32_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO32_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO32_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO32_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO32_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO32_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO32_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO32_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO32_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO32_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO32_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO32_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO32_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO32_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO32_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_SPI0_RX 0x01u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_UART0_TX 0x02u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_PWM_A_8 0x04u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_SIOB_PROC_32 0x05u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_PIO0_32 0x06u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_PIO1_32 0x07u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_PIO2_32 0x08u
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO32_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO33_STATUS_OFFSET 0x00000108u
#define IO_BANK0_GPIO33_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO33_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO33_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO33_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO33_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO33_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO33_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO33_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO33_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO33_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO33_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO33_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO33_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO33_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO33_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO33_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO33_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO33_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO33_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO33_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO33_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO33_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO33_CTRL_OFFSET 0x0000010cu
#define IO_BANK0_GPIO33_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO33_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO33_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO33_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO33_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO33_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO33_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO33_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO33_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO33_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO33_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO33_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO33_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO33_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO33_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO33_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO33_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO33_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO33_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO33_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO33_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO33_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO33_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO33_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO33_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO33_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO33_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO33_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO33_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO33_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO33_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO33_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO33_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO33_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO33_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO33_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO33_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO33_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_SPI0_SS_N 0x01u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_UART0_RX 0x02u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_PWM_B_8 0x04u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_SIOB_PROC_33 0x05u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_PIO0_33 0x06u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_PIO1_33 0x07u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_PIO2_33 0x08u
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO33_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO34_STATUS_OFFSET 0x00000110u
#define IO_BANK0_GPIO34_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO34_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO34_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO34_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO34_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO34_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO34_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO34_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO34_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO34_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO34_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO34_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO34_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO34_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO34_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO34_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO34_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO34_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO34_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO34_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO34_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO34_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO34_CTRL_OFFSET 0x00000114u
#define IO_BANK0_GPIO34_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO34_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO34_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO34_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO34_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO34_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO34_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO34_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO34_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO34_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO34_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO34_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO34_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO34_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO34_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO34_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO34_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO34_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO34_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO34_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO34_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO34_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO34_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO34_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO34_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO34_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO34_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO34_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO34_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO34_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO34_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO34_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO34_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO34_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO34_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO34_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO34_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO34_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_SPI0_SCLK 0x01u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_UART0_CTS 0x02u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_PWM_A_9 0x04u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_SIOB_PROC_34 0x05u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_PIO0_34 0x06u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_PIO1_34 0x07u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_PIO2_34 0x08u
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_UART0_TX 0x0bu
#define IO_BANK0_GPIO34_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO35_STATUS_OFFSET 0x00000118u
#define IO_BANK0_GPIO35_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO35_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO35_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO35_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO35_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO35_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO35_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO35_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO35_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO35_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO35_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO35_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO35_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO35_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO35_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO35_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO35_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO35_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO35_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO35_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO35_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO35_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO35_CTRL_OFFSET 0x0000011cu
#define IO_BANK0_GPIO35_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO35_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO35_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO35_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO35_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO35_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO35_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO35_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO35_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO35_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO35_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO35_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO35_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO35_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO35_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO35_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO35_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO35_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO35_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO35_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO35_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO35_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO35_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO35_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO35_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO35_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO35_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO35_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO35_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO35_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO35_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO35_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO35_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO35_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO35_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO35_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO35_CTRL_OUTOVER_VALUE_LOW 0x2u
