gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define IO_BANK0_GPIO35_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_SPI0_TX 0x01u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_UART0_RTS 0x02u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_PWM_B_9 0x04u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_SIOB_PROC_35 0x05u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_PIO0_35 0x06u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_PIO1_35 0x07u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_PIO2_35 0x08u
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_UART0_RX 0x0bu
#define IO_BANK0_GPIO35_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO36_STATUS_OFFSET 0x00000120u
#define IO_BANK0_GPIO36_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO36_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO36_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO36_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO36_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO36_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO36_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO36_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO36_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO36_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO36_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO36_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO36_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO36_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO36_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO36_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO36_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO36_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO36_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO36_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO36_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO36_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO36_CTRL_OFFSET 0x00000124u
#define IO_BANK0_GPIO36_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO36_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO36_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO36_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO36_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO36_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO36_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO36_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO36_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO36_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO36_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO36_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO36_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO36_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO36_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO36_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO36_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO36_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO36_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO36_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO36_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO36_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO36_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO36_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO36_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO36_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO36_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO36_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO36_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO36_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO36_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO36_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO36_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO36_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO36_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO36_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO36_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO36_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_SPI0_RX 0x01u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_UART1_TX 0x02u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_PWM_A_10 0x04u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_SIOB_PROC_36 0x05u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_PIO0_36 0x06u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_PIO1_36 0x07u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_PIO2_36 0x08u
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO36_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO37_STATUS_OFFSET 0x00000128u
#define IO_BANK0_GPIO37_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO37_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO37_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO37_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO37_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO37_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO37_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO37_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO37_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO37_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO37_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO37_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO37_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO37_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO37_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO37_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO37_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO37_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO37_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO37_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO37_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO37_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO37_CTRL_OFFSET 0x0000012cu
#define IO_BANK0_GPIO37_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO37_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO37_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO37_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO37_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO37_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO37_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO37_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO37_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO37_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO37_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO37_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO37_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO37_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO37_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO37_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO37_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO37_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO37_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO37_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO37_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO37_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO37_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO37_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO37_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO37_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO37_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO37_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO37_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO37_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO37_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO37_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO37_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO37_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO37_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO37_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO37_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO37_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_SPI0_SS_N 0x01u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_UART1_RX 0x02u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_PWM_B_10 0x04u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_SIOB_PROC_37 0x05u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_PIO0_37 0x06u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_PIO1_37 0x07u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_PIO2_37 0x08u
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO37_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO38_STATUS_OFFSET 0x00000130u
#define IO_BANK0_GPIO38_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO38_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO38_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO38_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO38_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO38_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO38_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO38_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO38_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO38_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO38_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO38_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO38_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO38_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO38_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO38_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO38_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO38_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO38_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO38_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO38_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO38_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO38_CTRL_OFFSET 0x00000134u
#define IO_BANK0_GPIO38_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO38_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO38_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO38_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO38_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO38_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO38_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO38_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO38_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO38_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO38_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO38_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO38_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO38_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO38_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO38_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO38_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO38_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO38_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO38_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO38_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO38_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO38_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO38_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO38_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO38_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO38_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO38_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO38_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO38_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO38_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO38_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO38_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO38_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO38_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO38_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO38_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO38_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_SPI0_SCLK 0x01u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_UART1_CTS 0x02u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_PWM_A_11 0x04u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_SIOB_PROC_38 0x05u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_PIO0_38 0x06u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_PIO1_38 0x07u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_PIO2_38 0x08u
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_UART1_TX 0x0bu
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO39_STATUS_OFFSET 0x00000138u
#define IO_BANK0_GPIO39_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO39_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO39_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO39_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO39_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO39_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO39_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO39_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO39_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO39_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO39_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO39_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO39_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO39_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO39_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO39_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO39_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO39_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO39_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO39_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO39_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO39_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO39_CTRL_OFFSET 0x0000013cu
#define IO_BANK0_GPIO39_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO39_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO39_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO39_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO39_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO39_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO39_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO39_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO39_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO39_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO39_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO39_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO39_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO39_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO39_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO39_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO39_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO39_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO39_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO39_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO39_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO39_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO39_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO39_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO39_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO39_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO39_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO39_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO39_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO39_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO39_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO39_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO39_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO39_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO39_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO39_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO39_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO39_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_SPI0_TX 0x01u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_UART1_RTS 0x02u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_PWM_B_11 0x04u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_SIOB_PROC_39 0x05u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_PIO0_39 0x06u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_PIO1_39 0x07u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_PIO2_39 0x08u
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_UART1_RX 0x0bu
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO40_STATUS_OFFSET 0x00000140u
#define IO_BANK0_GPIO40_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO40_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO40_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO40_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO40_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO40_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO40_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO40_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO40_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO40_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO40_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO40_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO40_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO40_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO40_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO40_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO40_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO40_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO40_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO40_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO40_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO40_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO40_CTRL_OFFSET 0x00000144u
#define IO_BANK0_GPIO40_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO40_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO40_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO40_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO40_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO40_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO40_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO40_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO40_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO40_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO40_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO40_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO40_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO40_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO40_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO40_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO40_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO40_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO40_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO40_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO40_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO40_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO40_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO40_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO40_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO40_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO40_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO40_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO40_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO40_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO40_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO40_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO40_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO40_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO40_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO40_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO40_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO40_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_SPI1_RX 0x01u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_UART1_TX 0x02u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_PWM_A_8 0x04u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_SIOB_PROC_40 0x05u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_PIO0_40 0x06u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_PIO1_40 0x07u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_PIO2_40 0x08u
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO41_STATUS_OFFSET 0x00000148u
#define IO_BANK0_GPIO41_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO41_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO41_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO41_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO41_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO41_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO41_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO41_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO41_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO41_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO41_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO41_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO41_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO41_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO41_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO41_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO41_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO41_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO41_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO41_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO41_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO41_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO41_CTRL_OFFSET 0x0000014cu
#define IO_BANK0_GPIO41_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO41_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO41_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO41_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO41_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO41_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO41_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO41_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO41_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO41_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO41_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO41_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO41_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO41_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO41_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO41_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO41_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO41_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO41_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO41_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO41_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO41_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO41_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO41_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO41_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO41_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO41_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO41_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO41_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO41_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO41_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO41_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO41_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO41_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO41_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO41_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO41_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO41_CTRL_OUTOVER_VALUE_HIGH 0x3u
