gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_SPI1_SS_N 0x01u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_UART1_RX 0x02u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_PWM_B_8 0x04u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_SIOB_PROC_41 0x05u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_PIO0_41 0x06u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_PIO1_41 0x07u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_PIO2_41 0x08u
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO42_STATUS_OFFSET 0x00000150u
#define IO_BANK0_GPIO42_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO42_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO42_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO42_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO42_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO42_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO42_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO42_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO42_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO42_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO42_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO42_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO42_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO42_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO42_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO42_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO42_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO42_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO42_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO42_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO42_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO42_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO42_CTRL_OFFSET 0x00000154u
#define IO_BANK0_GPIO42_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO42_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO42_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO42_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO42_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO42_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO42_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO42_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO42_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO42_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO42_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO42_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO42_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO42_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO42_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO42_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO42_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO42_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO42_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO42_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO42_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO42_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO42_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO42_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO42_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO42_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO42_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO42_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO42_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO42_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO42_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO42_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO42_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO42_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO42_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO42_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO42_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO42_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_SPI1_SCLK 0x01u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_UART1_CTS 0x02u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_PWM_A_9 0x04u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_SIOB_PROC_42 0x05u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_PIO0_42 0x06u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_PIO1_42 0x07u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_PIO2_42 0x08u
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_UART1_TX 0x0bu
#define IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO43_STATUS_OFFSET 0x00000158u
#define IO_BANK0_GPIO43_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO43_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO43_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO43_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO43_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO43_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO43_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO43_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO43_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO43_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO43_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO43_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO43_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO43_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO43_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO43_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO43_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO43_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO43_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO43_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO43_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO43_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO43_CTRL_OFFSET 0x0000015cu
#define IO_BANK0_GPIO43_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO43_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO43_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO43_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO43_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO43_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO43_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO43_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO43_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO43_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO43_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO43_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO43_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO43_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO43_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO43_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO43_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO43_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO43_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO43_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO43_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO43_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO43_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO43_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO43_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO43_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO43_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO43_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO43_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO43_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO43_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO43_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO43_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO43_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO43_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO43_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO43_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO43_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_SPI1_TX 0x01u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_UART1_RTS 0x02u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_PWM_B_9 0x04u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_SIOB_PROC_43 0x05u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_PIO0_43 0x06u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_PIO1_43 0x07u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_PIO2_43 0x08u
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_UART1_RX 0x0bu
#define IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO44_STATUS_OFFSET 0x00000160u
#define IO_BANK0_GPIO44_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO44_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO44_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO44_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO44_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO44_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO44_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO44_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO44_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO44_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO44_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO44_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO44_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO44_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO44_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO44_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO44_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO44_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO44_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO44_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO44_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO44_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO44_CTRL_OFFSET 0x00000164u
#define IO_BANK0_GPIO44_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO44_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO44_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO44_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO44_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO44_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO44_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO44_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO44_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO44_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO44_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO44_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO44_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO44_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO44_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO44_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO44_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO44_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO44_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO44_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO44_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO44_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO44_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO44_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO44_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO44_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO44_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO44_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO44_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO44_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO44_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO44_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO44_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO44_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO44_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO44_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO44_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO44_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_SPI1_RX 0x01u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_UART0_TX 0x02u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_PWM_A_10 0x04u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_SIOB_PROC_44 0x05u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_PIO0_44 0x06u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_PIO1_44 0x07u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_PIO2_44 0x08u
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO45_STATUS_OFFSET 0x00000168u
#define IO_BANK0_GPIO45_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO45_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO45_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO45_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO45_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO45_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO45_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO45_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO45_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO45_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO45_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO45_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO45_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO45_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO45_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO45_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO45_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO45_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO45_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO45_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO45_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO45_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO45_CTRL_OFFSET 0x0000016cu
#define IO_BANK0_GPIO45_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO45_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO45_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO45_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO45_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO45_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO45_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO45_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO45_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO45_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO45_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO45_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO45_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO45_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO45_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO45_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO45_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO45_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO45_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO45_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO45_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO45_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO45_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO45_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO45_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO45_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO45_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO45_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO45_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO45_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO45_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO45_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO45_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO45_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO45_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO45_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO45_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO45_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_SPI1_SS_N 0x01u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_UART0_RX 0x02u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_PWM_B_10 0x04u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_SIOB_PROC_45 0x05u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_PIO0_45 0x06u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_PIO1_45 0x07u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_PIO2_45 0x08u
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO46_STATUS_OFFSET 0x00000170u
#define IO_BANK0_GPIO46_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO46_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO46_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO46_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO46_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO46_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO46_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO46_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO46_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO46_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO46_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO46_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO46_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO46_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO46_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO46_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO46_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO46_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO46_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO46_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO46_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO46_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO46_CTRL_OFFSET 0x00000174u
#define IO_BANK0_GPIO46_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO46_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO46_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO46_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO46_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO46_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO46_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO46_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO46_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO46_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO46_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO46_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO46_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO46_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO46_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO46_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO46_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO46_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO46_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO46_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO46_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO46_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO46_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO46_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO46_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO46_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO46_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO46_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO46_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO46_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO46_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO46_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO46_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO46_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO46_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO46_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO46_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO46_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_SPI1_SCLK 0x01u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_UART0_CTS 0x02u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_PWM_A_11 0x04u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_SIOB_PROC_46 0x05u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_PIO0_46 0x06u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_PIO1_46 0x07u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_PIO2_46 0x08u
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_UART0_TX 0x0bu
#define IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO47_STATUS_OFFSET 0x00000178u
#define IO_BANK0_GPIO47_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO47_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO47_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO47_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO47_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO47_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO47_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO47_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO47_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO47_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO47_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO47_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO47_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO47_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO47_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO47_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO47_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO47_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO47_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO47_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO47_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO47_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO47_CTRL_OFFSET 0x0000017cu
#define IO_BANK0_GPIO47_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO47_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO47_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO47_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO47_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO47_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO47_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO47_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO47_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO47_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO47_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO47_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO47_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO47_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO47_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO47_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO47_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO47_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO47_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO47_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO47_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO47_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO47_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO47_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO47_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO47_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO47_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO47_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO47_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO47_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO47_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO47_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO47_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO47_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO47_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO47_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO47_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO47_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO47_CTRL_FUNCSEL_RESET 0x1fu
