gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO25_BITS 0x02000000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO25_MSB 25u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO25_LSB 25u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO25_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO24_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO24_BITS 0x01000000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO24_MSB 24u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO24_LSB 24u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO24_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO23_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO23_BITS 0x00800000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO23_MSB 23u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO23_LSB 23u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO23_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO22_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO22_BITS 0x00400000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO22_MSB 22u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO22_LSB 22u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO22_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO21_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO21_BITS 0x00200000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO21_MSB 21u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO21_LSB 21u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO21_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO20_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO20_BITS 0x00100000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO20_MSB 20u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO20_LSB 20u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO20_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO19_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO19_BITS 0x00080000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO19_MSB 19u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO19_LSB 19u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO19_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO18_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO18_BITS 0x00040000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO18_MSB 18u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO18_LSB 18u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO18_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO17_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO17_BITS 0x00020000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO17_MSB 17u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO17_LSB 17u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO17_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_BITS 0x00010000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_MSB 16u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_LSB 16u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO16_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_BITS 0x00008000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_MSB 15u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_LSB 15u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO15_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_BITS 0x00004000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_MSB 14u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_LSB 14u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO14_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_BITS 0x00002000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_MSB 13u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_LSB 13u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO13_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_BITS 0x00001000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_MSB 12u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_LSB 12u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO12_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_BITS 0x00000800u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_MSB 11u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_LSB 11u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO11_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_BITS 0x00000400u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_MSB 10u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_LSB 10u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO10_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_BITS 0x00000200u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_MSB 9u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_LSB 9u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO9_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_BITS 0x00000100u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_MSB 8u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_LSB 8u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO8_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_BITS 0x00000080u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_MSB 7u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_LSB 7u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO7_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_BITS 0x00000040u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_MSB 6u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_LSB 6u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO6_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_BITS 0x00000020u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_MSB 5u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_LSB 5u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO5_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_BITS 0x00000010u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_MSB 4u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_LSB 4u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO4_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_BITS 0x00000008u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_MSB 3u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_LSB 3u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO3_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_BITS 0x00000004u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_MSB 2u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_LSB 2u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO2_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_BITS 0x00000002u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_MSB 1u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_LSB 1u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO1_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_BITS 0x00000001u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_MSB 0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_LSB 0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE0_GPIO0_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_OFFSET 0x0000021cu
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_BITS 0x0000ffffu
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_RESET 0x00000000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_BITS 0x00008000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_MSB 15u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_LSB 15u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO47_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_BITS 0x00004000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_MSB 14u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_LSB 14u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO46_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_BITS 0x00002000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_MSB 13u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_LSB 13u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO45_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_BITS 0x00001000u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_MSB 12u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_LSB 12u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO44_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_BITS 0x00000800u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_MSB 11u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_LSB 11u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO43_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_BITS 0x00000400u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_MSB 10u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_LSB 10u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO42_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_BITS 0x00000200u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_MSB 9u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_LSB 9u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO41_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_BITS 0x00000100u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_MSB 8u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_LSB 8u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO40_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_BITS 0x00000080u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_MSB 7u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_LSB 7u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO39_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_BITS 0x00000040u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_MSB 6u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_LSB 6u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO38_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_BITS 0x00000020u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_MSB 5u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_LSB 5u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO37_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_BITS 0x00000010u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_MSB 4u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_LSB 4u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO36_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_BITS 0x00000008u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_MSB 3u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_LSB 3u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO35_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_BITS 0x00000004u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_MSB 2u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_LSB 2u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO34_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_BITS 0x00000002u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_MSB 1u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_LSB 1u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO33_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_BITS 0x00000001u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_MSB 0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_LSB 0u
#define IO_BANK0_IRQSUMMARY_PROC1_NONSECURE1_GPIO32_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_OFFSET 0x00000220u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_BITS 0xffffffffu
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_RESET 0x00000000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_BITS 0x80000000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_MSB 31u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_LSB 31u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_BITS 0x40000000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_MSB 30u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_LSB 30u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_BITS 0x20000000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_MSB 29u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_LSB 29u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_BITS 0x10000000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_MSB 28u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_LSB 28u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_BITS 0x08000000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_MSB 27u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_LSB 27u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_BITS 0x04000000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_MSB 26u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_LSB 26u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_BITS 0x02000000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_MSB 25u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_LSB 25u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_BITS 0x01000000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_MSB 24u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_LSB 24u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_BITS 0x00800000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_MSB 23u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_LSB 23u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_BITS 0x00400000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_MSB 22u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_LSB 22u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_BITS 0x00200000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_MSB 21u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_LSB 21u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_BITS 0x00100000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_MSB 20u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_LSB 20u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_BITS 0x00080000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_MSB 19u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_LSB 19u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_BITS 0x00040000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_MSB 18u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_LSB 18u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17_BITS 0x00020000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17_MSB 17u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17_LSB 17u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO16_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO16_BITS 0x00010000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO16_MSB 16u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO16_LSB 16u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO16_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO15_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO15_BITS 0x00008000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO15_MSB 15u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO15_LSB 15u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO15_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO14_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO14_BITS 0x00004000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO14_MSB 14u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO14_LSB 14u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO14_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO13_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO13_BITS 0x00002000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO13_MSB 13u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO13_LSB 13u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO13_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO12_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO12_BITS 0x00001000u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO12_MSB 12u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO12_LSB 12u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO12_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO11_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO11_BITS 0x00000800u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO11_MSB 11u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO11_LSB 11u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO11_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO10_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO10_BITS 0x00000400u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO10_MSB 10u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO10_LSB 10u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO10_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO9_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO9_BITS 0x00000200u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO9_MSB 9u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO9_LSB 9u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO9_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO8_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO8_BITS 0x00000100u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO8_MSB 8u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO8_LSB 8u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO8_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO7_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO7_BITS 0x00000080u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO7_MSB 7u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO7_LSB 7u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO7_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO6_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO6_BITS 0x00000040u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO6_MSB 6u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO6_LSB 6u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO6_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO5_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO5_BITS 0x00000020u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO5_MSB 5u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO5_LSB 5u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO5_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO4_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO4_BITS 0x00000010u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO4_MSB 4u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO4_LSB 4u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO4_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO3_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO3_BITS 0x00000008u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO3_MSB 3u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO3_LSB 3u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO3_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO2_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO2_BITS 0x00000004u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO2_MSB 2u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO2_LSB 2u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO2_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO1_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO1_BITS 0x00000002u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO1_MSB 1u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO1_LSB 1u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO1_ACCESS "RO"
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO0_RESET 0x0u
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO0_BITS 0x00000001u
