gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
typedef struct {
   
    io_ro_32 status;
   
    io_rw_32 ctrl;
} io_bank0_status_ctrl_hw_t;
typedef struct {
   
    io_rw_32 inte[6];
   
    io_rw_32 intf[6];
   
    io_ro_32 ints[6];
} io_bank0_irq_ctrl_hw_t;
typedef struct {
    io_bank0_status_ctrl_hw_t io[48];
    uint32_t _pad0[32];
   
    io_ro_32 irqsummary_proc0_secure[2];
   
    io_ro_32 irqsummary_proc0_nonsecure[2];
   
    io_ro_32 irqsummary_proc1_secure[2];
   
    io_ro_32 irqsummary_proc1_nonsecure[2];
   
    io_ro_32 irqsummary_dormant_wake_secure[2];
   
    io_ro_32 irqsummary_dormant_wake_nonsecure[2];
   
    io_rw_32 intr[6];
    union {
        struct {
            io_bank0_irq_ctrl_hw_t proc0_irq_ctrl;
            io_bank0_irq_ctrl_hw_t proc1_irq_ctrl;
            io_bank0_irq_ctrl_hw_t dormant_wake_irq_ctrl;
        };
        io_bank0_irq_ctrl_hw_t irq_ctrl[3];
    };
} io_bank0_hw_t;
#define io_bank0_hw ((io_bank0_hw_t *)IO_BANK0_BASE)
_Static_assert(sizeof (io_bank0_hw_t) == 0x0320, "");
#define _HARDWARE_IRQ_H 
#define PICO_MAX_SHARED_IRQ_HANDLERS 4
#define PICO_DISABLE_SHARED_IRQ_HANDLERS 0
#define PICO_VTABLE_PER_CORE 0
#define _PICO_PLATFORM_CPU_REGS_H 
#define _HARDWARE_REGS_M33_H 
#define M33_ITM_STIM0_OFFSET 0x00000000u
#define M33_ITM_STIM0_BITS 0xffffffffu
#define M33_ITM_STIM0_RESET 0x00000000u
#define M33_ITM_STIM0_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM0_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM0_STIMULUS_MSB 31u
#define M33_ITM_STIM0_STIMULUS_LSB 0u
#define M33_ITM_STIM0_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM1_OFFSET 0x00000004u
#define M33_ITM_STIM1_BITS 0xffffffffu
#define M33_ITM_STIM1_RESET 0x00000000u
#define M33_ITM_STIM1_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM1_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM1_STIMULUS_MSB 31u
#define M33_ITM_STIM1_STIMULUS_LSB 0u
#define M33_ITM_STIM1_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM2_OFFSET 0x00000008u
#define M33_ITM_STIM2_BITS 0xffffffffu
#define M33_ITM_STIM2_RESET 0x00000000u
#define M33_ITM_STIM2_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM2_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM2_STIMULUS_MSB 31u
#define M33_ITM_STIM2_STIMULUS_LSB 0u
#define M33_ITM_STIM2_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM3_OFFSET 0x0000000cu
#define M33_ITM_STIM3_BITS 0xffffffffu
#define M33_ITM_STIM3_RESET 0x00000000u
#define M33_ITM_STIM3_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM3_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM3_STIMULUS_MSB 31u
#define M33_ITM_STIM3_STIMULUS_LSB 0u
#define M33_ITM_STIM3_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM4_OFFSET 0x00000010u
#define M33_ITM_STIM4_BITS 0xffffffffu
#define M33_ITM_STIM4_RESET 0x00000000u
#define M33_ITM_STIM4_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM4_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM4_STIMULUS_MSB 31u
#define M33_ITM_STIM4_STIMULUS_LSB 0u
#define M33_ITM_STIM4_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM5_OFFSET 0x00000014u
#define M33_ITM_STIM5_BITS 0xffffffffu
#define M33_ITM_STIM5_RESET 0x00000000u
#define M33_ITM_STIM5_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM5_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM5_STIMULUS_MSB 31u
#define M33_ITM_STIM5_STIMULUS_LSB 0u
#define M33_ITM_STIM5_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM6_OFFSET 0x00000018u
#define M33_ITM_STIM6_BITS 0xffffffffu
#define M33_ITM_STIM6_RESET 0x00000000u
#define M33_ITM_STIM6_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM6_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM6_STIMULUS_MSB 31u
#define M33_ITM_STIM6_STIMULUS_LSB 0u
#define M33_ITM_STIM6_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM7_OFFSET 0x0000001cu
#define M33_ITM_STIM7_BITS 0xffffffffu
#define M33_ITM_STIM7_RESET 0x00000000u
#define M33_ITM_STIM7_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM7_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM7_STIMULUS_MSB 31u
#define M33_ITM_STIM7_STIMULUS_LSB 0u
#define M33_ITM_STIM7_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM8_OFFSET 0x00000020u
#define M33_ITM_STIM8_BITS 0xffffffffu
#define M33_ITM_STIM8_RESET 0x00000000u
#define M33_ITM_STIM8_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM8_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM8_STIMULUS_MSB 31u
#define M33_ITM_STIM8_STIMULUS_LSB 0u
#define M33_ITM_STIM8_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM9_OFFSET 0x00000024u
#define M33_ITM_STIM9_BITS 0xffffffffu
#define M33_ITM_STIM9_RESET 0x00000000u
#define M33_ITM_STIM9_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM9_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM9_STIMULUS_MSB 31u
#define M33_ITM_STIM9_STIMULUS_LSB 0u
#define M33_ITM_STIM9_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM10_OFFSET 0x00000028u
#define M33_ITM_STIM10_BITS 0xffffffffu
#define M33_ITM_STIM10_RESET 0x00000000u
#define M33_ITM_STIM10_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM10_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM10_STIMULUS_MSB 31u
#define M33_ITM_STIM10_STIMULUS_LSB 0u
#define M33_ITM_STIM10_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM11_OFFSET 0x0000002cu
#define M33_ITM_STIM11_BITS 0xffffffffu
#define M33_ITM_STIM11_RESET 0x00000000u
#define M33_ITM_STIM11_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM11_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM11_STIMULUS_MSB 31u
#define M33_ITM_STIM11_STIMULUS_LSB 0u
#define M33_ITM_STIM11_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM12_OFFSET 0x00000030u
#define M33_ITM_STIM12_BITS 0xffffffffu
#define M33_ITM_STIM12_RESET 0x00000000u
#define M33_ITM_STIM12_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM12_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM12_STIMULUS_MSB 31u
#define M33_ITM_STIM12_STIMULUS_LSB 0u
#define M33_ITM_STIM12_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM13_OFFSET 0x00000034u
#define M33_ITM_STIM13_BITS 0xffffffffu
#define M33_ITM_STIM13_RESET 0x00000000u
#define M33_ITM_STIM13_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM13_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM13_STIMULUS_MSB 31u
#define M33_ITM_STIM13_STIMULUS_LSB 0u
#define M33_ITM_STIM13_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM14_OFFSET 0x00000038u
#define M33_ITM_STIM14_BITS 0xffffffffu
#define M33_ITM_STIM14_RESET 0x00000000u
#define M33_ITM_STIM14_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM14_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM14_STIMULUS_MSB 31u
#define M33_ITM_STIM14_STIMULUS_LSB 0u
#define M33_ITM_STIM14_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM15_OFFSET 0x0000003cu
#define M33_ITM_STIM15_BITS 0xffffffffu
#define M33_ITM_STIM15_RESET 0x00000000u
#define M33_ITM_STIM15_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM15_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM15_STIMULUS_MSB 31u
#define M33_ITM_STIM15_STIMULUS_LSB 0u
#define M33_ITM_STIM15_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM16_OFFSET 0x00000040u
#define M33_ITM_STIM16_BITS 0xffffffffu
#define M33_ITM_STIM16_RESET 0x00000000u
#define M33_ITM_STIM16_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM16_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM16_STIMULUS_MSB 31u
#define M33_ITM_STIM16_STIMULUS_LSB 0u
#define M33_ITM_STIM16_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM17_OFFSET 0x00000044u
#define M33_ITM_STIM17_BITS 0xffffffffu
#define M33_ITM_STIM17_RESET 0x00000000u
#define M33_ITM_STIM17_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM17_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM17_STIMULUS_MSB 31u
#define M33_ITM_STIM17_STIMULUS_LSB 0u
#define M33_ITM_STIM17_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM18_OFFSET 0x00000048u
#define M33_ITM_STIM18_BITS 0xffffffffu
#define M33_ITM_STIM18_RESET 0x00000000u
#define M33_ITM_STIM18_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM18_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM18_STIMULUS_MSB 31u
#define M33_ITM_STIM18_STIMULUS_LSB 0u
#define M33_ITM_STIM18_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM19_OFFSET 0x0000004cu
#define M33_ITM_STIM19_BITS 0xffffffffu
#define M33_ITM_STIM19_RESET 0x00000000u
#define M33_ITM_STIM19_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM19_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM19_STIMULUS_MSB 31u
#define M33_ITM_STIM19_STIMULUS_LSB 0u
#define M33_ITM_STIM19_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM20_OFFSET 0x00000050u
#define M33_ITM_STIM20_BITS 0xffffffffu
#define M33_ITM_STIM20_RESET 0x00000000u
#define M33_ITM_STIM20_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM20_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM20_STIMULUS_MSB 31u
#define M33_ITM_STIM20_STIMULUS_LSB 0u
#define M33_ITM_STIM20_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM21_OFFSET 0x00000054u
#define M33_ITM_STIM21_BITS 0xffffffffu
#define M33_ITM_STIM21_RESET 0x00000000u
#define M33_ITM_STIM21_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM21_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM21_STIMULUS_MSB 31u
#define M33_ITM_STIM21_STIMULUS_LSB 0u
#define M33_ITM_STIM21_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM22_OFFSET 0x00000058u
#define M33_ITM_STIM22_BITS 0xffffffffu
#define M33_ITM_STIM22_RESET 0x00000000u
#define M33_ITM_STIM22_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM22_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM22_STIMULUS_MSB 31u
#define M33_ITM_STIM22_STIMULUS_LSB 0u
#define M33_ITM_STIM22_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM23_OFFSET 0x0000005cu
#define M33_ITM_STIM23_BITS 0xffffffffu
#define M33_ITM_STIM23_RESET 0x00000000u
#define M33_ITM_STIM23_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM23_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM23_STIMULUS_MSB 31u
#define M33_ITM_STIM23_STIMULUS_LSB 0u
#define M33_ITM_STIM23_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM24_OFFSET 0x00000060u
#define M33_ITM_STIM24_BITS 0xffffffffu
#define M33_ITM_STIM24_RESET 0x00000000u
#define M33_ITM_STIM24_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM24_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM24_STIMULUS_MSB 31u
#define M33_ITM_STIM24_STIMULUS_LSB 0u
#define M33_ITM_STIM24_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM25_OFFSET 0x00000064u
#define M33_ITM_STIM25_BITS 0xffffffffu
#define M33_ITM_STIM25_RESET 0x00000000u
#define M33_ITM_STIM25_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM25_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM25_STIMULUS_MSB 31u
#define M33_ITM_STIM25_STIMULUS_LSB 0u
#define M33_ITM_STIM25_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM26_OFFSET 0x00000068u
#define M33_ITM_STIM26_BITS 0xffffffffu
#define M33_ITM_STIM26_RESET 0x00000000u
#define M33_ITM_STIM26_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM26_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM26_STIMULUS_MSB 31u
#define M33_ITM_STIM26_STIMULUS_LSB 0u
#define M33_ITM_STIM26_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM27_OFFSET 0x0000006cu
#define M33_ITM_STIM27_BITS 0xffffffffu
#define M33_ITM_STIM27_RESET 0x00000000u
#define M33_ITM_STIM27_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM27_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM27_STIMULUS_MSB 31u
#define M33_ITM_STIM27_STIMULUS_LSB 0u
#define M33_ITM_STIM27_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM28_OFFSET 0x00000070u
#define M33_ITM_STIM28_BITS 0xffffffffu
#define M33_ITM_STIM28_RESET 0x00000000u
#define M33_ITM_STIM28_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM28_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM28_STIMULUS_MSB 31u
#define M33_ITM_STIM28_STIMULUS_LSB 0u
#define M33_ITM_STIM28_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM29_OFFSET 0x00000074u
#define M33_ITM_STIM29_BITS 0xffffffffu
#define M33_ITM_STIM29_RESET 0x00000000u
#define M33_ITM_STIM29_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM29_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM29_STIMULUS_MSB 31u
#define M33_ITM_STIM29_STIMULUS_LSB 0u
#define M33_ITM_STIM29_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM30_OFFSET 0x00000078u
#define M33_ITM_STIM30_BITS 0xffffffffu
#define M33_ITM_STIM30_RESET 0x00000000u
#define M33_ITM_STIM30_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM30_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM30_STIMULUS_MSB 31u
#define M33_ITM_STIM30_STIMULUS_LSB 0u
#define M33_ITM_STIM30_STIMULUS_ACCESS "RW"
#define M33_ITM_STIM31_OFFSET 0x0000007cu
#define M33_ITM_STIM31_BITS 0xffffffffu
#define M33_ITM_STIM31_RESET 0x00000000u
#define M33_ITM_STIM31_STIMULUS_RESET 0x00000000u
#define M33_ITM_STIM31_STIMULUS_BITS 0xffffffffu
#define M33_ITM_STIM31_STIMULUS_MSB 31u
#define M33_ITM_STIM31_STIMULUS_LSB 0u
#define M33_ITM_STIM31_STIMULUS_ACCESS "RW"
#define M33_ITM_TER0_OFFSET 0x00000e00u
#define M33_ITM_TER0_BITS 0xffffffffu
#define M33_ITM_TER0_RESET 0x00000000u
#define M33_ITM_TER0_STIMENA_RESET 0x00000000u
#define M33_ITM_TER0_STIMENA_BITS 0xffffffffu
#define M33_ITM_TER0_STIMENA_MSB 31u
#define M33_ITM_TER0_STIMENA_LSB 0u
#define M33_ITM_TER0_STIMENA_ACCESS "RW"
#define M33_ITM_TPR_OFFSET 0x00000e40u
#define M33_ITM_TPR_BITS 0x0000000fu
#define M33_ITM_TPR_RESET 0x00000000u
#define M33_ITM_TPR_PRIVMASK_RESET 0x0u
#define M33_ITM_TPR_PRIVMASK_BITS 0x0000000fu
#define M33_ITM_TPR_PRIVMASK_MSB 3u
#define M33_ITM_TPR_PRIVMASK_LSB 0u
#define M33_ITM_TPR_PRIVMASK_ACCESS "RW"
#define M33_ITM_TCR_OFFSET 0x00000e80u
#define M33_ITM_TCR_BITS 0x00ff0f3fu
#define M33_ITM_TCR_RESET 0x00000000u
#define M33_ITM_TCR_BUSY_RESET 0x0u
#define M33_ITM_TCR_BUSY_BITS 0x00800000u
#define M33_ITM_TCR_BUSY_MSB 23u
#define M33_ITM_TCR_BUSY_LSB 23u
#define M33_ITM_TCR_BUSY_ACCESS "RO"
#define M33_ITM_TCR_TRACEBUSID_RESET 0x00u
#define M33_ITM_TCR_TRACEBUSID_BITS 0x007f0000u
#define M33_ITM_TCR_TRACEBUSID_MSB 22u
#define M33_ITM_TCR_TRACEBUSID_LSB 16u
#define M33_ITM_TCR_TRACEBUSID_ACCESS "RW"
#define M33_ITM_TCR_GTSFREQ_RESET 0x0u
#define M33_ITM_TCR_GTSFREQ_BITS 0x00000c00u
#define M33_ITM_TCR_GTSFREQ_MSB 11u
#define M33_ITM_TCR_GTSFREQ_LSB 10u
#define M33_ITM_TCR_GTSFREQ_ACCESS "RW"
#define M33_ITM_TCR_TSPRESCALE_RESET 0x0u
#define M33_ITM_TCR_TSPRESCALE_BITS 0x00000300u
#define M33_ITM_TCR_TSPRESCALE_MSB 9u
#define M33_ITM_TCR_TSPRESCALE_LSB 8u
#define M33_ITM_TCR_TSPRESCALE_ACCESS "RW"
#define M33_ITM_TCR_STALLENA_RESET 0x0u
#define M33_ITM_TCR_STALLENA_BITS 0x00000020u
#define M33_ITM_TCR_STALLENA_MSB 5u
#define M33_ITM_TCR_STALLENA_LSB 5u
#define M33_ITM_TCR_STALLENA_ACCESS "RW"
#define M33_ITM_TCR_SWOENA_RESET 0x0u
#define M33_ITM_TCR_SWOENA_BITS 0x00000010u
#define M33_ITM_TCR_SWOENA_MSB 4u
#define M33_ITM_TCR_SWOENA_LSB 4u
#define M33_ITM_TCR_SWOENA_ACCESS "RW"
#define M33_ITM_TCR_TXENA_RESET 0x0u
#define M33_ITM_TCR_TXENA_BITS 0x00000008u
#define M33_ITM_TCR_TXENA_MSB 3u
#define M33_ITM_TCR_TXENA_LSB 3u
#define M33_ITM_TCR_TXENA_ACCESS "RW"
#define M33_ITM_TCR_SYNCENA_RESET 0x0u
#define M33_ITM_TCR_SYNCENA_BITS 0x00000004u
#define M33_ITM_TCR_SYNCENA_MSB 2u
#define M33_ITM_TCR_SYNCENA_LSB 2u
#define M33_ITM_TCR_SYNCENA_ACCESS "RW"
#define M33_ITM_TCR_TSENA_RESET 0x0u
#define M33_ITM_TCR_TSENA_BITS 0x00000002u
#define M33_ITM_TCR_TSENA_MSB 1u
#define M33_ITM_TCR_TSENA_LSB 1u
#define M33_ITM_TCR_TSENA_ACCESS "RW"
#define M33_ITM_TCR_ITMENA_RESET 0x0u
#define M33_ITM_TCR_ITMENA_BITS 0x00000001u
#define M33_ITM_TCR_ITMENA_MSB 0u
#define M33_ITM_TCR_ITMENA_LSB 0u
#define M33_ITM_TCR_ITMENA_ACCESS "RW"
#define M33_INT_ATREADY_OFFSET 0x00000ef0u
#define M33_INT_ATREADY_BITS 0x00000003u
#define M33_INT_ATREADY_RESET 0x00000000u
#define M33_INT_ATREADY_AFVALID_RESET 0x0u
#define M33_INT_ATREADY_AFVALID_BITS 0x00000002u
#define M33_INT_ATREADY_AFVALID_MSB 1u
#define M33_INT_ATREADY_AFVALID_LSB 1u
#define M33_INT_ATREADY_AFVALID_ACCESS "RO"
#define M33_INT_ATREADY_ATREADY_RESET 0x0u
#define M33_INT_ATREADY_ATREADY_BITS 0x00000001u
#define M33_INT_ATREADY_ATREADY_MSB 0u
#define M33_INT_ATREADY_ATREADY_LSB 0u
#define M33_INT_ATREADY_ATREADY_ACCESS "RO"
#define M33_INT_ATVALID_OFFSET 0x00000ef8u
#define M33_INT_ATVALID_BITS 0x00000003u
#define M33_INT_ATVALID_RESET 0x00000000u
#define M33_INT_ATVALID_AFREADY_RESET 0x0u
#define M33_INT_ATVALID_AFREADY_BITS 0x00000002u
#define M33_INT_ATVALID_AFREADY_MSB 1u
#define M33_INT_ATVALID_AFREADY_LSB 1u
#define M33_INT_ATVALID_AFREADY_ACCESS "RW"
#define M33_INT_ATVALID_ATREADY_RESET 0x0u
#define M33_INT_ATVALID_ATREADY_BITS 0x00000001u
#define M33_INT_ATVALID_ATREADY_MSB 0u
#define M33_INT_ATVALID_ATREADY_LSB 0u
#define M33_INT_ATVALID_ATREADY_ACCESS "RW"
#define M33_ITM_ITCTRL_OFFSET 0x00000f00u
#define M33_ITM_ITCTRL_BITS 0x00000001u
#define M33_ITM_ITCTRL_RESET 0x00000000u
#define M33_ITM_ITCTRL_IME_RESET 0x0u
#define M33_ITM_ITCTRL_IME_BITS 0x00000001u
#define M33_ITM_ITCTRL_IME_MSB 0u
#define M33_ITM_ITCTRL_IME_LSB 0u
#define M33_ITM_ITCTRL_IME_ACCESS "RW"
#define M33_ITM_DEVARCH_OFFSET 0x00000fbcu
#define M33_ITM_DEVARCH_BITS 0xffffffffu
#define M33_ITM_DEVARCH_RESET 0x47701a01u
#define M33_ITM_DEVARCH_ARCHITECT_RESET 0x23bu
#define M33_ITM_DEVARCH_ARCHITECT_BITS 0xffe00000u
#define M33_ITM_DEVARCH_ARCHITECT_MSB 31u
#define M33_ITM_DEVARCH_ARCHITECT_LSB 21u
#define M33_ITM_DEVARCH_ARCHITECT_ACCESS "RO"
#define M33_ITM_DEVARCH_PRESENT_RESET 0x1u
#define M33_ITM_DEVARCH_PRESENT_BITS 0x00100000u
#define M33_ITM_DEVARCH_PRESENT_MSB 20u
#define M33_ITM_DEVARCH_PRESENT_LSB 20u
#define M33_ITM_DEVARCH_PRESENT_ACCESS "RO"
#define M33_ITM_DEVARCH_REVISION_RESET 0x0u
#define M33_ITM_DEVARCH_REVISION_BITS 0x000f0000u
#define M33_ITM_DEVARCH_REVISION_MSB 19u
#define M33_ITM_DEVARCH_REVISION_LSB 16u
#define M33_ITM_DEVARCH_REVISION_ACCESS "RO"
#define M33_ITM_DEVARCH_ARCHVER_RESET 0x1u
#define M33_ITM_DEVARCH_ARCHVER_BITS 0x0000f000u
#define M33_ITM_DEVARCH_ARCHVER_MSB 15u
#define M33_ITM_DEVARCH_ARCHVER_LSB 12u
#define M33_ITM_DEVARCH_ARCHVER_ACCESS "RO"
#define M33_ITM_DEVARCH_ARCHPART_RESET 0xa01u
#define M33_ITM_DEVARCH_ARCHPART_BITS 0x00000fffu
#define M33_ITM_DEVARCH_ARCHPART_MSB 11u
#define M33_ITM_DEVARCH_ARCHPART_LSB 0u
#define M33_ITM_DEVARCH_ARCHPART_ACCESS "RO"
#define M33_ITM_DEVTYPE_OFFSET 0x00000fccu
#define M33_ITM_DEVTYPE_BITS 0x000000ffu
#define M33_ITM_DEVTYPE_RESET 0x00000043u
#define M33_ITM_DEVTYPE_SUB_RESET 0x4u
#define M33_ITM_DEVTYPE_SUB_BITS 0x000000f0u
#define M33_ITM_DEVTYPE_SUB_MSB 7u
#define M33_ITM_DEVTYPE_SUB_LSB 4u
#define M33_ITM_DEVTYPE_SUB_ACCESS "RO"
#define M33_ITM_DEVTYPE_MAJOR_RESET 0x3u
#define M33_ITM_DEVTYPE_MAJOR_BITS 0x0000000fu
#define M33_ITM_DEVTYPE_MAJOR_MSB 3u
#define M33_ITM_DEVTYPE_MAJOR_LSB 0u
#define M33_ITM_DEVTYPE_MAJOR_ACCESS "RO"
#define M33_ITM_PIDR4_OFFSET 0x00000fd0u
#define M33_ITM_PIDR4_BITS 0x000000ffu
#define M33_ITM_PIDR4_RESET 0x00000004u
#define M33_ITM_PIDR4_SIZE_RESET 0x0u
#define M33_ITM_PIDR4_SIZE_BITS 0x000000f0u
#define M33_ITM_PIDR4_SIZE_MSB 7u
#define M33_ITM_PIDR4_SIZE_LSB 4u
#define M33_ITM_PIDR4_SIZE_ACCESS "RO"
#define M33_ITM_PIDR4_DES_2_RESET 0x4u
#define M33_ITM_PIDR4_DES_2_BITS 0x0000000fu
#define M33_ITM_PIDR4_DES_2_MSB 3u
#define M33_ITM_PIDR4_DES_2_LSB 0u
#define M33_ITM_PIDR4_DES_2_ACCESS "RO"
#define M33_ITM_PIDR5_OFFSET 0x00000fd4u
#define M33_ITM_PIDR5_BITS 0x00000000u
#define M33_ITM_PIDR5_RESET 0x00000000u
#define M33_ITM_PIDR5_MSB 31u
#define M33_ITM_PIDR5_LSB 0u
#define M33_ITM_PIDR5_ACCESS "RW"
#define M33_ITM_PIDR6_OFFSET 0x00000fd8u
#define M33_ITM_PIDR6_BITS 0x00000000u
#define M33_ITM_PIDR6_RESET 0x00000000u
#define M33_ITM_PIDR6_MSB 31u
#define M33_ITM_PIDR6_LSB 0u
#define M33_ITM_PIDR6_ACCESS "RW"
#define M33_ITM_PIDR7_OFFSET 0x00000fdcu
#define M33_ITM_PIDR7_BITS 0x00000000u
#define M33_ITM_PIDR7_RESET 0x00000000u
#define M33_ITM_PIDR7_MSB 31u
#define M33_ITM_PIDR7_LSB 0u
#define M33_ITM_PIDR7_ACCESS "RW"
#define M33_ITM_PIDR0_OFFSET 0x00000fe0u
#define M33_ITM_PIDR0_BITS 0x000000ffu
#define M33_ITM_PIDR0_RESET 0x00000021u
#define M33_ITM_PIDR0_PART_0_RESET 0x21u
#define M33_ITM_PIDR0_PART_0_BITS 0x000000ffu
#define M33_ITM_PIDR0_PART_0_MSB 7u
#define M33_ITM_PIDR0_PART_0_LSB 0u
#define M33_ITM_PIDR0_PART_0_ACCESS "RO"
#define M33_ITM_PIDR1_OFFSET 0x00000fe4u
#define M33_ITM_PIDR1_BITS 0x000000ffu
#define M33_ITM_PIDR1_RESET 0x000000bdu
#define M33_ITM_PIDR1_DES_0_RESET 0xbu
#define M33_ITM_PIDR1_DES_0_BITS 0x000000f0u
#define M33_ITM_PIDR1_DES_0_MSB 7u
#define M33_ITM_PIDR1_DES_0_LSB 4u
#define M33_ITM_PIDR1_DES_0_ACCESS "RO"
#define M33_ITM_PIDR1_PART_1_RESET 0xdu
#define M33_ITM_PIDR1_PART_1_BITS 0x0000000fu
#define M33_ITM_PIDR1_PART_1_MSB 3u
#define M33_ITM_PIDR1_PART_1_LSB 0u
#define M33_ITM_PIDR1_PART_1_ACCESS "RO"
#define M33_ITM_PIDR2_OFFSET 0x00000fe8u
#define M33_ITM_PIDR2_BITS 0x000000ffu
#define M33_ITM_PIDR2_RESET 0x0000000bu
#define M33_ITM_PIDR2_REVISION_RESET 0x0u
#define M33_ITM_PIDR2_REVISION_BITS 0x000000f0u
#define M33_ITM_PIDR2_REVISION_MSB 7u
#define M33_ITM_PIDR2_REVISION_LSB 4u
#define M33_ITM_PIDR2_REVISION_ACCESS "RO"
#define M33_ITM_PIDR2_JEDEC_RESET 0x1u
#define M33_ITM_PIDR2_JEDEC_BITS 0x00000008u
#define M33_ITM_PIDR2_JEDEC_MSB 3u
#define M33_ITM_PIDR2_JEDEC_LSB 3u
#define M33_ITM_PIDR2_JEDEC_ACCESS "RO"
#define M33_ITM_PIDR2_DES_1_RESET 0x3u
#define M33_ITM_PIDR2_DES_1_BITS 0x00000007u
#define M33_ITM_PIDR2_DES_1_MSB 2u
#define M33_ITM_PIDR2_DES_1_LSB 0u
#define M33_ITM_PIDR2_DES_1_ACCESS "RO"
#define M33_ITM_PIDR3_OFFSET 0x00000fecu
#define M33_ITM_PIDR3_BITS 0x000000ffu
#define M33_ITM_PIDR3_RESET 0x00000000u
#define M33_ITM_PIDR3_REVAND_RESET 0x0u
#define M33_ITM_PIDR3_REVAND_BITS 0x000000f0u
#define M33_ITM_PIDR3_REVAND_MSB 7u
#define M33_ITM_PIDR3_REVAND_LSB 4u
#define M33_ITM_PIDR3_REVAND_ACCESS "RO"
#define M33_ITM_PIDR3_CMOD_RESET 0x0u
#define M33_ITM_PIDR3_CMOD_BITS 0x0000000fu
#define M33_ITM_PIDR3_CMOD_MSB 3u
#define M33_ITM_PIDR3_CMOD_LSB 0u
#define M33_ITM_PIDR3_CMOD_ACCESS "RO"
#define M33_ITM_CIDR0_OFFSET 0x00000ff0u
#define M33_ITM_CIDR0_BITS 0x000000ffu
#define M33_ITM_CIDR0_RESET 0x0000000du
#define M33_ITM_CIDR0_PRMBL_0_RESET 0x0du
#define M33_ITM_CIDR0_PRMBL_0_BITS 0x000000ffu
#define M33_ITM_CIDR0_PRMBL_0_MSB 7u
#define M33_ITM_CIDR0_PRMBL_0_LSB 0u
#define M33_ITM_CIDR0_PRMBL_0_ACCESS "RO"
#define M33_ITM_CIDR1_OFFSET 0x00000ff4u
#define M33_ITM_CIDR1_BITS 0x000000ffu
#define M33_ITM_CIDR1_RESET 0x00000090u
#define M33_ITM_CIDR1_CLASS_RESET 0x9u
#define M33_ITM_CIDR1_CLASS_BITS 0x000000f0u
#define M33_ITM_CIDR1_CLASS_MSB 7u
#define M33_ITM_CIDR1_CLASS_LSB 4u
#define M33_ITM_CIDR1_CLASS_ACCESS "RO"
#define M33_ITM_CIDR1_PRMBL_1_RESET 0x0u
#define M33_ITM_CIDR1_PRMBL_1_BITS 0x0000000fu
#define M33_ITM_CIDR1_PRMBL_1_MSB 3u
#define M33_ITM_CIDR1_PRMBL_1_LSB 0u
#define M33_ITM_CIDR1_PRMBL_1_ACCESS "RO"
#define M33_ITM_CIDR2_OFFSET 0x00000ff8u
#define M33_ITM_CIDR2_BITS 0x000000ffu
#define M33_ITM_CIDR2_RESET 0x00000005u
#define M33_ITM_CIDR2_PRMBL_2_RESET 0x05u
#define M33_ITM_CIDR2_PRMBL_2_BITS 0x000000ffu
#define M33_ITM_CIDR2_PRMBL_2_MSB 7u
#define M33_ITM_CIDR2_PRMBL_2_LSB 0u
#define M33_ITM_CIDR2_PRMBL_2_ACCESS "RO"
#define M33_ITM_CIDR3_OFFSET 0x00000ffcu
#define M33_ITM_CIDR3_BITS 0x000000ffu
#define M33_ITM_CIDR3_RESET 0x000000b1u
#define M33_ITM_CIDR3_PRMBL_3_RESET 0xb1u
#define M33_ITM_CIDR3_PRMBL_3_BITS 0x000000ffu
#define M33_ITM_CIDR3_PRMBL_3_MSB 7u
#define M33_ITM_CIDR3_PRMBL_3_LSB 0u
#define M33_ITM_CIDR3_PRMBL_3_ACCESS "RO"
#define M33_DWT_CTRL_OFFSET 0x00001000u
#define M33_DWT_CTRL_BITS 0xffff1fffu
#define M33_DWT_CTRL_RESET 0x73741824u
#define M33_DWT_CTRL_NUMCOMP_RESET 0x7u
#define M33_DWT_CTRL_NUMCOMP_BITS 0xf0000000u
#define M33_DWT_CTRL_NUMCOMP_MSB 31u
#define M33_DWT_CTRL_NUMCOMP_LSB 28u
#define M33_DWT_CTRL_NUMCOMP_ACCESS "RO"
#define M33_DWT_CTRL_NOTRCPKT_RESET 0x0u
#define M33_DWT_CTRL_NOTRCPKT_BITS 0x08000000u
#define M33_DWT_CTRL_NOTRCPKT_MSB 27u
#define M33_DWT_CTRL_NOTRCPKT_LSB 27u
#define M33_DWT_CTRL_NOTRCPKT_ACCESS "RO"
#define M33_DWT_CTRL_NOEXTTRIG_RESET 0x0u
#define M33_DWT_CTRL_NOEXTTRIG_BITS 0x04000000u
#define M33_DWT_CTRL_NOEXTTRIG_MSB 26u
#define M33_DWT_CTRL_NOEXTTRIG_LSB 26u
#define M33_DWT_CTRL_NOEXTTRIG_ACCESS "RO"
#define M33_DWT_CTRL_NOCYCCNT_RESET 0x1u
#define M33_DWT_CTRL_NOCYCCNT_BITS 0x02000000u
#define M33_DWT_CTRL_NOCYCCNT_MSB 25u
#define M33_DWT_CTRL_NOCYCCNT_LSB 25u
#define M33_DWT_CTRL_NOCYCCNT_ACCESS "RO"
#define M33_DWT_CTRL_NOPRFCNT_RESET 0x1u
#define M33_DWT_CTRL_NOPRFCNT_BITS 0x01000000u
#define M33_DWT_CTRL_NOPRFCNT_MSB 24u
#define M33_DWT_CTRL_NOPRFCNT_LSB 24u
#define M33_DWT_CTRL_NOPRFCNT_ACCESS "RO"
#define M33_DWT_CTRL_CYCDISS_RESET 0x0u
#define M33_DWT_CTRL_CYCDISS_BITS 0x00800000u
#define M33_DWT_CTRL_CYCDISS_MSB 23u
