gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define M33_DWT_CTRL_CYCDISS_LSB 23u
#define M33_DWT_CTRL_CYCDISS_ACCESS "RW"
#define M33_DWT_CTRL_CYCEVTENA_RESET 0x1u
#define M33_DWT_CTRL_CYCEVTENA_BITS 0x00400000u
#define M33_DWT_CTRL_CYCEVTENA_MSB 22u
#define M33_DWT_CTRL_CYCEVTENA_LSB 22u
#define M33_DWT_CTRL_CYCEVTENA_ACCESS "RW"
#define M33_DWT_CTRL_FOLDEVTENA_RESET 0x1u
#define M33_DWT_CTRL_FOLDEVTENA_BITS 0x00200000u
#define M33_DWT_CTRL_FOLDEVTENA_MSB 21u
#define M33_DWT_CTRL_FOLDEVTENA_LSB 21u
#define M33_DWT_CTRL_FOLDEVTENA_ACCESS "RW"
#define M33_DWT_CTRL_LSUEVTENA_RESET 0x1u
#define M33_DWT_CTRL_LSUEVTENA_BITS 0x00100000u
#define M33_DWT_CTRL_LSUEVTENA_MSB 20u
#define M33_DWT_CTRL_LSUEVTENA_LSB 20u
#define M33_DWT_CTRL_LSUEVTENA_ACCESS "RW"
#define M33_DWT_CTRL_SLEEPEVTENA_RESET 0x0u
#define M33_DWT_CTRL_SLEEPEVTENA_BITS 0x00080000u
#define M33_DWT_CTRL_SLEEPEVTENA_MSB 19u
#define M33_DWT_CTRL_SLEEPEVTENA_LSB 19u
#define M33_DWT_CTRL_SLEEPEVTENA_ACCESS "RW"
#define M33_DWT_CTRL_EXCEVTENA_RESET 0x1u
#define M33_DWT_CTRL_EXCEVTENA_BITS 0x00040000u
#define M33_DWT_CTRL_EXCEVTENA_MSB 18u
#define M33_DWT_CTRL_EXCEVTENA_LSB 18u
#define M33_DWT_CTRL_EXCEVTENA_ACCESS "RW"
#define M33_DWT_CTRL_CPIEVTENA_RESET 0x0u
#define M33_DWT_CTRL_CPIEVTENA_BITS 0x00020000u
#define M33_DWT_CTRL_CPIEVTENA_MSB 17u
#define M33_DWT_CTRL_CPIEVTENA_LSB 17u
#define M33_DWT_CTRL_CPIEVTENA_ACCESS "RW"
#define M33_DWT_CTRL_EXTTRCENA_RESET 0x0u
#define M33_DWT_CTRL_EXTTRCENA_BITS 0x00010000u
#define M33_DWT_CTRL_EXTTRCENA_MSB 16u
#define M33_DWT_CTRL_EXTTRCENA_LSB 16u
#define M33_DWT_CTRL_EXTTRCENA_ACCESS "RW"
#define M33_DWT_CTRL_PCSAMPLENA_RESET 0x1u
#define M33_DWT_CTRL_PCSAMPLENA_BITS 0x00001000u
#define M33_DWT_CTRL_PCSAMPLENA_MSB 12u
#define M33_DWT_CTRL_PCSAMPLENA_LSB 12u
#define M33_DWT_CTRL_PCSAMPLENA_ACCESS "RW"
#define M33_DWT_CTRL_SYNCTAP_RESET 0x2u
#define M33_DWT_CTRL_SYNCTAP_BITS 0x00000c00u
#define M33_DWT_CTRL_SYNCTAP_MSB 11u
#define M33_DWT_CTRL_SYNCTAP_LSB 10u
#define M33_DWT_CTRL_SYNCTAP_ACCESS "RW"
#define M33_DWT_CTRL_CYCTAP_RESET 0x0u
#define M33_DWT_CTRL_CYCTAP_BITS 0x00000200u
#define M33_DWT_CTRL_CYCTAP_MSB 9u
#define M33_DWT_CTRL_CYCTAP_LSB 9u
#define M33_DWT_CTRL_CYCTAP_ACCESS "RW"
#define M33_DWT_CTRL_POSTINIT_RESET 0x1u
#define M33_DWT_CTRL_POSTINIT_BITS 0x000001e0u
#define M33_DWT_CTRL_POSTINIT_MSB 8u
#define M33_DWT_CTRL_POSTINIT_LSB 5u
#define M33_DWT_CTRL_POSTINIT_ACCESS "RW"
#define M33_DWT_CTRL_POSTPRESET_RESET 0x2u
#define M33_DWT_CTRL_POSTPRESET_BITS 0x0000001eu
#define M33_DWT_CTRL_POSTPRESET_MSB 4u
#define M33_DWT_CTRL_POSTPRESET_LSB 1u
#define M33_DWT_CTRL_POSTPRESET_ACCESS "RW"
#define M33_DWT_CTRL_CYCCNTENA_RESET 0x0u
#define M33_DWT_CTRL_CYCCNTENA_BITS 0x00000001u
#define M33_DWT_CTRL_CYCCNTENA_MSB 0u
#define M33_DWT_CTRL_CYCCNTENA_LSB 0u
#define M33_DWT_CTRL_CYCCNTENA_ACCESS "RW"
#define M33_DWT_CYCCNT_OFFSET 0x00001004u
#define M33_DWT_CYCCNT_BITS 0xffffffffu
#define M33_DWT_CYCCNT_RESET 0x00000000u
#define M33_DWT_CYCCNT_CYCCNT_RESET 0x00000000u
#define M33_DWT_CYCCNT_CYCCNT_BITS 0xffffffffu
#define M33_DWT_CYCCNT_CYCCNT_MSB 31u
#define M33_DWT_CYCCNT_CYCCNT_LSB 0u
#define M33_DWT_CYCCNT_CYCCNT_ACCESS "RW"
#define M33_DWT_EXCCNT_OFFSET 0x0000100cu
#define M33_DWT_EXCCNT_BITS 0x000000ffu
#define M33_DWT_EXCCNT_RESET 0x00000000u
#define M33_DWT_EXCCNT_EXCCNT_RESET 0x00u
#define M33_DWT_EXCCNT_EXCCNT_BITS 0x000000ffu
#define M33_DWT_EXCCNT_EXCCNT_MSB 7u
#define M33_DWT_EXCCNT_EXCCNT_LSB 0u
#define M33_DWT_EXCCNT_EXCCNT_ACCESS "RW"
#define M33_DWT_LSUCNT_OFFSET 0x00001014u
#define M33_DWT_LSUCNT_BITS 0x000000ffu
#define M33_DWT_LSUCNT_RESET 0x00000000u
#define M33_DWT_LSUCNT_LSUCNT_RESET 0x00u
#define M33_DWT_LSUCNT_LSUCNT_BITS 0x000000ffu
#define M33_DWT_LSUCNT_LSUCNT_MSB 7u
#define M33_DWT_LSUCNT_LSUCNT_LSB 0u
#define M33_DWT_LSUCNT_LSUCNT_ACCESS "RW"
#define M33_DWT_FOLDCNT_OFFSET 0x00001018u
#define M33_DWT_FOLDCNT_BITS 0x000000ffu
#define M33_DWT_FOLDCNT_RESET 0x00000000u
#define M33_DWT_FOLDCNT_FOLDCNT_RESET 0x00u
#define M33_DWT_FOLDCNT_FOLDCNT_BITS 0x000000ffu
#define M33_DWT_FOLDCNT_FOLDCNT_MSB 7u
#define M33_DWT_FOLDCNT_FOLDCNT_LSB 0u
#define M33_DWT_FOLDCNT_FOLDCNT_ACCESS "RW"
#define M33_DWT_COMP0_OFFSET 0x00001020u
#define M33_DWT_COMP0_BITS 0xffffffffu
#define M33_DWT_COMP0_RESET 0x00000000u
#define M33_DWT_COMP0_MSB 31u
#define M33_DWT_COMP0_LSB 0u
#define M33_DWT_COMP0_ACCESS "RW"
#define M33_DWT_FUNCTION0_OFFSET 0x00001028u
#define M33_DWT_FUNCTION0_BITS 0xf9000c3fu
#define M33_DWT_FUNCTION0_RESET 0x58000000u
#define M33_DWT_FUNCTION0_ID_RESET 0x0bu
#define M33_DWT_FUNCTION0_ID_BITS 0xf8000000u
#define M33_DWT_FUNCTION0_ID_MSB 31u
#define M33_DWT_FUNCTION0_ID_LSB 27u
#define M33_DWT_FUNCTION0_ID_ACCESS "RO"
#define M33_DWT_FUNCTION0_MATCHED_RESET 0x0u
#define M33_DWT_FUNCTION0_MATCHED_BITS 0x01000000u
#define M33_DWT_FUNCTION0_MATCHED_MSB 24u
#define M33_DWT_FUNCTION0_MATCHED_LSB 24u
#define M33_DWT_FUNCTION0_MATCHED_ACCESS "RO"
#define M33_DWT_FUNCTION0_DATAVSIZE_RESET 0x0u
#define M33_DWT_FUNCTION0_DATAVSIZE_BITS 0x00000c00u
#define M33_DWT_FUNCTION0_DATAVSIZE_MSB 11u
#define M33_DWT_FUNCTION0_DATAVSIZE_LSB 10u
#define M33_DWT_FUNCTION0_DATAVSIZE_ACCESS "RW"
#define M33_DWT_FUNCTION0_ACTION_RESET 0x0u
#define M33_DWT_FUNCTION0_ACTION_BITS 0x00000030u
#define M33_DWT_FUNCTION0_ACTION_MSB 5u
#define M33_DWT_FUNCTION0_ACTION_LSB 4u
#define M33_DWT_FUNCTION0_ACTION_ACCESS "RW"
#define M33_DWT_FUNCTION0_MATCH_RESET 0x0u
#define M33_DWT_FUNCTION0_MATCH_BITS 0x0000000fu
#define M33_DWT_FUNCTION0_MATCH_MSB 3u
#define M33_DWT_FUNCTION0_MATCH_LSB 0u
#define M33_DWT_FUNCTION0_MATCH_ACCESS "RW"
#define M33_DWT_COMP1_OFFSET 0x00001030u
#define M33_DWT_COMP1_BITS 0xffffffffu
#define M33_DWT_COMP1_RESET 0x00000000u
#define M33_DWT_COMP1_MSB 31u
#define M33_DWT_COMP1_LSB 0u
#define M33_DWT_COMP1_ACCESS "RW"
#define M33_DWT_FUNCTION1_OFFSET 0x00001038u
#define M33_DWT_FUNCTION1_BITS 0xf9000c3fu
#define M33_DWT_FUNCTION1_RESET 0x89000828u
#define M33_DWT_FUNCTION1_ID_RESET 0x11u
#define M33_DWT_FUNCTION1_ID_BITS 0xf8000000u
#define M33_DWT_FUNCTION1_ID_MSB 31u
#define M33_DWT_FUNCTION1_ID_LSB 27u
#define M33_DWT_FUNCTION1_ID_ACCESS "RO"
#define M33_DWT_FUNCTION1_MATCHED_RESET 0x1u
#define M33_DWT_FUNCTION1_MATCHED_BITS 0x01000000u
#define M33_DWT_FUNCTION1_MATCHED_MSB 24u
#define M33_DWT_FUNCTION1_MATCHED_LSB 24u
#define M33_DWT_FUNCTION1_MATCHED_ACCESS "RO"
#define M33_DWT_FUNCTION1_DATAVSIZE_RESET 0x2u
#define M33_DWT_FUNCTION1_DATAVSIZE_BITS 0x00000c00u
#define M33_DWT_FUNCTION1_DATAVSIZE_MSB 11u
#define M33_DWT_FUNCTION1_DATAVSIZE_LSB 10u
#define M33_DWT_FUNCTION1_DATAVSIZE_ACCESS "RW"
#define M33_DWT_FUNCTION1_ACTION_RESET 0x2u
#define M33_DWT_FUNCTION1_ACTION_BITS 0x00000030u
#define M33_DWT_FUNCTION1_ACTION_MSB 5u
#define M33_DWT_FUNCTION1_ACTION_LSB 4u
#define M33_DWT_FUNCTION1_ACTION_ACCESS "RW"
#define M33_DWT_FUNCTION1_MATCH_RESET 0x8u
#define M33_DWT_FUNCTION1_MATCH_BITS 0x0000000fu
#define M33_DWT_FUNCTION1_MATCH_MSB 3u
#define M33_DWT_FUNCTION1_MATCH_LSB 0u
#define M33_DWT_FUNCTION1_MATCH_ACCESS "RW"
#define M33_DWT_COMP2_OFFSET 0x00001040u
#define M33_DWT_COMP2_BITS 0xffffffffu
#define M33_DWT_COMP2_RESET 0x00000000u
#define M33_DWT_COMP2_MSB 31u
#define M33_DWT_COMP2_LSB 0u
#define M33_DWT_COMP2_ACCESS "RW"
#define M33_DWT_FUNCTION2_OFFSET 0x00001048u
#define M33_DWT_FUNCTION2_BITS 0xf9000c3fu
#define M33_DWT_FUNCTION2_RESET 0x50000000u
#define M33_DWT_FUNCTION2_ID_RESET 0x0au
#define M33_DWT_FUNCTION2_ID_BITS 0xf8000000u
#define M33_DWT_FUNCTION2_ID_MSB 31u
#define M33_DWT_FUNCTION2_ID_LSB 27u
#define M33_DWT_FUNCTION2_ID_ACCESS "RO"
#define M33_DWT_FUNCTION2_MATCHED_RESET 0x0u
#define M33_DWT_FUNCTION2_MATCHED_BITS 0x01000000u
#define M33_DWT_FUNCTION2_MATCHED_MSB 24u
#define M33_DWT_FUNCTION2_MATCHED_LSB 24u
#define M33_DWT_FUNCTION2_MATCHED_ACCESS "RO"
#define M33_DWT_FUNCTION2_DATAVSIZE_RESET 0x0u
#define M33_DWT_FUNCTION2_DATAVSIZE_BITS 0x00000c00u
#define M33_DWT_FUNCTION2_DATAVSIZE_MSB 11u
#define M33_DWT_FUNCTION2_DATAVSIZE_LSB 10u
#define M33_DWT_FUNCTION2_DATAVSIZE_ACCESS "RW"
#define M33_DWT_FUNCTION2_ACTION_RESET 0x0u
#define M33_DWT_FUNCTION2_ACTION_BITS 0x00000030u
#define M33_DWT_FUNCTION2_ACTION_MSB 5u
#define M33_DWT_FUNCTION2_ACTION_LSB 4u
#define M33_DWT_FUNCTION2_ACTION_ACCESS "RW"
#define M33_DWT_FUNCTION2_MATCH_RESET 0x0u
#define M33_DWT_FUNCTION2_MATCH_BITS 0x0000000fu
#define M33_DWT_FUNCTION2_MATCH_MSB 3u
#define M33_DWT_FUNCTION2_MATCH_LSB 0u
#define M33_DWT_FUNCTION2_MATCH_ACCESS "RW"
#define M33_DWT_COMP3_OFFSET 0x00001050u
#define M33_DWT_COMP3_BITS 0xffffffffu
#define M33_DWT_COMP3_RESET 0x00000000u
#define M33_DWT_COMP3_MSB 31u
#define M33_DWT_COMP3_LSB 0u
#define M33_DWT_COMP3_ACCESS "RW"
#define M33_DWT_FUNCTION3_OFFSET 0x00001058u
#define M33_DWT_FUNCTION3_BITS 0xf9000c3fu
#define M33_DWT_FUNCTION3_RESET 0x20000800u
#define M33_DWT_FUNCTION3_ID_RESET 0x04u
#define M33_DWT_FUNCTION3_ID_BITS 0xf8000000u
#define M33_DWT_FUNCTION3_ID_MSB 31u
#define M33_DWT_FUNCTION3_ID_LSB 27u
#define M33_DWT_FUNCTION3_ID_ACCESS "RO"
#define M33_DWT_FUNCTION3_MATCHED_RESET 0x0u
#define M33_DWT_FUNCTION3_MATCHED_BITS 0x01000000u
#define M33_DWT_FUNCTION3_MATCHED_MSB 24u
#define M33_DWT_FUNCTION3_MATCHED_LSB 24u
#define M33_DWT_FUNCTION3_MATCHED_ACCESS "RO"
#define M33_DWT_FUNCTION3_DATAVSIZE_RESET 0x2u
#define M33_DWT_FUNCTION3_DATAVSIZE_BITS 0x00000c00u
#define M33_DWT_FUNCTION3_DATAVSIZE_MSB 11u
#define M33_DWT_FUNCTION3_DATAVSIZE_LSB 10u
#define M33_DWT_FUNCTION3_DATAVSIZE_ACCESS "RW"
#define M33_DWT_FUNCTION3_ACTION_RESET 0x0u
#define M33_DWT_FUNCTION3_ACTION_BITS 0x00000030u
#define M33_DWT_FUNCTION3_ACTION_MSB 5u
#define M33_DWT_FUNCTION3_ACTION_LSB 4u
#define M33_DWT_FUNCTION3_ACTION_ACCESS "RW"
#define M33_DWT_FUNCTION3_MATCH_RESET 0x0u
#define M33_DWT_FUNCTION3_MATCH_BITS 0x0000000fu
#define M33_DWT_FUNCTION3_MATCH_MSB 3u
#define M33_DWT_FUNCTION3_MATCH_LSB 0u
#define M33_DWT_FUNCTION3_MATCH_ACCESS "RW"
#define M33_DWT_DEVARCH_OFFSET 0x00001fbcu
#define M33_DWT_DEVARCH_BITS 0xffffffffu
#define M33_DWT_DEVARCH_RESET 0x47701a02u
#define M33_DWT_DEVARCH_ARCHITECT_RESET 0x23bu
#define M33_DWT_DEVARCH_ARCHITECT_BITS 0xffe00000u
#define M33_DWT_DEVARCH_ARCHITECT_MSB 31u
#define M33_DWT_DEVARCH_ARCHITECT_LSB 21u
#define M33_DWT_DEVARCH_ARCHITECT_ACCESS "RO"
#define M33_DWT_DEVARCH_PRESENT_RESET 0x1u
#define M33_DWT_DEVARCH_PRESENT_BITS 0x00100000u
#define M33_DWT_DEVARCH_PRESENT_MSB 20u
#define M33_DWT_DEVARCH_PRESENT_LSB 20u
#define M33_DWT_DEVARCH_PRESENT_ACCESS "RO"
#define M33_DWT_DEVARCH_REVISION_RESET 0x0u
#define M33_DWT_DEVARCH_REVISION_BITS 0x000f0000u
#define M33_DWT_DEVARCH_REVISION_MSB 19u
#define M33_DWT_DEVARCH_REVISION_LSB 16u
#define M33_DWT_DEVARCH_REVISION_ACCESS "RO"
#define M33_DWT_DEVARCH_ARCHVER_RESET 0x1u
#define M33_DWT_DEVARCH_ARCHVER_BITS 0x0000f000u
#define M33_DWT_DEVARCH_ARCHVER_MSB 15u
#define M33_DWT_DEVARCH_ARCHVER_LSB 12u
#define M33_DWT_DEVARCH_ARCHVER_ACCESS "RO"
#define M33_DWT_DEVARCH_ARCHPART_RESET 0xa02u
#define M33_DWT_DEVARCH_ARCHPART_BITS 0x00000fffu
#define M33_DWT_DEVARCH_ARCHPART_MSB 11u
#define M33_DWT_DEVARCH_ARCHPART_LSB 0u
#define M33_DWT_DEVARCH_ARCHPART_ACCESS "RO"
#define M33_DWT_DEVTYPE_OFFSET 0x00001fccu
#define M33_DWT_DEVTYPE_BITS 0x000000ffu
#define M33_DWT_DEVTYPE_RESET 0x00000000u
#define M33_DWT_DEVTYPE_SUB_RESET 0x0u
#define M33_DWT_DEVTYPE_SUB_BITS 0x000000f0u
#define M33_DWT_DEVTYPE_SUB_MSB 7u
#define M33_DWT_DEVTYPE_SUB_LSB 4u
#define M33_DWT_DEVTYPE_SUB_ACCESS "RO"
#define M33_DWT_DEVTYPE_MAJOR_RESET 0x0u
#define M33_DWT_DEVTYPE_MAJOR_BITS 0x0000000fu
#define M33_DWT_DEVTYPE_MAJOR_MSB 3u
#define M33_DWT_DEVTYPE_MAJOR_LSB 0u
#define M33_DWT_DEVTYPE_MAJOR_ACCESS "RO"
#define M33_DWT_PIDR4_OFFSET 0x00001fd0u
#define M33_DWT_PIDR4_BITS 0x000000ffu
#define M33_DWT_PIDR4_RESET 0x00000004u
#define M33_DWT_PIDR4_SIZE_RESET 0x0u
#define M33_DWT_PIDR4_SIZE_BITS 0x000000f0u
#define M33_DWT_PIDR4_SIZE_MSB 7u
#define M33_DWT_PIDR4_SIZE_LSB 4u
#define M33_DWT_PIDR4_SIZE_ACCESS "RO"
#define M33_DWT_PIDR4_DES_2_RESET 0x4u
#define M33_DWT_PIDR4_DES_2_BITS 0x0000000fu
#define M33_DWT_PIDR4_DES_2_MSB 3u
#define M33_DWT_PIDR4_DES_2_LSB 0u
#define M33_DWT_PIDR4_DES_2_ACCESS "RO"
#define M33_DWT_PIDR5_OFFSET 0x00001fd4u
#define M33_DWT_PIDR5_BITS 0x00000000u
#define M33_DWT_PIDR5_RESET 0x00000000u
#define M33_DWT_PIDR5_MSB 31u
#define M33_DWT_PIDR5_LSB 0u
#define M33_DWT_PIDR5_ACCESS "RW"
#define M33_DWT_PIDR6_OFFSET 0x00001fd8u
#define M33_DWT_PIDR6_BITS 0x00000000u
#define M33_DWT_PIDR6_RESET 0x00000000u
#define M33_DWT_PIDR6_MSB 31u
#define M33_DWT_PIDR6_LSB 0u
#define M33_DWT_PIDR6_ACCESS "RW"
#define M33_DWT_PIDR7_OFFSET 0x00001fdcu
#define M33_DWT_PIDR7_BITS 0x00000000u
#define M33_DWT_PIDR7_RESET 0x00000000u
#define M33_DWT_PIDR7_MSB 31u
#define M33_DWT_PIDR7_LSB 0u
#define M33_DWT_PIDR7_ACCESS "RW"
#define M33_DWT_PIDR0_OFFSET 0x00001fe0u
#define M33_DWT_PIDR0_BITS 0x000000ffu
#define M33_DWT_PIDR0_RESET 0x00000021u
#define M33_DWT_PIDR0_PART_0_RESET 0x21u
#define M33_DWT_PIDR0_PART_0_BITS 0x000000ffu
#define M33_DWT_PIDR0_PART_0_MSB 7u
#define M33_DWT_PIDR0_PART_0_LSB 0u
#define M33_DWT_PIDR0_PART_0_ACCESS "RO"
#define M33_DWT_PIDR1_OFFSET 0x00001fe4u
#define M33_DWT_PIDR1_BITS 0x000000ffu
#define M33_DWT_PIDR1_RESET 0x000000bdu
#define M33_DWT_PIDR1_DES_0_RESET 0xbu
#define M33_DWT_PIDR1_DES_0_BITS 0x000000f0u
#define M33_DWT_PIDR1_DES_0_MSB 7u
#define M33_DWT_PIDR1_DES_0_LSB 4u
#define M33_DWT_PIDR1_DES_0_ACCESS "RO"
#define M33_DWT_PIDR1_PART_1_RESET 0xdu
#define M33_DWT_PIDR1_PART_1_BITS 0x0000000fu
#define M33_DWT_PIDR1_PART_1_MSB 3u
#define M33_DWT_PIDR1_PART_1_LSB 0u
#define M33_DWT_PIDR1_PART_1_ACCESS "RO"
#define M33_DWT_PIDR2_OFFSET 0x00001fe8u
#define M33_DWT_PIDR2_BITS 0x000000ffu
#define M33_DWT_PIDR2_RESET 0x0000000bu
#define M33_DWT_PIDR2_REVISION_RESET 0x0u
#define M33_DWT_PIDR2_REVISION_BITS 0x000000f0u
#define M33_DWT_PIDR2_REVISION_MSB 7u
#define M33_DWT_PIDR2_REVISION_LSB 4u
#define M33_DWT_PIDR2_REVISION_ACCESS "RO"
#define M33_DWT_PIDR2_JEDEC_RESET 0x1u
#define M33_DWT_PIDR2_JEDEC_BITS 0x00000008u
#define M33_DWT_PIDR2_JEDEC_MSB 3u
#define M33_DWT_PIDR2_JEDEC_LSB 3u
#define M33_DWT_PIDR2_JEDEC_ACCESS "RO"
#define M33_DWT_PIDR2_DES_1_RESET 0x3u
#define M33_DWT_PIDR2_DES_1_BITS 0x00000007u
#define M33_DWT_PIDR2_DES_1_MSB 2u
#define M33_DWT_PIDR2_DES_1_LSB 0u
#define M33_DWT_PIDR2_DES_1_ACCESS "RO"
#define M33_DWT_PIDR3_OFFSET 0x00001fecu
#define M33_DWT_PIDR3_BITS 0x000000ffu
#define M33_DWT_PIDR3_RESET 0x00000000u
#define M33_DWT_PIDR3_REVAND_RESET 0x0u
#define M33_DWT_PIDR3_REVAND_BITS 0x000000f0u
#define M33_DWT_PIDR3_REVAND_MSB 7u
#define M33_DWT_PIDR3_REVAND_LSB 4u
#define M33_DWT_PIDR3_REVAND_ACCESS "RO"
#define M33_DWT_PIDR3_CMOD_RESET 0x0u
#define M33_DWT_PIDR3_CMOD_BITS 0x0000000fu
#define M33_DWT_PIDR3_CMOD_MSB 3u
#define M33_DWT_PIDR3_CMOD_LSB 0u
#define M33_DWT_PIDR3_CMOD_ACCESS "RO"
#define M33_DWT_CIDR0_OFFSET 0x00001ff0u
#define M33_DWT_CIDR0_BITS 0x000000ffu
#define M33_DWT_CIDR0_RESET 0x0000000du
#define M33_DWT_CIDR0_PRMBL_0_RESET 0x0du
#define M33_DWT_CIDR0_PRMBL_0_BITS 0x000000ffu
#define M33_DWT_CIDR0_PRMBL_0_MSB 7u
#define M33_DWT_CIDR0_PRMBL_0_LSB 0u
#define M33_DWT_CIDR0_PRMBL_0_ACCESS "RO"
#define M33_DWT_CIDR1_OFFSET 0x00001ff4u
#define M33_DWT_CIDR1_BITS 0x000000ffu
#define M33_DWT_CIDR1_RESET 0x00000090u
#define M33_DWT_CIDR1_CLASS_RESET 0x9u
#define M33_DWT_CIDR1_CLASS_BITS 0x000000f0u
#define M33_DWT_CIDR1_CLASS_MSB 7u
#define M33_DWT_CIDR1_CLASS_LSB 4u
#define M33_DWT_CIDR1_CLASS_ACCESS "RO"
#define M33_DWT_CIDR1_PRMBL_1_RESET 0x0u
#define M33_DWT_CIDR1_PRMBL_1_BITS 0x0000000fu
#define M33_DWT_CIDR1_PRMBL_1_MSB 3u
#define M33_DWT_CIDR1_PRMBL_1_LSB 0u
#define M33_DWT_CIDR1_PRMBL_1_ACCESS "RO"
#define M33_DWT_CIDR2_OFFSET 0x00001ff8u
#define M33_DWT_CIDR2_BITS 0x000000ffu
#define M33_DWT_CIDR2_RESET 0x00000005u
#define M33_DWT_CIDR2_PRMBL_2_RESET 0x05u
#define M33_DWT_CIDR2_PRMBL_2_BITS 0x000000ffu
#define M33_DWT_CIDR2_PRMBL_2_MSB 7u
#define M33_DWT_CIDR2_PRMBL_2_LSB 0u
#define M33_DWT_CIDR2_PRMBL_2_ACCESS "RO"
#define M33_DWT_CIDR3_OFFSET 0x00001ffcu
#define M33_DWT_CIDR3_BITS 0x000000ffu
#define M33_DWT_CIDR3_RESET 0x000000b1u
#define M33_DWT_CIDR3_PRMBL_3_RESET 0xb1u
#define M33_DWT_CIDR3_PRMBL_3_BITS 0x000000ffu
#define M33_DWT_CIDR3_PRMBL_3_MSB 7u
#define M33_DWT_CIDR3_PRMBL_3_LSB 0u
#define M33_DWT_CIDR3_PRMBL_3_ACCESS "RO"
#define M33_FP_CTRL_OFFSET 0x00002000u
#define M33_FP_CTRL_BITS 0xf0007ff3u
#define M33_FP_CTRL_RESET 0x60005580u
#define M33_FP_CTRL_REV_RESET 0x6u
#define M33_FP_CTRL_REV_BITS 0xf0000000u
#define M33_FP_CTRL_REV_MSB 31u
#define M33_FP_CTRL_REV_LSB 28u
#define M33_FP_CTRL_REV_ACCESS "RO"
#define M33_FP_CTRL_NUM_CODE_14_12__RESET 0x5u
#define M33_FP_CTRL_NUM_CODE_14_12__BITS 0x00007000u
#define M33_FP_CTRL_NUM_CODE_14_12__MSB 14u
#define M33_FP_CTRL_NUM_CODE_14_12__LSB 12u
#define M33_FP_CTRL_NUM_CODE_14_12__ACCESS "RO"
#define M33_FP_CTRL_NUM_LIT_RESET 0x5u
#define M33_FP_CTRL_NUM_LIT_BITS 0x00000f00u
#define M33_FP_CTRL_NUM_LIT_MSB 11u
#define M33_FP_CTRL_NUM_LIT_LSB 8u
#define M33_FP_CTRL_NUM_LIT_ACCESS "RO"
#define M33_FP_CTRL_NUM_CODE_7_4__RESET 0x8u
#define M33_FP_CTRL_NUM_CODE_7_4__BITS 0x000000f0u
#define M33_FP_CTRL_NUM_CODE_7_4__MSB 7u
#define M33_FP_CTRL_NUM_CODE_7_4__LSB 4u
#define M33_FP_CTRL_NUM_CODE_7_4__ACCESS "RO"
#define M33_FP_CTRL_KEY_RESET 0x0u
#define M33_FP_CTRL_KEY_BITS 0x00000002u
#define M33_FP_CTRL_KEY_MSB 1u
#define M33_FP_CTRL_KEY_LSB 1u
#define M33_FP_CTRL_KEY_ACCESS "RW"
#define M33_FP_CTRL_ENABLE_RESET 0x0u
#define M33_FP_CTRL_ENABLE_BITS 0x00000001u
#define M33_FP_CTRL_ENABLE_MSB 0u
#define M33_FP_CTRL_ENABLE_LSB 0u
#define M33_FP_CTRL_ENABLE_ACCESS "RW"
#define M33_FP_REMAP_OFFSET 0x00002004u
#define M33_FP_REMAP_BITS 0x3fffffe0u
#define M33_FP_REMAP_RESET 0x00000000u
#define M33_FP_REMAP_RMPSPT_RESET 0x0u
#define M33_FP_REMAP_RMPSPT_BITS 0x20000000u
#define M33_FP_REMAP_RMPSPT_MSB 29u
#define M33_FP_REMAP_RMPSPT_LSB 29u
#define M33_FP_REMAP_RMPSPT_ACCESS "RO"
#define M33_FP_REMAP_REMAP_RESET 0x000000u
#define M33_FP_REMAP_REMAP_BITS 0x1fffffe0u
#define M33_FP_REMAP_REMAP_MSB 28u
#define M33_FP_REMAP_REMAP_LSB 5u
#define M33_FP_REMAP_REMAP_ACCESS "RO"
#define M33_FP_COMP0_OFFSET 0x00002008u
#define M33_FP_COMP0_BITS 0x00000001u
#define M33_FP_COMP0_RESET 0x00000000u
#define M33_FP_COMP0_BE_RESET 0x0u
#define M33_FP_COMP0_BE_BITS 0x00000001u
#define M33_FP_COMP0_BE_MSB 0u
#define M33_FP_COMP0_BE_LSB 0u
#define M33_FP_COMP0_BE_ACCESS "RW"
#define M33_FP_COMP1_OFFSET 0x0000200cu
#define M33_FP_COMP1_BITS 0x00000001u
#define M33_FP_COMP1_RESET 0x00000000u
#define M33_FP_COMP1_BE_RESET 0x0u
#define M33_FP_COMP1_BE_BITS 0x00000001u
#define M33_FP_COMP1_BE_MSB 0u
#define M33_FP_COMP1_BE_LSB 0u
#define M33_FP_COMP1_BE_ACCESS "RW"
#define M33_FP_COMP2_OFFSET 0x00002010u
#define M33_FP_COMP2_BITS 0x00000001u
#define M33_FP_COMP2_RESET 0x00000000u
#define M33_FP_COMP2_BE_RESET 0x0u
#define M33_FP_COMP2_BE_BITS 0x00000001u
#define M33_FP_COMP2_BE_MSB 0u
#define M33_FP_COMP2_BE_LSB 0u
#define M33_FP_COMP2_BE_ACCESS "RW"
#define M33_FP_COMP3_OFFSET 0x00002014u
#define M33_FP_COMP3_BITS 0x00000001u
#define M33_FP_COMP3_RESET 0x00000000u
#define M33_FP_COMP3_BE_RESET 0x0u
#define M33_FP_COMP3_BE_BITS 0x00000001u
#define M33_FP_COMP3_BE_MSB 0u
#define M33_FP_COMP3_BE_LSB 0u
#define M33_FP_COMP3_BE_ACCESS "RW"
#define M33_FP_COMP4_OFFSET 0x00002018u
#define M33_FP_COMP4_BITS 0x00000001u
#define M33_FP_COMP4_RESET 0x00000000u
#define M33_FP_COMP4_BE_RESET 0x0u
#define M33_FP_COMP4_BE_BITS 0x00000001u
#define M33_FP_COMP4_BE_MSB 0u
#define M33_FP_COMP4_BE_LSB 0u
#define M33_FP_COMP4_BE_ACCESS "RW"
#define M33_FP_COMP5_OFFSET 0x0000201cu
#define M33_FP_COMP5_BITS 0x00000001u
#define M33_FP_COMP5_RESET 0x00000000u
#define M33_FP_COMP5_BE_RESET 0x0u
#define M33_FP_COMP5_BE_BITS 0x00000001u
#define M33_FP_COMP5_BE_MSB 0u
#define M33_FP_COMP5_BE_LSB 0u
#define M33_FP_COMP5_BE_ACCESS "RW"
#define M33_FP_COMP6_OFFSET 0x00002020u
#define M33_FP_COMP6_BITS 0x00000001u
#define M33_FP_COMP6_RESET 0x00000000u
#define M33_FP_COMP6_BE_RESET 0x0u
#define M33_FP_COMP6_BE_BITS 0x00000001u
#define M33_FP_COMP6_BE_MSB 0u
#define M33_FP_COMP6_BE_LSB 0u
#define M33_FP_COMP6_BE_ACCESS "RW"
#define M33_FP_COMP7_OFFSET 0x00002024u
#define M33_FP_COMP7_BITS 0x00000001u
#define M33_FP_COMP7_RESET 0x00000000u
#define M33_FP_COMP7_BE_RESET 0x0u
#define M33_FP_COMP7_BE_BITS 0x00000001u
#define M33_FP_COMP7_BE_MSB 0u
#define M33_FP_COMP7_BE_LSB 0u
#define M33_FP_COMP7_BE_ACCESS "RW"
#define M33_FP_DEVARCH_OFFSET 0x00002fbcu
#define M33_FP_DEVARCH_BITS 0xffffffffu
#define M33_FP_DEVARCH_RESET 0x47701a03u
#define M33_FP_DEVARCH_ARCHITECT_RESET 0x23bu
#define M33_FP_DEVARCH_ARCHITECT_BITS 0xffe00000u
#define M33_FP_DEVARCH_ARCHITECT_MSB 31u
#define M33_FP_DEVARCH_ARCHITECT_LSB 21u
#define M33_FP_DEVARCH_ARCHITECT_ACCESS "RO"
#define M33_FP_DEVARCH_PRESENT_RESET 0x1u
#define M33_FP_DEVARCH_PRESENT_BITS 0x00100000u
#define M33_FP_DEVARCH_PRESENT_MSB 20u
#define M33_FP_DEVARCH_PRESENT_LSB 20u
#define M33_FP_DEVARCH_PRESENT_ACCESS "RO"
#define M33_FP_DEVARCH_REVISION_RESET 0x0u
#define M33_FP_DEVARCH_REVISION_BITS 0x000f0000u
#define M33_FP_DEVARCH_REVISION_MSB 19u
#define M33_FP_DEVARCH_REVISION_LSB 16u
#define M33_FP_DEVARCH_REVISION_ACCESS "RO"
#define M33_FP_DEVARCH_ARCHVER_RESET 0x1u
#define M33_FP_DEVARCH_ARCHVER_BITS 0x0000f000u
#define M33_FP_DEVARCH_ARCHVER_MSB 15u
#define M33_FP_DEVARCH_ARCHVER_LSB 12u
#define M33_FP_DEVARCH_ARCHVER_ACCESS "RO"
#define M33_FP_DEVARCH_ARCHPART_RESET 0xa03u
#define M33_FP_DEVARCH_ARCHPART_BITS 0x00000fffu
#define M33_FP_DEVARCH_ARCHPART_MSB 11u
#define M33_FP_DEVARCH_ARCHPART_LSB 0u
#define M33_FP_DEVARCH_ARCHPART_ACCESS "RO"
#define M33_FP_DEVTYPE_OFFSET 0x00002fccu
#define M33_FP_DEVTYPE_BITS 0x000000ffu
#define M33_FP_DEVTYPE_RESET 0x00000000u
#define M33_FP_DEVTYPE_SUB_RESET 0x0u
#define M33_FP_DEVTYPE_SUB_BITS 0x000000f0u
#define M33_FP_DEVTYPE_SUB_MSB 7u
#define M33_FP_DEVTYPE_SUB_LSB 4u
#define M33_FP_DEVTYPE_SUB_ACCESS "RO"
#define M33_FP_DEVTYPE_MAJOR_RESET 0x0u
#define M33_FP_DEVTYPE_MAJOR_BITS 0x0000000fu
#define M33_FP_DEVTYPE_MAJOR_MSB 3u
#define M33_FP_DEVTYPE_MAJOR_LSB 0u
#define M33_FP_DEVTYPE_MAJOR_ACCESS "RO"
#define M33_FP_PIDR4_OFFSET 0x00002fd0u
#define M33_FP_PIDR4_BITS 0x000000ffu
#define M33_FP_PIDR4_RESET 0x00000004u
#define M33_FP_PIDR4_SIZE_RESET 0x0u
#define M33_FP_PIDR4_SIZE_BITS 0x000000f0u
#define M33_FP_PIDR4_SIZE_MSB 7u
#define M33_FP_PIDR4_SIZE_LSB 4u
#define M33_FP_PIDR4_SIZE_ACCESS "RO"
#define M33_FP_PIDR4_DES_2_RESET 0x4u
#define M33_FP_PIDR4_DES_2_BITS 0x0000000fu
#define M33_FP_PIDR4_DES_2_MSB 3u
#define M33_FP_PIDR4_DES_2_LSB 0u
#define M33_FP_PIDR4_DES_2_ACCESS "RO"
#define M33_FP_PIDR5_OFFSET 0x00002fd4u
#define M33_FP_PIDR5_BITS 0x00000000u
#define M33_FP_PIDR5_RESET 0x00000000u
#define M33_FP_PIDR5_MSB 31u
#define M33_FP_PIDR5_LSB 0u
#define M33_FP_PIDR5_ACCESS "RW"
#define M33_FP_PIDR6_OFFSET 0x00002fd8u
#define M33_FP_PIDR6_BITS 0x00000000u
#define M33_FP_PIDR6_RESET 0x00000000u
#define M33_FP_PIDR6_MSB 31u
#define M33_FP_PIDR6_LSB 0u
#define M33_FP_PIDR6_ACCESS "RW"
#define M33_FP_PIDR7_OFFSET 0x00002fdcu
#define M33_FP_PIDR7_BITS 0x00000000u
#define M33_FP_PIDR7_RESET 0x00000000u
#define M33_FP_PIDR7_MSB 31u
#define M33_FP_PIDR7_LSB 0u
#define M33_FP_PIDR7_ACCESS "RW"
#define M33_FP_PIDR0_OFFSET 0x00002fe0u
#define M33_FP_PIDR0_BITS 0x000000ffu
#define M33_FP_PIDR0_RESET 0x00000021u
#define M33_FP_PIDR0_PART_0_RESET 0x21u
#define M33_FP_PIDR0_PART_0_BITS 0x000000ffu
#define M33_FP_PIDR0_PART_0_MSB 7u
#define M33_FP_PIDR0_PART_0_LSB 0u
#define M33_FP_PIDR0_PART_0_ACCESS "RO"
#define M33_FP_PIDR1_OFFSET 0x00002fe4u
#define M33_FP_PIDR1_BITS 0x000000ffu
#define M33_FP_PIDR1_RESET 0x000000bdu
#define M33_FP_PIDR1_DES_0_RESET 0xbu
#define M33_FP_PIDR1_DES_0_BITS 0x000000f0u
#define M33_FP_PIDR1_DES_0_MSB 7u
#define M33_FP_PIDR1_DES_0_LSB 4u
#define M33_FP_PIDR1_DES_0_ACCESS "RO"
#define M33_FP_PIDR1_PART_1_RESET 0xdu
