gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define M33_FP_PIDR1_PART_1_BITS 0x0000000fu
#define M33_FP_PIDR1_PART_1_MSB 3u
#define M33_FP_PIDR1_PART_1_LSB 0u
#define M33_FP_PIDR1_PART_1_ACCESS "RO"
#define M33_FP_PIDR2_OFFSET 0x00002fe8u
#define M33_FP_PIDR2_BITS 0x000000ffu
#define M33_FP_PIDR2_RESET 0x0000000bu
#define M33_FP_PIDR2_REVISION_RESET 0x0u
#define M33_FP_PIDR2_REVISION_BITS 0x000000f0u
#define M33_FP_PIDR2_REVISION_MSB 7u
#define M33_FP_PIDR2_REVISION_LSB 4u
#define M33_FP_PIDR2_REVISION_ACCESS "RO"
#define M33_FP_PIDR2_JEDEC_RESET 0x1u
#define M33_FP_PIDR2_JEDEC_BITS 0x00000008u
#define M33_FP_PIDR2_JEDEC_MSB 3u
#define M33_FP_PIDR2_JEDEC_LSB 3u
#define M33_FP_PIDR2_JEDEC_ACCESS "RO"
#define M33_FP_PIDR2_DES_1_RESET 0x3u
#define M33_FP_PIDR2_DES_1_BITS 0x00000007u
#define M33_FP_PIDR2_DES_1_MSB 2u
#define M33_FP_PIDR2_DES_1_LSB 0u
#define M33_FP_PIDR2_DES_1_ACCESS "RO"
#define M33_FP_PIDR3_OFFSET 0x00002fecu
#define M33_FP_PIDR3_BITS 0x000000ffu
#define M33_FP_PIDR3_RESET 0x00000000u
#define M33_FP_PIDR3_REVAND_RESET 0x0u
#define M33_FP_PIDR3_REVAND_BITS 0x000000f0u
#define M33_FP_PIDR3_REVAND_MSB 7u
#define M33_FP_PIDR3_REVAND_LSB 4u
#define M33_FP_PIDR3_REVAND_ACCESS "RO"
#define M33_FP_PIDR3_CMOD_RESET 0x0u
#define M33_FP_PIDR3_CMOD_BITS 0x0000000fu
#define M33_FP_PIDR3_CMOD_MSB 3u
#define M33_FP_PIDR3_CMOD_LSB 0u
#define M33_FP_PIDR3_CMOD_ACCESS "RO"
#define M33_FP_CIDR0_OFFSET 0x00002ff0u
#define M33_FP_CIDR0_BITS 0x000000ffu
#define M33_FP_CIDR0_RESET 0x0000000du
#define M33_FP_CIDR0_PRMBL_0_RESET 0x0du
#define M33_FP_CIDR0_PRMBL_0_BITS 0x000000ffu
#define M33_FP_CIDR0_PRMBL_0_MSB 7u
#define M33_FP_CIDR0_PRMBL_0_LSB 0u
#define M33_FP_CIDR0_PRMBL_0_ACCESS "RO"
#define M33_FP_CIDR1_OFFSET 0x00002ff4u
#define M33_FP_CIDR1_BITS 0x000000ffu
#define M33_FP_CIDR1_RESET 0x00000090u
#define M33_FP_CIDR1_CLASS_RESET 0x9u
#define M33_FP_CIDR1_CLASS_BITS 0x000000f0u
#define M33_FP_CIDR1_CLASS_MSB 7u
#define M33_FP_CIDR1_CLASS_LSB 4u
#define M33_FP_CIDR1_CLASS_ACCESS "RO"
#define M33_FP_CIDR1_PRMBL_1_RESET 0x0u
#define M33_FP_CIDR1_PRMBL_1_BITS 0x0000000fu
#define M33_FP_CIDR1_PRMBL_1_MSB 3u
#define M33_FP_CIDR1_PRMBL_1_LSB 0u
#define M33_FP_CIDR1_PRMBL_1_ACCESS "RO"
#define M33_FP_CIDR2_OFFSET 0x00002ff8u
#define M33_FP_CIDR2_BITS 0x000000ffu
#define M33_FP_CIDR2_RESET 0x00000005u
#define M33_FP_CIDR2_PRMBL_2_RESET 0x05u
#define M33_FP_CIDR2_PRMBL_2_BITS 0x000000ffu
#define M33_FP_CIDR2_PRMBL_2_MSB 7u
#define M33_FP_CIDR2_PRMBL_2_LSB 0u
#define M33_FP_CIDR2_PRMBL_2_ACCESS "RO"
#define M33_FP_CIDR3_OFFSET 0x00002ffcu
#define M33_FP_CIDR3_BITS 0x000000ffu
#define M33_FP_CIDR3_RESET 0x000000b1u
#define M33_FP_CIDR3_PRMBL_3_RESET 0xb1u
#define M33_FP_CIDR3_PRMBL_3_BITS 0x000000ffu
#define M33_FP_CIDR3_PRMBL_3_MSB 7u
#define M33_FP_CIDR3_PRMBL_3_LSB 0u
#define M33_FP_CIDR3_PRMBL_3_ACCESS "RO"
#define M33_ICTR_OFFSET 0x0000e004u
#define M33_ICTR_BITS 0x0000000fu
#define M33_ICTR_RESET 0x00000001u
#define M33_ICTR_INTLINESNUM_RESET 0x1u
#define M33_ICTR_INTLINESNUM_BITS 0x0000000fu
#define M33_ICTR_INTLINESNUM_MSB 3u
#define M33_ICTR_INTLINESNUM_LSB 0u
#define M33_ICTR_INTLINESNUM_ACCESS "RO"
#define M33_ACTLR_OFFSET 0x0000e008u
#define M33_ACTLR_BITS 0x20001605u
#define M33_ACTLR_RESET 0x00000000u
#define M33_ACTLR_EXTEXCLALL_RESET 0x0u
#define M33_ACTLR_EXTEXCLALL_BITS 0x20000000u
#define M33_ACTLR_EXTEXCLALL_MSB 29u
#define M33_ACTLR_EXTEXCLALL_LSB 29u
#define M33_ACTLR_EXTEXCLALL_ACCESS "RW"
#define M33_ACTLR_DISITMATBFLUSH_RESET 0x0u
#define M33_ACTLR_DISITMATBFLUSH_BITS 0x00001000u
#define M33_ACTLR_DISITMATBFLUSH_MSB 12u
#define M33_ACTLR_DISITMATBFLUSH_LSB 12u
#define M33_ACTLR_DISITMATBFLUSH_ACCESS "RW"
#define M33_ACTLR_FPEXCODIS_RESET 0x0u
#define M33_ACTLR_FPEXCODIS_BITS 0x00000400u
#define M33_ACTLR_FPEXCODIS_MSB 10u
#define M33_ACTLR_FPEXCODIS_LSB 10u
#define M33_ACTLR_FPEXCODIS_ACCESS "RW"
#define M33_ACTLR_DISOOFP_RESET 0x0u
#define M33_ACTLR_DISOOFP_BITS 0x00000200u
#define M33_ACTLR_DISOOFP_MSB 9u
#define M33_ACTLR_DISOOFP_LSB 9u
#define M33_ACTLR_DISOOFP_ACCESS "RW"
#define M33_ACTLR_DISFOLD_RESET 0x0u
#define M33_ACTLR_DISFOLD_BITS 0x00000004u
#define M33_ACTLR_DISFOLD_MSB 2u
#define M33_ACTLR_DISFOLD_LSB 2u
#define M33_ACTLR_DISFOLD_ACCESS "RW"
#define M33_ACTLR_DISMCYCINT_RESET 0x0u
#define M33_ACTLR_DISMCYCINT_BITS 0x00000001u
#define M33_ACTLR_DISMCYCINT_MSB 0u
#define M33_ACTLR_DISMCYCINT_LSB 0u
#define M33_ACTLR_DISMCYCINT_ACCESS "RW"
#define M33_SYST_CSR_OFFSET 0x0000e010u
#define M33_SYST_CSR_BITS 0x00010007u
#define M33_SYST_CSR_RESET 0x00000000u
#define M33_SYST_CSR_COUNTFLAG_RESET 0x0u
#define M33_SYST_CSR_COUNTFLAG_BITS 0x00010000u
#define M33_SYST_CSR_COUNTFLAG_MSB 16u
#define M33_SYST_CSR_COUNTFLAG_LSB 16u
#define M33_SYST_CSR_COUNTFLAG_ACCESS "RO"
#define M33_SYST_CSR_CLKSOURCE_RESET 0x0u
#define M33_SYST_CSR_CLKSOURCE_BITS 0x00000004u
#define M33_SYST_CSR_CLKSOURCE_MSB 2u
#define M33_SYST_CSR_CLKSOURCE_LSB 2u
#define M33_SYST_CSR_CLKSOURCE_ACCESS "RW"
#define M33_SYST_CSR_TICKINT_RESET 0x0u
#define M33_SYST_CSR_TICKINT_BITS 0x00000002u
#define M33_SYST_CSR_TICKINT_MSB 1u
#define M33_SYST_CSR_TICKINT_LSB 1u
#define M33_SYST_CSR_TICKINT_ACCESS "RW"
#define M33_SYST_CSR_ENABLE_RESET 0x0u
#define M33_SYST_CSR_ENABLE_BITS 0x00000001u
#define M33_SYST_CSR_ENABLE_MSB 0u
#define M33_SYST_CSR_ENABLE_LSB 0u
#define M33_SYST_CSR_ENABLE_ACCESS "RW"
#define M33_SYST_RVR_OFFSET 0x0000e014u
#define M33_SYST_RVR_BITS 0x00ffffffu
#define M33_SYST_RVR_RESET 0x00000000u
#define M33_SYST_RVR_RELOAD_RESET 0x000000u
#define M33_SYST_RVR_RELOAD_BITS 0x00ffffffu
#define M33_SYST_RVR_RELOAD_MSB 23u
#define M33_SYST_RVR_RELOAD_LSB 0u
#define M33_SYST_RVR_RELOAD_ACCESS "RW"
#define M33_SYST_CVR_OFFSET 0x0000e018u
#define M33_SYST_CVR_BITS 0x00ffffffu
#define M33_SYST_CVR_RESET 0x00000000u
#define M33_SYST_CVR_CURRENT_RESET 0x000000u
#define M33_SYST_CVR_CURRENT_BITS 0x00ffffffu
#define M33_SYST_CVR_CURRENT_MSB 23u
#define M33_SYST_CVR_CURRENT_LSB 0u
#define M33_SYST_CVR_CURRENT_ACCESS "RW"
#define M33_SYST_CALIB_OFFSET 0x0000e01cu
#define M33_SYST_CALIB_BITS 0xc0ffffffu
#define M33_SYST_CALIB_RESET 0x00000000u
#define M33_SYST_CALIB_NOREF_RESET 0x0u
#define M33_SYST_CALIB_NOREF_BITS 0x80000000u
#define M33_SYST_CALIB_NOREF_MSB 31u
#define M33_SYST_CALIB_NOREF_LSB 31u
#define M33_SYST_CALIB_NOREF_ACCESS "RO"
#define M33_SYST_CALIB_SKEW_RESET 0x0u
#define M33_SYST_CALIB_SKEW_BITS 0x40000000u
#define M33_SYST_CALIB_SKEW_MSB 30u
#define M33_SYST_CALIB_SKEW_LSB 30u
#define M33_SYST_CALIB_SKEW_ACCESS "RO"
#define M33_SYST_CALIB_TENMS_RESET 0x000000u
#define M33_SYST_CALIB_TENMS_BITS 0x00ffffffu
#define M33_SYST_CALIB_TENMS_MSB 23u
#define M33_SYST_CALIB_TENMS_LSB 0u
#define M33_SYST_CALIB_TENMS_ACCESS "RO"
#define M33_NVIC_ISER0_OFFSET 0x0000e100u
#define M33_NVIC_ISER0_BITS 0xffffffffu
#define M33_NVIC_ISER0_RESET 0x00000000u
#define M33_NVIC_ISER0_SETENA_RESET 0x00000000u
#define M33_NVIC_ISER0_SETENA_BITS 0xffffffffu
#define M33_NVIC_ISER0_SETENA_MSB 31u
#define M33_NVIC_ISER0_SETENA_LSB 0u
#define M33_NVIC_ISER0_SETENA_ACCESS "RW"
#define M33_NVIC_ISER1_OFFSET 0x0000e104u
#define M33_NVIC_ISER1_BITS 0xffffffffu
#define M33_NVIC_ISER1_RESET 0x00000000u
#define M33_NVIC_ISER1_SETENA_RESET 0x00000000u
#define M33_NVIC_ISER1_SETENA_BITS 0xffffffffu
#define M33_NVIC_ISER1_SETENA_MSB 31u
#define M33_NVIC_ISER1_SETENA_LSB 0u
#define M33_NVIC_ISER1_SETENA_ACCESS "RW"
#define M33_NVIC_ICER0_OFFSET 0x0000e180u
#define M33_NVIC_ICER0_BITS 0xffffffffu
#define M33_NVIC_ICER0_RESET 0x00000000u
#define M33_NVIC_ICER0_CLRENA_RESET 0x00000000u
#define M33_NVIC_ICER0_CLRENA_BITS 0xffffffffu
#define M33_NVIC_ICER0_CLRENA_MSB 31u
#define M33_NVIC_ICER0_CLRENA_LSB 0u
#define M33_NVIC_ICER0_CLRENA_ACCESS "RW"
#define M33_NVIC_ICER1_OFFSET 0x0000e184u
#define M33_NVIC_ICER1_BITS 0xffffffffu
#define M33_NVIC_ICER1_RESET 0x00000000u
#define M33_NVIC_ICER1_CLRENA_RESET 0x00000000u
#define M33_NVIC_ICER1_CLRENA_BITS 0xffffffffu
#define M33_NVIC_ICER1_CLRENA_MSB 31u
#define M33_NVIC_ICER1_CLRENA_LSB 0u
#define M33_NVIC_ICER1_CLRENA_ACCESS "RW"
#define M33_NVIC_ISPR0_OFFSET 0x0000e200u
#define M33_NVIC_ISPR0_BITS 0xffffffffu
#define M33_NVIC_ISPR0_RESET 0x00000000u
#define M33_NVIC_ISPR0_SETPEND_RESET 0x00000000u
#define M33_NVIC_ISPR0_SETPEND_BITS 0xffffffffu
#define M33_NVIC_ISPR0_SETPEND_MSB 31u
#define M33_NVIC_ISPR0_SETPEND_LSB 0u
#define M33_NVIC_ISPR0_SETPEND_ACCESS "RW"
#define M33_NVIC_ISPR1_OFFSET 0x0000e204u
#define M33_NVIC_ISPR1_BITS 0xffffffffu
#define M33_NVIC_ISPR1_RESET 0x00000000u
#define M33_NVIC_ISPR1_SETPEND_RESET 0x00000000u
#define M33_NVIC_ISPR1_SETPEND_BITS 0xffffffffu
#define M33_NVIC_ISPR1_SETPEND_MSB 31u
#define M33_NVIC_ISPR1_SETPEND_LSB 0u
#define M33_NVIC_ISPR1_SETPEND_ACCESS "RW"
#define M33_NVIC_ICPR0_OFFSET 0x0000e280u
#define M33_NVIC_ICPR0_BITS 0xffffffffu
#define M33_NVIC_ICPR0_RESET 0x00000000u
#define M33_NVIC_ICPR0_CLRPEND_RESET 0x00000000u
#define M33_NVIC_ICPR0_CLRPEND_BITS 0xffffffffu
#define M33_NVIC_ICPR0_CLRPEND_MSB 31u
#define M33_NVIC_ICPR0_CLRPEND_LSB 0u
#define M33_NVIC_ICPR0_CLRPEND_ACCESS "RW"
#define M33_NVIC_ICPR1_OFFSET 0x0000e284u
#define M33_NVIC_ICPR1_BITS 0xffffffffu
#define M33_NVIC_ICPR1_RESET 0x00000000u
#define M33_NVIC_ICPR1_CLRPEND_RESET 0x00000000u
#define M33_NVIC_ICPR1_CLRPEND_BITS 0xffffffffu
#define M33_NVIC_ICPR1_CLRPEND_MSB 31u
#define M33_NVIC_ICPR1_CLRPEND_LSB 0u
#define M33_NVIC_ICPR1_CLRPEND_ACCESS "RW"
#define M33_NVIC_IABR0_OFFSET 0x0000e300u
#define M33_NVIC_IABR0_BITS 0xffffffffu
#define M33_NVIC_IABR0_RESET 0x00000000u
#define M33_NVIC_IABR0_ACTIVE_RESET 0x00000000u
#define M33_NVIC_IABR0_ACTIVE_BITS 0xffffffffu
#define M33_NVIC_IABR0_ACTIVE_MSB 31u
#define M33_NVIC_IABR0_ACTIVE_LSB 0u
#define M33_NVIC_IABR0_ACTIVE_ACCESS "RW"
#define M33_NVIC_IABR1_OFFSET 0x0000e304u
#define M33_NVIC_IABR1_BITS 0xffffffffu
#define M33_NVIC_IABR1_RESET 0x00000000u
#define M33_NVIC_IABR1_ACTIVE_RESET 0x00000000u
#define M33_NVIC_IABR1_ACTIVE_BITS 0xffffffffu
#define M33_NVIC_IABR1_ACTIVE_MSB 31u
#define M33_NVIC_IABR1_ACTIVE_LSB 0u
#define M33_NVIC_IABR1_ACTIVE_ACCESS "RW"
#define M33_NVIC_ITNS0_OFFSET 0x0000e380u
#define M33_NVIC_ITNS0_BITS 0xffffffffu
#define M33_NVIC_ITNS0_RESET 0x00000000u
#define M33_NVIC_ITNS0_ITNS_RESET 0x00000000u
#define M33_NVIC_ITNS0_ITNS_BITS 0xffffffffu
#define M33_NVIC_ITNS0_ITNS_MSB 31u
#define M33_NVIC_ITNS0_ITNS_LSB 0u
#define M33_NVIC_ITNS0_ITNS_ACCESS "RW"
#define M33_NVIC_ITNS1_OFFSET 0x0000e384u
#define M33_NVIC_ITNS1_BITS 0xffffffffu
#define M33_NVIC_ITNS1_RESET 0x00000000u
#define M33_NVIC_ITNS1_ITNS_RESET 0x00000000u
#define M33_NVIC_ITNS1_ITNS_BITS 0xffffffffu
#define M33_NVIC_ITNS1_ITNS_MSB 31u
#define M33_NVIC_ITNS1_ITNS_LSB 0u
#define M33_NVIC_ITNS1_ITNS_ACCESS "RW"
#define M33_NVIC_IPR0_OFFSET 0x0000e400u
#define M33_NVIC_IPR0_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR0_RESET 0x00000000u
#define M33_NVIC_IPR0_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR0_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR0_PRI_N3_MSB 31u
#define M33_NVIC_IPR0_PRI_N3_LSB 28u
#define M33_NVIC_IPR0_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR0_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR0_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR0_PRI_N2_MSB 23u
#define M33_NVIC_IPR0_PRI_N2_LSB 20u
#define M33_NVIC_IPR0_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR0_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR0_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR0_PRI_N1_MSB 15u
#define M33_NVIC_IPR0_PRI_N1_LSB 12u
#define M33_NVIC_IPR0_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR0_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR0_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR0_PRI_N0_MSB 7u
#define M33_NVIC_IPR0_PRI_N0_LSB 4u
#define M33_NVIC_IPR0_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR1_OFFSET 0x0000e404u
#define M33_NVIC_IPR1_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR1_RESET 0x00000000u
#define M33_NVIC_IPR1_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR1_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR1_PRI_N3_MSB 31u
#define M33_NVIC_IPR1_PRI_N3_LSB 28u
#define M33_NVIC_IPR1_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR1_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR1_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR1_PRI_N2_MSB 23u
#define M33_NVIC_IPR1_PRI_N2_LSB 20u
#define M33_NVIC_IPR1_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR1_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR1_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR1_PRI_N1_MSB 15u
#define M33_NVIC_IPR1_PRI_N1_LSB 12u
#define M33_NVIC_IPR1_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR1_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR1_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR1_PRI_N0_MSB 7u
#define M33_NVIC_IPR1_PRI_N0_LSB 4u
#define M33_NVIC_IPR1_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR2_OFFSET 0x0000e408u
#define M33_NVIC_IPR2_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR2_RESET 0x00000000u
#define M33_NVIC_IPR2_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR2_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR2_PRI_N3_MSB 31u
#define M33_NVIC_IPR2_PRI_N3_LSB 28u
#define M33_NVIC_IPR2_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR2_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR2_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR2_PRI_N2_MSB 23u
#define M33_NVIC_IPR2_PRI_N2_LSB 20u
#define M33_NVIC_IPR2_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR2_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR2_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR2_PRI_N1_MSB 15u
#define M33_NVIC_IPR2_PRI_N1_LSB 12u
#define M33_NVIC_IPR2_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR2_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR2_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR2_PRI_N0_MSB 7u
#define M33_NVIC_IPR2_PRI_N0_LSB 4u
#define M33_NVIC_IPR2_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR3_OFFSET 0x0000e40cu
#define M33_NVIC_IPR3_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR3_RESET 0x00000000u
#define M33_NVIC_IPR3_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR3_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR3_PRI_N3_MSB 31u
#define M33_NVIC_IPR3_PRI_N3_LSB 28u
#define M33_NVIC_IPR3_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR3_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR3_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR3_PRI_N2_MSB 23u
#define M33_NVIC_IPR3_PRI_N2_LSB 20u
#define M33_NVIC_IPR3_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR3_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR3_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR3_PRI_N1_MSB 15u
#define M33_NVIC_IPR3_PRI_N1_LSB 12u
#define M33_NVIC_IPR3_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR3_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR3_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR3_PRI_N0_MSB 7u
#define M33_NVIC_IPR3_PRI_N0_LSB 4u
#define M33_NVIC_IPR3_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR4_OFFSET 0x0000e410u
#define M33_NVIC_IPR4_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR4_RESET 0x00000000u
#define M33_NVIC_IPR4_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR4_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR4_PRI_N3_MSB 31u
#define M33_NVIC_IPR4_PRI_N3_LSB 28u
#define M33_NVIC_IPR4_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR4_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR4_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR4_PRI_N2_MSB 23u
#define M33_NVIC_IPR4_PRI_N2_LSB 20u
#define M33_NVIC_IPR4_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR4_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR4_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR4_PRI_N1_MSB 15u
#define M33_NVIC_IPR4_PRI_N1_LSB 12u
#define M33_NVIC_IPR4_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR4_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR4_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR4_PRI_N0_MSB 7u
#define M33_NVIC_IPR4_PRI_N0_LSB 4u
#define M33_NVIC_IPR4_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR5_OFFSET 0x0000e414u
#define M33_NVIC_IPR5_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR5_RESET 0x00000000u
#define M33_NVIC_IPR5_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR5_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR5_PRI_N3_MSB 31u
#define M33_NVIC_IPR5_PRI_N3_LSB 28u
#define M33_NVIC_IPR5_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR5_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR5_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR5_PRI_N2_MSB 23u
#define M33_NVIC_IPR5_PRI_N2_LSB 20u
#define M33_NVIC_IPR5_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR5_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR5_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR5_PRI_N1_MSB 15u
#define M33_NVIC_IPR5_PRI_N1_LSB 12u
#define M33_NVIC_IPR5_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR5_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR5_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR5_PRI_N0_MSB 7u
#define M33_NVIC_IPR5_PRI_N0_LSB 4u
#define M33_NVIC_IPR5_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR6_OFFSET 0x0000e418u
#define M33_NVIC_IPR6_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR6_RESET 0x00000000u
#define M33_NVIC_IPR6_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR6_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR6_PRI_N3_MSB 31u
#define M33_NVIC_IPR6_PRI_N3_LSB 28u
#define M33_NVIC_IPR6_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR6_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR6_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR6_PRI_N2_MSB 23u
#define M33_NVIC_IPR6_PRI_N2_LSB 20u
#define M33_NVIC_IPR6_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR6_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR6_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR6_PRI_N1_MSB 15u
#define M33_NVIC_IPR6_PRI_N1_LSB 12u
#define M33_NVIC_IPR6_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR6_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR6_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR6_PRI_N0_MSB 7u
#define M33_NVIC_IPR6_PRI_N0_LSB 4u
#define M33_NVIC_IPR6_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR7_OFFSET 0x0000e41cu
#define M33_NVIC_IPR7_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR7_RESET 0x00000000u
#define M33_NVIC_IPR7_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR7_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR7_PRI_N3_MSB 31u
#define M33_NVIC_IPR7_PRI_N3_LSB 28u
#define M33_NVIC_IPR7_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR7_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR7_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR7_PRI_N2_MSB 23u
#define M33_NVIC_IPR7_PRI_N2_LSB 20u
#define M33_NVIC_IPR7_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR7_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR7_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR7_PRI_N1_MSB 15u
#define M33_NVIC_IPR7_PRI_N1_LSB 12u
#define M33_NVIC_IPR7_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR7_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR7_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR7_PRI_N0_MSB 7u
#define M33_NVIC_IPR7_PRI_N0_LSB 4u
#define M33_NVIC_IPR7_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR8_OFFSET 0x0000e420u
#define M33_NVIC_IPR8_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR8_RESET 0x00000000u
#define M33_NVIC_IPR8_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR8_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR8_PRI_N3_MSB 31u
#define M33_NVIC_IPR8_PRI_N3_LSB 28u
#define M33_NVIC_IPR8_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR8_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR8_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR8_PRI_N2_MSB 23u
#define M33_NVIC_IPR8_PRI_N2_LSB 20u
#define M33_NVIC_IPR8_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR8_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR8_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR8_PRI_N1_MSB 15u
#define M33_NVIC_IPR8_PRI_N1_LSB 12u
#define M33_NVIC_IPR8_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR8_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR8_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR8_PRI_N0_MSB 7u
#define M33_NVIC_IPR8_PRI_N0_LSB 4u
#define M33_NVIC_IPR8_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR9_OFFSET 0x0000e424u
#define M33_NVIC_IPR9_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR9_RESET 0x00000000u
#define M33_NVIC_IPR9_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR9_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR9_PRI_N3_MSB 31u
#define M33_NVIC_IPR9_PRI_N3_LSB 28u
#define M33_NVIC_IPR9_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR9_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR9_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR9_PRI_N2_MSB 23u
#define M33_NVIC_IPR9_PRI_N2_LSB 20u
#define M33_NVIC_IPR9_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR9_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR9_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR9_PRI_N1_MSB 15u
#define M33_NVIC_IPR9_PRI_N1_LSB 12u
#define M33_NVIC_IPR9_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR9_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR9_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR9_PRI_N0_MSB 7u
#define M33_NVIC_IPR9_PRI_N0_LSB 4u
#define M33_NVIC_IPR9_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR10_OFFSET 0x0000e428u
#define M33_NVIC_IPR10_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR10_RESET 0x00000000u
#define M33_NVIC_IPR10_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR10_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR10_PRI_N3_MSB 31u
#define M33_NVIC_IPR10_PRI_N3_LSB 28u
#define M33_NVIC_IPR10_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR10_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR10_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR10_PRI_N2_MSB 23u
#define M33_NVIC_IPR10_PRI_N2_LSB 20u
#define M33_NVIC_IPR10_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR10_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR10_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR10_PRI_N1_MSB 15u
#define M33_NVIC_IPR10_PRI_N1_LSB 12u
#define M33_NVIC_IPR10_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR10_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR10_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR10_PRI_N0_MSB 7u
#define M33_NVIC_IPR10_PRI_N0_LSB 4u
#define M33_NVIC_IPR10_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR11_OFFSET 0x0000e42cu
#define M33_NVIC_IPR11_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR11_RESET 0x00000000u
#define M33_NVIC_IPR11_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR11_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR11_PRI_N3_MSB 31u
#define M33_NVIC_IPR11_PRI_N3_LSB 28u
#define M33_NVIC_IPR11_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR11_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR11_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR11_PRI_N2_MSB 23u
#define M33_NVIC_IPR11_PRI_N2_LSB 20u
#define M33_NVIC_IPR11_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR11_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR11_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR11_PRI_N1_MSB 15u
#define M33_NVIC_IPR11_PRI_N1_LSB 12u
#define M33_NVIC_IPR11_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR11_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR11_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR11_PRI_N0_MSB 7u
#define M33_NVIC_IPR11_PRI_N0_LSB 4u
#define M33_NVIC_IPR11_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR12_OFFSET 0x0000e430u
#define M33_NVIC_IPR12_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR12_RESET 0x00000000u
#define M33_NVIC_IPR12_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR12_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR12_PRI_N3_MSB 31u
#define M33_NVIC_IPR12_PRI_N3_LSB 28u
#define M33_NVIC_IPR12_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR12_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR12_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR12_PRI_N2_MSB 23u
#define M33_NVIC_IPR12_PRI_N2_LSB 20u
#define M33_NVIC_IPR12_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR12_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR12_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR12_PRI_N1_MSB 15u
#define M33_NVIC_IPR12_PRI_N1_LSB 12u
#define M33_NVIC_IPR12_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR12_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR12_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR12_PRI_N0_MSB 7u
#define M33_NVIC_IPR12_PRI_N0_LSB 4u
#define M33_NVIC_IPR12_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR13_OFFSET 0x0000e434u
#define M33_NVIC_IPR13_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR13_RESET 0x00000000u
#define M33_NVIC_IPR13_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR13_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR13_PRI_N3_MSB 31u
#define M33_NVIC_IPR13_PRI_N3_LSB 28u
#define M33_NVIC_IPR13_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR13_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR13_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR13_PRI_N2_MSB 23u
#define M33_NVIC_IPR13_PRI_N2_LSB 20u
#define M33_NVIC_IPR13_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR13_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR13_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR13_PRI_N1_MSB 15u
#define M33_NVIC_IPR13_PRI_N1_LSB 12u
#define M33_NVIC_IPR13_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR13_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR13_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR13_PRI_N0_MSB 7u
#define M33_NVIC_IPR13_PRI_N0_LSB 4u
#define M33_NVIC_IPR13_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR14_OFFSET 0x0000e438u
#define M33_NVIC_IPR14_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR14_RESET 0x00000000u
#define M33_NVIC_IPR14_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR14_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR14_PRI_N3_MSB 31u
