gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define M33_NVIC_IPR14_PRI_N3_LSB 28u
#define M33_NVIC_IPR14_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR14_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR14_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR14_PRI_N2_MSB 23u
#define M33_NVIC_IPR14_PRI_N2_LSB 20u
#define M33_NVIC_IPR14_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR14_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR14_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR14_PRI_N1_MSB 15u
#define M33_NVIC_IPR14_PRI_N1_LSB 12u
#define M33_NVIC_IPR14_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR14_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR14_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR14_PRI_N0_MSB 7u
#define M33_NVIC_IPR14_PRI_N0_LSB 4u
#define M33_NVIC_IPR14_PRI_N0_ACCESS "RW"
#define M33_NVIC_IPR15_OFFSET 0x0000e43cu
#define M33_NVIC_IPR15_BITS 0xf0f0f0f0u
#define M33_NVIC_IPR15_RESET 0x00000000u
#define M33_NVIC_IPR15_PRI_N3_RESET 0x0u
#define M33_NVIC_IPR15_PRI_N3_BITS 0xf0000000u
#define M33_NVIC_IPR15_PRI_N3_MSB 31u
#define M33_NVIC_IPR15_PRI_N3_LSB 28u
#define M33_NVIC_IPR15_PRI_N3_ACCESS "RW"
#define M33_NVIC_IPR15_PRI_N2_RESET 0x0u
#define M33_NVIC_IPR15_PRI_N2_BITS 0x00f00000u
#define M33_NVIC_IPR15_PRI_N2_MSB 23u
#define M33_NVIC_IPR15_PRI_N2_LSB 20u
#define M33_NVIC_IPR15_PRI_N2_ACCESS "RW"
#define M33_NVIC_IPR15_PRI_N1_RESET 0x0u
#define M33_NVIC_IPR15_PRI_N1_BITS 0x0000f000u
#define M33_NVIC_IPR15_PRI_N1_MSB 15u
#define M33_NVIC_IPR15_PRI_N1_LSB 12u
#define M33_NVIC_IPR15_PRI_N1_ACCESS "RW"
#define M33_NVIC_IPR15_PRI_N0_RESET 0x0u
#define M33_NVIC_IPR15_PRI_N0_BITS 0x000000f0u
#define M33_NVIC_IPR15_PRI_N0_MSB 7u
#define M33_NVIC_IPR15_PRI_N0_LSB 4u
#define M33_NVIC_IPR15_PRI_N0_ACCESS "RW"
#define M33_CPUID_OFFSET 0x0000ed00u
#define M33_CPUID_BITS 0xffffffffu
#define M33_CPUID_RESET 0x411fd210u
#define M33_CPUID_IMPLEMENTER_RESET 0x41u
#define M33_CPUID_IMPLEMENTER_BITS 0xff000000u
#define M33_CPUID_IMPLEMENTER_MSB 31u
#define M33_CPUID_IMPLEMENTER_LSB 24u
#define M33_CPUID_IMPLEMENTER_ACCESS "RO"
#define M33_CPUID_VARIANT_RESET 0x1u
#define M33_CPUID_VARIANT_BITS 0x00f00000u
#define M33_CPUID_VARIANT_MSB 23u
#define M33_CPUID_VARIANT_LSB 20u
#define M33_CPUID_VARIANT_ACCESS "RO"
#define M33_CPUID_ARCHITECTURE_RESET 0xfu
#define M33_CPUID_ARCHITECTURE_BITS 0x000f0000u
#define M33_CPUID_ARCHITECTURE_MSB 19u
#define M33_CPUID_ARCHITECTURE_LSB 16u
#define M33_CPUID_ARCHITECTURE_ACCESS "RO"
#define M33_CPUID_PARTNO_RESET 0xd21u
#define M33_CPUID_PARTNO_BITS 0x0000fff0u
#define M33_CPUID_PARTNO_MSB 15u
#define M33_CPUID_PARTNO_LSB 4u
#define M33_CPUID_PARTNO_ACCESS "RO"
#define M33_CPUID_REVISION_RESET 0x0u
#define M33_CPUID_REVISION_BITS 0x0000000fu
#define M33_CPUID_REVISION_MSB 3u
#define M33_CPUID_REVISION_LSB 0u
#define M33_CPUID_REVISION_ACCESS "RO"
#define M33_ICSR_OFFSET 0x0000ed04u
#define M33_ICSR_BITS 0xdfdff9ffu
#define M33_ICSR_RESET 0x00000000u
#define M33_ICSR_PENDNMISET_RESET 0x0u
#define M33_ICSR_PENDNMISET_BITS 0x80000000u
#define M33_ICSR_PENDNMISET_MSB 31u
#define M33_ICSR_PENDNMISET_LSB 31u
#define M33_ICSR_PENDNMISET_ACCESS "RO"
#define M33_ICSR_PENDNMICLR_RESET 0x0u
#define M33_ICSR_PENDNMICLR_BITS 0x40000000u
#define M33_ICSR_PENDNMICLR_MSB 30u
#define M33_ICSR_PENDNMICLR_LSB 30u
#define M33_ICSR_PENDNMICLR_ACCESS "RW"
#define M33_ICSR_PENDSVSET_RESET 0x0u
#define M33_ICSR_PENDSVSET_BITS 0x10000000u
#define M33_ICSR_PENDSVSET_MSB 28u
#define M33_ICSR_PENDSVSET_LSB 28u
#define M33_ICSR_PENDSVSET_ACCESS "RO"
#define M33_ICSR_PENDSVCLR_RESET 0x0u
#define M33_ICSR_PENDSVCLR_BITS 0x08000000u
#define M33_ICSR_PENDSVCLR_MSB 27u
#define M33_ICSR_PENDSVCLR_LSB 27u
#define M33_ICSR_PENDSVCLR_ACCESS "RW"
#define M33_ICSR_PENDSTSET_RESET 0x0u
#define M33_ICSR_PENDSTSET_BITS 0x04000000u
#define M33_ICSR_PENDSTSET_MSB 26u
#define M33_ICSR_PENDSTSET_LSB 26u
#define M33_ICSR_PENDSTSET_ACCESS "RO"
#define M33_ICSR_PENDSTCLR_RESET 0x0u
#define M33_ICSR_PENDSTCLR_BITS 0x02000000u
#define M33_ICSR_PENDSTCLR_MSB 25u
#define M33_ICSR_PENDSTCLR_LSB 25u
#define M33_ICSR_PENDSTCLR_ACCESS "RW"
#define M33_ICSR_STTNS_RESET 0x0u
#define M33_ICSR_STTNS_BITS 0x01000000u
#define M33_ICSR_STTNS_MSB 24u
#define M33_ICSR_STTNS_LSB 24u
#define M33_ICSR_STTNS_ACCESS "RW"
#define M33_ICSR_ISRPREEMPT_RESET 0x0u
#define M33_ICSR_ISRPREEMPT_BITS 0x00800000u
#define M33_ICSR_ISRPREEMPT_MSB 23u
#define M33_ICSR_ISRPREEMPT_LSB 23u
#define M33_ICSR_ISRPREEMPT_ACCESS "RO"
#define M33_ICSR_ISRPENDING_RESET 0x0u
#define M33_ICSR_ISRPENDING_BITS 0x00400000u
#define M33_ICSR_ISRPENDING_MSB 22u
#define M33_ICSR_ISRPENDING_LSB 22u
#define M33_ICSR_ISRPENDING_ACCESS "RO"
#define M33_ICSR_VECTPENDING_RESET 0x000u
#define M33_ICSR_VECTPENDING_BITS 0x001ff000u
#define M33_ICSR_VECTPENDING_MSB 20u
#define M33_ICSR_VECTPENDING_LSB 12u
#define M33_ICSR_VECTPENDING_ACCESS "RO"
#define M33_ICSR_RETTOBASE_RESET 0x0u
#define M33_ICSR_RETTOBASE_BITS 0x00000800u
#define M33_ICSR_RETTOBASE_MSB 11u
#define M33_ICSR_RETTOBASE_LSB 11u
#define M33_ICSR_RETTOBASE_ACCESS "RO"
#define M33_ICSR_VECTACTIVE_RESET 0x000u
#define M33_ICSR_VECTACTIVE_BITS 0x000001ffu
#define M33_ICSR_VECTACTIVE_MSB 8u
#define M33_ICSR_VECTACTIVE_LSB 0u
#define M33_ICSR_VECTACTIVE_ACCESS "RO"
#define M33_VTOR_OFFSET 0x0000ed08u
#define M33_VTOR_BITS 0xffffff80u
#define M33_VTOR_RESET 0x00000000u
#define M33_VTOR_TBLOFF_RESET 0x0000000u
#define M33_VTOR_TBLOFF_BITS 0xffffff80u
#define M33_VTOR_TBLOFF_MSB 31u
#define M33_VTOR_TBLOFF_LSB 7u
#define M33_VTOR_TBLOFF_ACCESS "RW"
#define M33_AIRCR_OFFSET 0x0000ed0cu
#define M33_AIRCR_BITS 0xffffe70eu
#define M33_AIRCR_RESET 0x00000000u
#define M33_AIRCR_VECTKEY_RESET 0x0000u
#define M33_AIRCR_VECTKEY_BITS 0xffff0000u
#define M33_AIRCR_VECTKEY_MSB 31u
#define M33_AIRCR_VECTKEY_LSB 16u
#define M33_AIRCR_VECTKEY_ACCESS "RW"
#define M33_AIRCR_ENDIANESS_RESET 0x0u
#define M33_AIRCR_ENDIANESS_BITS 0x00008000u
#define M33_AIRCR_ENDIANESS_MSB 15u
#define M33_AIRCR_ENDIANESS_LSB 15u
#define M33_AIRCR_ENDIANESS_ACCESS "RO"
#define M33_AIRCR_PRIS_RESET 0x0u
#define M33_AIRCR_PRIS_BITS 0x00004000u
#define M33_AIRCR_PRIS_MSB 14u
#define M33_AIRCR_PRIS_LSB 14u
#define M33_AIRCR_PRIS_ACCESS "RW"
#define M33_AIRCR_BFHFNMINS_RESET 0x0u
#define M33_AIRCR_BFHFNMINS_BITS 0x00002000u
#define M33_AIRCR_BFHFNMINS_MSB 13u
#define M33_AIRCR_BFHFNMINS_LSB 13u
#define M33_AIRCR_BFHFNMINS_ACCESS "RW"
#define M33_AIRCR_PRIGROUP_RESET 0x0u
#define M33_AIRCR_PRIGROUP_BITS 0x00000700u
#define M33_AIRCR_PRIGROUP_MSB 10u
#define M33_AIRCR_PRIGROUP_LSB 8u
#define M33_AIRCR_PRIGROUP_ACCESS "RW"
#define M33_AIRCR_SYSRESETREQS_RESET 0x0u
#define M33_AIRCR_SYSRESETREQS_BITS 0x00000008u
#define M33_AIRCR_SYSRESETREQS_MSB 3u
#define M33_AIRCR_SYSRESETREQS_LSB 3u
#define M33_AIRCR_SYSRESETREQS_ACCESS "RW"
#define M33_AIRCR_SYSRESETREQ_RESET 0x0u
#define M33_AIRCR_SYSRESETREQ_BITS 0x00000004u
#define M33_AIRCR_SYSRESETREQ_MSB 2u
#define M33_AIRCR_SYSRESETREQ_LSB 2u
#define M33_AIRCR_SYSRESETREQ_ACCESS "RW"
#define M33_AIRCR_VECTCLRACTIVE_RESET 0x0u
#define M33_AIRCR_VECTCLRACTIVE_BITS 0x00000002u
#define M33_AIRCR_VECTCLRACTIVE_MSB 1u
#define M33_AIRCR_VECTCLRACTIVE_LSB 1u
#define M33_AIRCR_VECTCLRACTIVE_ACCESS "RW"
#define M33_SCR_OFFSET 0x0000ed10u
#define M33_SCR_BITS 0x0000001eu
#define M33_SCR_RESET 0x00000000u
#define M33_SCR_SEVONPEND_RESET 0x0u
#define M33_SCR_SEVONPEND_BITS 0x00000010u
#define M33_SCR_SEVONPEND_MSB 4u
#define M33_SCR_SEVONPEND_LSB 4u
#define M33_SCR_SEVONPEND_ACCESS "RW"
#define M33_SCR_SLEEPDEEPS_RESET 0x0u
#define M33_SCR_SLEEPDEEPS_BITS 0x00000008u
#define M33_SCR_SLEEPDEEPS_MSB 3u
#define M33_SCR_SLEEPDEEPS_LSB 3u
#define M33_SCR_SLEEPDEEPS_ACCESS "RW"
#define M33_SCR_SLEEPDEEP_RESET 0x0u
#define M33_SCR_SLEEPDEEP_BITS 0x00000004u
#define M33_SCR_SLEEPDEEP_MSB 2u
#define M33_SCR_SLEEPDEEP_LSB 2u
#define M33_SCR_SLEEPDEEP_ACCESS "RW"
#define M33_SCR_SLEEPONEXIT_RESET 0x0u
#define M33_SCR_SLEEPONEXIT_BITS 0x00000002u
#define M33_SCR_SLEEPONEXIT_MSB 1u
#define M33_SCR_SLEEPONEXIT_LSB 1u
#define M33_SCR_SLEEPONEXIT_ACCESS "RW"
#define M33_CCR_OFFSET 0x0000ed14u
#define M33_CCR_BITS 0x0007071bu
#define M33_CCR_RESET 0x00000201u
#define M33_CCR_BP_RESET 0x0u
#define M33_CCR_BP_BITS 0x00040000u
#define M33_CCR_BP_MSB 18u
#define M33_CCR_BP_LSB 18u
#define M33_CCR_BP_ACCESS "RO"
#define M33_CCR_IC_RESET 0x0u
#define M33_CCR_IC_BITS 0x00020000u
#define M33_CCR_IC_MSB 17u
#define M33_CCR_IC_LSB 17u
#define M33_CCR_IC_ACCESS "RO"
#define M33_CCR_DC_RESET 0x0u
#define M33_CCR_DC_BITS 0x00010000u
#define M33_CCR_DC_MSB 16u
#define M33_CCR_DC_LSB 16u
#define M33_CCR_DC_ACCESS "RO"
#define M33_CCR_STKOFHFNMIGN_RESET 0x0u
#define M33_CCR_STKOFHFNMIGN_BITS 0x00000400u
#define M33_CCR_STKOFHFNMIGN_MSB 10u
#define M33_CCR_STKOFHFNMIGN_LSB 10u
#define M33_CCR_STKOFHFNMIGN_ACCESS "RW"
#define M33_CCR_RES1_RESET 0x1u
#define M33_CCR_RES1_BITS 0x00000200u
#define M33_CCR_RES1_MSB 9u
#define M33_CCR_RES1_LSB 9u
#define M33_CCR_RES1_ACCESS "RO"
#define M33_CCR_BFHFNMIGN_RESET 0x0u
#define M33_CCR_BFHFNMIGN_BITS 0x00000100u
#define M33_CCR_BFHFNMIGN_MSB 8u
#define M33_CCR_BFHFNMIGN_LSB 8u
#define M33_CCR_BFHFNMIGN_ACCESS "RW"
#define M33_CCR_DIV_0_TRP_RESET 0x0u
#define M33_CCR_DIV_0_TRP_BITS 0x00000010u
#define M33_CCR_DIV_0_TRP_MSB 4u
#define M33_CCR_DIV_0_TRP_LSB 4u
#define M33_CCR_DIV_0_TRP_ACCESS "RW"
#define M33_CCR_UNALIGN_TRP_RESET 0x0u
#define M33_CCR_UNALIGN_TRP_BITS 0x00000008u
#define M33_CCR_UNALIGN_TRP_MSB 3u
#define M33_CCR_UNALIGN_TRP_LSB 3u
#define M33_CCR_UNALIGN_TRP_ACCESS "RW"
#define M33_CCR_USERSETMPEND_RESET 0x0u
#define M33_CCR_USERSETMPEND_BITS 0x00000002u
#define M33_CCR_USERSETMPEND_MSB 1u
#define M33_CCR_USERSETMPEND_LSB 1u
#define M33_CCR_USERSETMPEND_ACCESS "RW"
#define M33_CCR_RES1_1_RESET 0x1u
#define M33_CCR_RES1_1_BITS 0x00000001u
#define M33_CCR_RES1_1_MSB 0u
#define M33_CCR_RES1_1_LSB 0u
#define M33_CCR_RES1_1_ACCESS "RO"
#define M33_SHPR1_OFFSET 0x0000ed18u
#define M33_SHPR1_BITS 0xe0e0e0e0u
#define M33_SHPR1_RESET 0x00000000u
#define M33_SHPR1_PRI_7_3_RESET 0x0u
#define M33_SHPR1_PRI_7_3_BITS 0xe0000000u
#define M33_SHPR1_PRI_7_3_MSB 31u
#define M33_SHPR1_PRI_7_3_LSB 29u
#define M33_SHPR1_PRI_7_3_ACCESS "RW"
#define M33_SHPR1_PRI_6_3_RESET 0x0u
#define M33_SHPR1_PRI_6_3_BITS 0x00e00000u
#define M33_SHPR1_PRI_6_3_MSB 23u
#define M33_SHPR1_PRI_6_3_LSB 21u
#define M33_SHPR1_PRI_6_3_ACCESS "RW"
#define M33_SHPR1_PRI_5_3_RESET 0x0u
#define M33_SHPR1_PRI_5_3_BITS 0x0000e000u
#define M33_SHPR1_PRI_5_3_MSB 15u
#define M33_SHPR1_PRI_5_3_LSB 13u
#define M33_SHPR1_PRI_5_3_ACCESS "RW"
#define M33_SHPR1_PRI_4_3_RESET 0x0u
#define M33_SHPR1_PRI_4_3_BITS 0x000000e0u
#define M33_SHPR1_PRI_4_3_MSB 7u
#define M33_SHPR1_PRI_4_3_LSB 5u
#define M33_SHPR1_PRI_4_3_ACCESS "RW"
#define M33_SHPR2_OFFSET 0x0000ed1cu
#define M33_SHPR2_BITS 0xe0ffffffu
#define M33_SHPR2_RESET 0x00000000u
#define M33_SHPR2_PRI_11_3_RESET 0x0u
#define M33_SHPR2_PRI_11_3_BITS 0xe0000000u
#define M33_SHPR2_PRI_11_3_MSB 31u
#define M33_SHPR2_PRI_11_3_LSB 29u
#define M33_SHPR2_PRI_11_3_ACCESS "RW"
#define M33_SHPR2_PRI_10_RESET 0x00u
#define M33_SHPR2_PRI_10_BITS 0x00ff0000u
#define M33_SHPR2_PRI_10_MSB 23u
#define M33_SHPR2_PRI_10_LSB 16u
#define M33_SHPR2_PRI_10_ACCESS "RO"
#define M33_SHPR2_PRI_9_RESET 0x00u
#define M33_SHPR2_PRI_9_BITS 0x0000ff00u
#define M33_SHPR2_PRI_9_MSB 15u
#define M33_SHPR2_PRI_9_LSB 8u
#define M33_SHPR2_PRI_9_ACCESS "RO"
#define M33_SHPR2_PRI_8_RESET 0x00u
#define M33_SHPR2_PRI_8_BITS 0x000000ffu
#define M33_SHPR2_PRI_8_MSB 7u
#define M33_SHPR2_PRI_8_LSB 0u
#define M33_SHPR2_PRI_8_ACCESS "RO"
#define M33_SHPR3_OFFSET 0x0000ed20u
#define M33_SHPR3_BITS 0xe0e0ffe0u
#define M33_SHPR3_RESET 0x00000000u
#define M33_SHPR3_PRI_15_3_RESET 0x0u
#define M33_SHPR3_PRI_15_3_BITS 0xe0000000u
#define M33_SHPR3_PRI_15_3_MSB 31u
#define M33_SHPR3_PRI_15_3_LSB 29u
#define M33_SHPR3_PRI_15_3_ACCESS "RW"
#define M33_SHPR3_PRI_14_3_RESET 0x0u
#define M33_SHPR3_PRI_14_3_BITS 0x00e00000u
#define M33_SHPR3_PRI_14_3_MSB 23u
#define M33_SHPR3_PRI_14_3_LSB 21u
#define M33_SHPR3_PRI_14_3_ACCESS "RW"
#define M33_SHPR3_PRI_13_RESET 0x00u
#define M33_SHPR3_PRI_13_BITS 0x0000ff00u
#define M33_SHPR3_PRI_13_MSB 15u
#define M33_SHPR3_PRI_13_LSB 8u
#define M33_SHPR3_PRI_13_ACCESS "RO"
#define M33_SHPR3_PRI_12_3_RESET 0x0u
#define M33_SHPR3_PRI_12_3_BITS 0x000000e0u
#define M33_SHPR3_PRI_12_3_MSB 7u
#define M33_SHPR3_PRI_12_3_LSB 5u
#define M33_SHPR3_PRI_12_3_ACCESS "RW"
#define M33_SHCSR_OFFSET 0x0000ed24u
#define M33_SHCSR_BITS 0x003ffdbfu
#define M33_SHCSR_RESET 0x00000000u
#define M33_SHCSR_HARDFAULTPENDED_RESET 0x0u
#define M33_SHCSR_HARDFAULTPENDED_BITS 0x00200000u
#define M33_SHCSR_HARDFAULTPENDED_MSB 21u
#define M33_SHCSR_HARDFAULTPENDED_LSB 21u
#define M33_SHCSR_HARDFAULTPENDED_ACCESS "RW"
#define M33_SHCSR_SECUREFAULTPENDED_RESET 0x0u
#define M33_SHCSR_SECUREFAULTPENDED_BITS 0x00100000u
#define M33_SHCSR_SECUREFAULTPENDED_MSB 20u
#define M33_SHCSR_SECUREFAULTPENDED_LSB 20u
#define M33_SHCSR_SECUREFAULTPENDED_ACCESS "RW"
#define M33_SHCSR_SECUREFAULTENA_RESET 0x0u
#define M33_SHCSR_SECUREFAULTENA_BITS 0x00080000u
#define M33_SHCSR_SECUREFAULTENA_MSB 19u
#define M33_SHCSR_SECUREFAULTENA_LSB 19u
#define M33_SHCSR_SECUREFAULTENA_ACCESS "RW"
#define M33_SHCSR_USGFAULTENA_RESET 0x0u
#define M33_SHCSR_USGFAULTENA_BITS 0x00040000u
#define M33_SHCSR_USGFAULTENA_MSB 18u
#define M33_SHCSR_USGFAULTENA_LSB 18u
#define M33_SHCSR_USGFAULTENA_ACCESS "RW"
#define M33_SHCSR_BUSFAULTENA_RESET 0x0u
#define M33_SHCSR_BUSFAULTENA_BITS 0x00020000u
#define M33_SHCSR_BUSFAULTENA_MSB 17u
#define M33_SHCSR_BUSFAULTENA_LSB 17u
#define M33_SHCSR_BUSFAULTENA_ACCESS "RW"
#define M33_SHCSR_MEMFAULTENA_RESET 0x0u
#define M33_SHCSR_MEMFAULTENA_BITS 0x00010000u
#define M33_SHCSR_MEMFAULTENA_MSB 16u
#define M33_SHCSR_MEMFAULTENA_LSB 16u
#define M33_SHCSR_MEMFAULTENA_ACCESS "RW"
#define M33_SHCSR_SVCALLPENDED_RESET 0x0u
#define M33_SHCSR_SVCALLPENDED_BITS 0x00008000u
#define M33_SHCSR_SVCALLPENDED_MSB 15u
#define M33_SHCSR_SVCALLPENDED_LSB 15u
#define M33_SHCSR_SVCALLPENDED_ACCESS "RW"
#define M33_SHCSR_BUSFAULTPENDED_RESET 0x0u
#define M33_SHCSR_BUSFAULTPENDED_BITS 0x00004000u
#define M33_SHCSR_BUSFAULTPENDED_MSB 14u
#define M33_SHCSR_BUSFAULTPENDED_LSB 14u
#define M33_SHCSR_BUSFAULTPENDED_ACCESS "RW"
#define M33_SHCSR_MEMFAULTPENDED_RESET 0x0u
#define M33_SHCSR_MEMFAULTPENDED_BITS 0x00002000u
#define M33_SHCSR_MEMFAULTPENDED_MSB 13u
#define M33_SHCSR_MEMFAULTPENDED_LSB 13u
#define M33_SHCSR_MEMFAULTPENDED_ACCESS "RW"
#define M33_SHCSR_USGFAULTPENDED_RESET 0x0u
#define M33_SHCSR_USGFAULTPENDED_BITS 0x00001000u
#define M33_SHCSR_USGFAULTPENDED_MSB 12u
#define M33_SHCSR_USGFAULTPENDED_LSB 12u
#define M33_SHCSR_USGFAULTPENDED_ACCESS "RW"
#define M33_SHCSR_SYSTICKACT_RESET 0x0u
#define M33_SHCSR_SYSTICKACT_BITS 0x00000800u
#define M33_SHCSR_SYSTICKACT_MSB 11u
#define M33_SHCSR_SYSTICKACT_LSB 11u
#define M33_SHCSR_SYSTICKACT_ACCESS "RW"
#define M33_SHCSR_PENDSVACT_RESET 0x0u
#define M33_SHCSR_PENDSVACT_BITS 0x00000400u
#define M33_SHCSR_PENDSVACT_MSB 10u
#define M33_SHCSR_PENDSVACT_LSB 10u
#define M33_SHCSR_PENDSVACT_ACCESS "RW"
#define M33_SHCSR_MONITORACT_RESET 0x0u
#define M33_SHCSR_MONITORACT_BITS 0x00000100u
#define M33_SHCSR_MONITORACT_MSB 8u
#define M33_SHCSR_MONITORACT_LSB 8u
#define M33_SHCSR_MONITORACT_ACCESS "RW"
#define M33_SHCSR_SVCALLACT_RESET 0x0u
#define M33_SHCSR_SVCALLACT_BITS 0x00000080u
#define M33_SHCSR_SVCALLACT_MSB 7u
#define M33_SHCSR_SVCALLACT_LSB 7u
#define M33_SHCSR_SVCALLACT_ACCESS "RW"
#define M33_SHCSR_NMIACT_RESET 0x0u
#define M33_SHCSR_NMIACT_BITS 0x00000020u
#define M33_SHCSR_NMIACT_MSB 5u
#define M33_SHCSR_NMIACT_LSB 5u
#define M33_SHCSR_NMIACT_ACCESS "RW"
#define M33_SHCSR_SECUREFAULTACT_RESET 0x0u
#define M33_SHCSR_SECUREFAULTACT_BITS 0x00000010u
#define M33_SHCSR_SECUREFAULTACT_MSB 4u
#define M33_SHCSR_SECUREFAULTACT_LSB 4u
#define M33_SHCSR_SECUREFAULTACT_ACCESS "RW"
#define M33_SHCSR_USGFAULTACT_RESET 0x0u
#define M33_SHCSR_USGFAULTACT_BITS 0x00000008u
#define M33_SHCSR_USGFAULTACT_MSB 3u
#define M33_SHCSR_USGFAULTACT_LSB 3u
#define M33_SHCSR_USGFAULTACT_ACCESS "RW"
#define M33_SHCSR_HARDFAULTACT_RESET 0x0u
#define M33_SHCSR_HARDFAULTACT_BITS 0x00000004u
#define M33_SHCSR_HARDFAULTACT_MSB 2u
#define M33_SHCSR_HARDFAULTACT_LSB 2u
#define M33_SHCSR_HARDFAULTACT_ACCESS "RW"
#define M33_SHCSR_BUSFAULTACT_RESET 0x0u
#define M33_SHCSR_BUSFAULTACT_BITS 0x00000002u
#define M33_SHCSR_BUSFAULTACT_MSB 1u
#define M33_SHCSR_BUSFAULTACT_LSB 1u
#define M33_SHCSR_BUSFAULTACT_ACCESS "RW"
#define M33_SHCSR_MEMFAULTACT_RESET 0x0u
#define M33_SHCSR_MEMFAULTACT_BITS 0x00000001u
#define M33_SHCSR_MEMFAULTACT_MSB 0u
#define M33_SHCSR_MEMFAULTACT_LSB 0u
#define M33_SHCSR_MEMFAULTACT_ACCESS "RW"
#define M33_CFSR_OFFSET 0x0000ed28u
#define M33_CFSR_BITS 0x031fbfffu
#define M33_CFSR_RESET 0x00000000u
#define M33_CFSR_UFSR_DIVBYZERO_RESET 0x0u
#define M33_CFSR_UFSR_DIVBYZERO_BITS 0x02000000u
#define M33_CFSR_UFSR_DIVBYZERO_MSB 25u
#define M33_CFSR_UFSR_DIVBYZERO_LSB 25u
#define M33_CFSR_UFSR_DIVBYZERO_ACCESS "RW"
#define M33_CFSR_UFSR_UNALIGNED_RESET 0x0u
#define M33_CFSR_UFSR_UNALIGNED_BITS 0x01000000u
#define M33_CFSR_UFSR_UNALIGNED_MSB 24u
#define M33_CFSR_UFSR_UNALIGNED_LSB 24u
#define M33_CFSR_UFSR_UNALIGNED_ACCESS "RW"
#define M33_CFSR_UFSR_STKOF_RESET 0x0u
#define M33_CFSR_UFSR_STKOF_BITS 0x00100000u
#define M33_CFSR_UFSR_STKOF_MSB 20u
#define M33_CFSR_UFSR_STKOF_LSB 20u
#define M33_CFSR_UFSR_STKOF_ACCESS "RW"
#define M33_CFSR_UFSR_NOCP_RESET 0x0u
#define M33_CFSR_UFSR_NOCP_BITS 0x00080000u
#define M33_CFSR_UFSR_NOCP_MSB 19u
#define M33_CFSR_UFSR_NOCP_LSB 19u
#define M33_CFSR_UFSR_NOCP_ACCESS "RW"
#define M33_CFSR_UFSR_INVPC_RESET 0x0u
#define M33_CFSR_UFSR_INVPC_BITS 0x00040000u
#define M33_CFSR_UFSR_INVPC_MSB 18u
#define M33_CFSR_UFSR_INVPC_LSB 18u
#define M33_CFSR_UFSR_INVPC_ACCESS "RW"
#define M33_CFSR_UFSR_INVSTATE_RESET 0x0u
#define M33_CFSR_UFSR_INVSTATE_BITS 0x00020000u
#define M33_CFSR_UFSR_INVSTATE_MSB 17u
#define M33_CFSR_UFSR_INVSTATE_LSB 17u
#define M33_CFSR_UFSR_INVSTATE_ACCESS "RW"
#define M33_CFSR_UFSR_UNDEFINSTR_RESET 0x0u
#define M33_CFSR_UFSR_UNDEFINSTR_BITS 0x00010000u
#define M33_CFSR_UFSR_UNDEFINSTR_MSB 16u
#define M33_CFSR_UFSR_UNDEFINSTR_LSB 16u
#define M33_CFSR_UFSR_UNDEFINSTR_ACCESS "RW"
#define M33_CFSR_BFSR_BFARVALID_RESET 0x0u
#define M33_CFSR_BFSR_BFARVALID_BITS 0x00008000u
#define M33_CFSR_BFSR_BFARVALID_MSB 15u
#define M33_CFSR_BFSR_BFARVALID_LSB 15u
#define M33_CFSR_BFSR_BFARVALID_ACCESS "RW"
#define M33_CFSR_BFSR_LSPERR_RESET 0x0u
#define M33_CFSR_BFSR_LSPERR_BITS 0x00002000u
#define M33_CFSR_BFSR_LSPERR_MSB 13u
#define M33_CFSR_BFSR_LSPERR_LSB 13u
#define M33_CFSR_BFSR_LSPERR_ACCESS "RW"
#define M33_CFSR_BFSR_STKERR_RESET 0x0u
#define M33_CFSR_BFSR_STKERR_BITS 0x00001000u
#define M33_CFSR_BFSR_STKERR_MSB 12u
#define M33_CFSR_BFSR_STKERR_LSB 12u
#define M33_CFSR_BFSR_STKERR_ACCESS "RW"
#define M33_CFSR_BFSR_UNSTKERR_RESET 0x0u
#define M33_CFSR_BFSR_UNSTKERR_BITS 0x00000800u
#define M33_CFSR_BFSR_UNSTKERR_MSB 11u
#define M33_CFSR_BFSR_UNSTKERR_LSB 11u
#define M33_CFSR_BFSR_UNSTKERR_ACCESS "RW"
#define M33_CFSR_BFSR_IMPRECISERR_RESET 0x0u
#define M33_CFSR_BFSR_IMPRECISERR_BITS 0x00000400u
#define M33_CFSR_BFSR_IMPRECISERR_MSB 10u
#define M33_CFSR_BFSR_IMPRECISERR_LSB 10u
#define M33_CFSR_BFSR_IMPRECISERR_ACCESS "RW"
#define M33_CFSR_BFSR_PRECISERR_RESET 0x0u
#define M33_CFSR_BFSR_PRECISERR_BITS 0x00000200u
#define M33_CFSR_BFSR_PRECISERR_MSB 9u
#define M33_CFSR_BFSR_PRECISERR_LSB 9u
#define M33_CFSR_BFSR_PRECISERR_ACCESS "RW"
#define M33_CFSR_BFSR_IBUSERR_RESET 0x0u
#define M33_CFSR_BFSR_IBUSERR_BITS 0x00000100u
#define M33_CFSR_BFSR_IBUSERR_MSB 8u
#define M33_CFSR_BFSR_IBUSERR_LSB 8u
#define M33_CFSR_BFSR_IBUSERR_ACCESS "RW"
#define M33_CFSR_MMFSR_RESET 0x00u
#define M33_CFSR_MMFSR_BITS 0x000000ffu
#define M33_CFSR_MMFSR_MSB 7u
#define M33_CFSR_MMFSR_LSB 0u
#define M33_CFSR_MMFSR_ACCESS "RW"
#define M33_HFSR_OFFSET 0x0000ed2cu
#define M33_HFSR_BITS 0xc0000002u
#define M33_HFSR_RESET 0x00000000u
#define M33_HFSR_DEBUGEVT_RESET 0x0u
#define M33_HFSR_DEBUGEVT_BITS 0x80000000u
#define M33_HFSR_DEBUGEVT_MSB 31u
#define M33_HFSR_DEBUGEVT_LSB 31u
#define M33_HFSR_DEBUGEVT_ACCESS "RW"
#define M33_HFSR_FORCED_RESET 0x0u
#define M33_HFSR_FORCED_BITS 0x40000000u
#define M33_HFSR_FORCED_MSB 30u
#define M33_HFSR_FORCED_LSB 30u
#define M33_HFSR_FORCED_ACCESS "RW"
#define M33_HFSR_VECTTBL_RESET 0x0u
#define M33_HFSR_VECTTBL_BITS 0x00000002u
#define M33_HFSR_VECTTBL_MSB 1u
#define M33_HFSR_VECTTBL_LSB 1u
#define M33_HFSR_VECTTBL_ACCESS "RW"
#define M33_DFSR_OFFSET 0x0000ed30u
#define M33_DFSR_BITS 0x0000001fu
#define M33_DFSR_RESET 0x00000000u
#define M33_DFSR_EXTERNAL_RESET 0x0u
#define M33_DFSR_EXTERNAL_BITS 0x00000010u
#define M33_DFSR_EXTERNAL_MSB 4u
#define M33_DFSR_EXTERNAL_LSB 4u
#define M33_DFSR_EXTERNAL_ACCESS "RW"
#define M33_DFSR_VCATCH_RESET 0x0u
#define M33_DFSR_VCATCH_BITS 0x00000008u
#define M33_DFSR_VCATCH_MSB 3u
#define M33_DFSR_VCATCH_LSB 3u
#define M33_DFSR_VCATCH_ACCESS "RW"
#define M33_DFSR_DWTTRAP_RESET 0x0u
#define M33_DFSR_DWTTRAP_BITS 0x00000004u
#define M33_DFSR_DWTTRAP_MSB 2u
#define M33_DFSR_DWTTRAP_LSB 2u
#define M33_DFSR_DWTTRAP_ACCESS "RW"
#define M33_DFSR_BKPT_RESET 0x0u
#define M33_DFSR_BKPT_BITS 0x00000002u
#define M33_DFSR_BKPT_MSB 1u
#define M33_DFSR_BKPT_LSB 1u
#define M33_DFSR_BKPT_ACCESS "RW"
#define M33_DFSR_HALTED_RESET 0x0u
#define M33_DFSR_HALTED_BITS 0x00000001u
#define M33_DFSR_HALTED_MSB 0u
#define M33_DFSR_HALTED_LSB 0u
#define M33_DFSR_HALTED_ACCESS "RW"
#define M33_MMFAR_OFFSET 0x0000ed34u
#define M33_MMFAR_BITS 0xffffffffu
#define M33_MMFAR_RESET 0x00000000u
#define M33_MMFAR_ADDRESS_RESET 0x00000000u
#define M33_MMFAR_ADDRESS_BITS 0xffffffffu
#define M33_MMFAR_ADDRESS_MSB 31u
#define M33_MMFAR_ADDRESS_LSB 0u
#define M33_MMFAR_ADDRESS_ACCESS "RW"
#define M33_BFAR_OFFSET 0x0000ed38u
#define M33_BFAR_BITS 0xffffffffu
#define M33_BFAR_RESET 0x00000000u
#define M33_BFAR_ADDRESS_RESET 0x00000000u
#define M33_BFAR_ADDRESS_BITS 0xffffffffu
#define M33_BFAR_ADDRESS_MSB 31u
#define M33_BFAR_ADDRESS_LSB 0u
#define M33_BFAR_ADDRESS_ACCESS "RW"
#define M33_ID_PFR0_OFFSET 0x0000ed40u
#define M33_ID_PFR0_BITS 0x000000ffu
#define M33_ID_PFR0_RESET 0x00000030u
#define M33_ID_PFR0_STATE1_RESET 0x3u
#define M33_ID_PFR0_STATE1_BITS 0x000000f0u
#define M33_ID_PFR0_STATE1_MSB 7u
#define M33_ID_PFR0_STATE1_LSB 4u
#define M33_ID_PFR0_STATE1_ACCESS "RO"
#define M33_ID_PFR0_STATE0_RESET 0x0u
#define M33_ID_PFR0_STATE0_BITS 0x0000000fu
#define M33_ID_PFR0_STATE0_MSB 3u
#define M33_ID_PFR0_STATE0_LSB 0u
#define M33_ID_PFR0_STATE0_ACCESS "RO"
#define M33_ID_PFR1_OFFSET 0x0000ed44u
#define M33_ID_PFR1_BITS 0x00000ff0u
#define M33_ID_PFR1_RESET 0x00000520u
#define M33_ID_PFR1_MPROGMOD_RESET 0x5u
#define M33_ID_PFR1_MPROGMOD_BITS 0x00000f00u
#define M33_ID_PFR1_MPROGMOD_MSB 11u
#define M33_ID_PFR1_MPROGMOD_LSB 8u
#define M33_ID_PFR1_MPROGMOD_ACCESS "RO"
#define M33_ID_PFR1_SECURITY_RESET 0x2u
#define M33_ID_PFR1_SECURITY_BITS 0x000000f0u
#define M33_ID_PFR1_SECURITY_MSB 7u
#define M33_ID_PFR1_SECURITY_LSB 4u
#define M33_ID_PFR1_SECURITY_ACCESS "RO"
#define M33_ID_DFR0_OFFSET 0x0000ed48u
#define M33_ID_DFR0_BITS 0x00f00000u
#define M33_ID_DFR0_RESET 0x00200000u
#define M33_ID_DFR0_MPROFDBG_RESET 0x2u
#define M33_ID_DFR0_MPROFDBG_BITS 0x00f00000u
#define M33_ID_DFR0_MPROFDBG_MSB 23u
#define M33_ID_DFR0_MPROFDBG_LSB 20u
#define M33_ID_DFR0_MPROFDBG_ACCESS "RO"
#define M33_ID_AFR0_OFFSET 0x0000ed4cu
#define M33_ID_AFR0_BITS 0x0000ffffu
#define M33_ID_AFR0_RESET 0x00000000u
#define M33_ID_AFR0_IMPDEF3_RESET 0x0u
#define M33_ID_AFR0_IMPDEF3_BITS 0x0000f000u
#define M33_ID_AFR0_IMPDEF3_MSB 15u
#define M33_ID_AFR0_IMPDEF3_LSB 12u
#define M33_ID_AFR0_IMPDEF3_ACCESS "RO"
#define M33_ID_AFR0_IMPDEF2_RESET 0x0u
#define M33_ID_AFR0_IMPDEF2_BITS 0x00000f00u
#define M33_ID_AFR0_IMPDEF2_MSB 11u
#define M33_ID_AFR0_IMPDEF2_LSB 8u
#define M33_ID_AFR0_IMPDEF2_ACCESS "RO"
#define M33_ID_AFR0_IMPDEF1_RESET 0x0u
#define M33_ID_AFR0_IMPDEF1_BITS 0x000000f0u
#define M33_ID_AFR0_IMPDEF1_MSB 7u
