gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define M33_SAU_CTRL_BITS 0x00000003u
#define M33_SAU_CTRL_RESET 0x00000000u
#define M33_SAU_CTRL_ALLNS_RESET 0x0u
#define M33_SAU_CTRL_ALLNS_BITS 0x00000002u
#define M33_SAU_CTRL_ALLNS_MSB 1u
#define M33_SAU_CTRL_ALLNS_LSB 1u
#define M33_SAU_CTRL_ALLNS_ACCESS "RW"
#define M33_SAU_CTRL_ENABLE_RESET 0x0u
#define M33_SAU_CTRL_ENABLE_BITS 0x00000001u
#define M33_SAU_CTRL_ENABLE_MSB 0u
#define M33_SAU_CTRL_ENABLE_LSB 0u
#define M33_SAU_CTRL_ENABLE_ACCESS "RW"
#define M33_SAU_TYPE_OFFSET 0x0000edd4u
#define M33_SAU_TYPE_BITS 0x000000ffu
#define M33_SAU_TYPE_RESET 0x00000008u
#define M33_SAU_TYPE_SREGION_RESET 0x08u
#define M33_SAU_TYPE_SREGION_BITS 0x000000ffu
#define M33_SAU_TYPE_SREGION_MSB 7u
#define M33_SAU_TYPE_SREGION_LSB 0u
#define M33_SAU_TYPE_SREGION_ACCESS "RO"
#define M33_SAU_RNR_OFFSET 0x0000edd8u
#define M33_SAU_RNR_BITS 0x000000ffu
#define M33_SAU_RNR_RESET 0x00000000u
#define M33_SAU_RNR_REGION_RESET 0x00u
#define M33_SAU_RNR_REGION_BITS 0x000000ffu
#define M33_SAU_RNR_REGION_MSB 7u
#define M33_SAU_RNR_REGION_LSB 0u
#define M33_SAU_RNR_REGION_ACCESS "RW"
#define M33_SAU_RBAR_OFFSET 0x0000eddcu
#define M33_SAU_RBAR_BITS 0xffffffe0u
#define M33_SAU_RBAR_RESET 0x00000000u
#define M33_SAU_RBAR_BADDR_RESET 0x0000000u
#define M33_SAU_RBAR_BADDR_BITS 0xffffffe0u
#define M33_SAU_RBAR_BADDR_MSB 31u
#define M33_SAU_RBAR_BADDR_LSB 5u
#define M33_SAU_RBAR_BADDR_ACCESS "RW"
#define M33_SAU_RLAR_OFFSET 0x0000ede0u
#define M33_SAU_RLAR_BITS 0xffffffe3u
#define M33_SAU_RLAR_RESET 0x00000000u
#define M33_SAU_RLAR_LADDR_RESET 0x0000000u
#define M33_SAU_RLAR_LADDR_BITS 0xffffffe0u
#define M33_SAU_RLAR_LADDR_MSB 31u
#define M33_SAU_RLAR_LADDR_LSB 5u
#define M33_SAU_RLAR_LADDR_ACCESS "RW"
#define M33_SAU_RLAR_NSC_RESET 0x0u
#define M33_SAU_RLAR_NSC_BITS 0x00000002u
#define M33_SAU_RLAR_NSC_MSB 1u
#define M33_SAU_RLAR_NSC_LSB 1u
#define M33_SAU_RLAR_NSC_ACCESS "RW"
#define M33_SAU_RLAR_ENABLE_RESET 0x0u
#define M33_SAU_RLAR_ENABLE_BITS 0x00000001u
#define M33_SAU_RLAR_ENABLE_MSB 0u
#define M33_SAU_RLAR_ENABLE_LSB 0u
#define M33_SAU_RLAR_ENABLE_ACCESS "RW"
#define M33_SFSR_OFFSET 0x0000ede4u
#define M33_SFSR_BITS 0x000000ffu
#define M33_SFSR_RESET 0x00000000u
#define M33_SFSR_LSERR_RESET 0x0u
#define M33_SFSR_LSERR_BITS 0x00000080u
#define M33_SFSR_LSERR_MSB 7u
#define M33_SFSR_LSERR_LSB 7u
#define M33_SFSR_LSERR_ACCESS "RW"
#define M33_SFSR_SFARVALID_RESET 0x0u
#define M33_SFSR_SFARVALID_BITS 0x00000040u
#define M33_SFSR_SFARVALID_MSB 6u
#define M33_SFSR_SFARVALID_LSB 6u
#define M33_SFSR_SFARVALID_ACCESS "RW"
#define M33_SFSR_LSPERR_RESET 0x0u
#define M33_SFSR_LSPERR_BITS 0x00000020u
#define M33_SFSR_LSPERR_MSB 5u
#define M33_SFSR_LSPERR_LSB 5u
#define M33_SFSR_LSPERR_ACCESS "RW"
#define M33_SFSR_INVTRAN_RESET 0x0u
#define M33_SFSR_INVTRAN_BITS 0x00000010u
#define M33_SFSR_INVTRAN_MSB 4u
#define M33_SFSR_INVTRAN_LSB 4u
#define M33_SFSR_INVTRAN_ACCESS "RW"
#define M33_SFSR_AUVIOL_RESET 0x0u
#define M33_SFSR_AUVIOL_BITS 0x00000008u
#define M33_SFSR_AUVIOL_MSB 3u
#define M33_SFSR_AUVIOL_LSB 3u
#define M33_SFSR_AUVIOL_ACCESS "RW"
#define M33_SFSR_INVER_RESET 0x0u
#define M33_SFSR_INVER_BITS 0x00000004u
#define M33_SFSR_INVER_MSB 2u
#define M33_SFSR_INVER_LSB 2u
#define M33_SFSR_INVER_ACCESS "RW"
#define M33_SFSR_INVIS_RESET 0x0u
#define M33_SFSR_INVIS_BITS 0x00000002u
#define M33_SFSR_INVIS_MSB 1u
#define M33_SFSR_INVIS_LSB 1u
#define M33_SFSR_INVIS_ACCESS "RW"
#define M33_SFSR_INVEP_RESET 0x0u
#define M33_SFSR_INVEP_BITS 0x00000001u
#define M33_SFSR_INVEP_MSB 0u
#define M33_SFSR_INVEP_LSB 0u
#define M33_SFSR_INVEP_ACCESS "RW"
#define M33_SFAR_OFFSET 0x0000ede8u
#define M33_SFAR_BITS 0xffffffffu
#define M33_SFAR_RESET 0x00000000u
#define M33_SFAR_ADDRESS_RESET 0x00000000u
#define M33_SFAR_ADDRESS_BITS 0xffffffffu
#define M33_SFAR_ADDRESS_MSB 31u
#define M33_SFAR_ADDRESS_LSB 0u
#define M33_SFAR_ADDRESS_ACCESS "RW"
#define M33_DHCSR_OFFSET 0x0000edf0u
#define M33_DHCSR_BITS 0x071f002fu
#define M33_DHCSR_RESET 0x00000000u
#define M33_DHCSR_S_RESTART_ST_RESET 0x0u
#define M33_DHCSR_S_RESTART_ST_BITS 0x04000000u
#define M33_DHCSR_S_RESTART_ST_MSB 26u
#define M33_DHCSR_S_RESTART_ST_LSB 26u
#define M33_DHCSR_S_RESTART_ST_ACCESS "RO"
#define M33_DHCSR_S_RESET_ST_RESET 0x0u
#define M33_DHCSR_S_RESET_ST_BITS 0x02000000u
#define M33_DHCSR_S_RESET_ST_MSB 25u
#define M33_DHCSR_S_RESET_ST_LSB 25u
#define M33_DHCSR_S_RESET_ST_ACCESS "RO"
#define M33_DHCSR_S_RETIRE_ST_RESET 0x0u
#define M33_DHCSR_S_RETIRE_ST_BITS 0x01000000u
#define M33_DHCSR_S_RETIRE_ST_MSB 24u
#define M33_DHCSR_S_RETIRE_ST_LSB 24u
#define M33_DHCSR_S_RETIRE_ST_ACCESS "RO"
#define M33_DHCSR_S_SDE_RESET 0x0u
#define M33_DHCSR_S_SDE_BITS 0x00100000u
#define M33_DHCSR_S_SDE_MSB 20u
#define M33_DHCSR_S_SDE_LSB 20u
#define M33_DHCSR_S_SDE_ACCESS "RO"
#define M33_DHCSR_S_LOCKUP_RESET 0x0u
#define M33_DHCSR_S_LOCKUP_BITS 0x00080000u
#define M33_DHCSR_S_LOCKUP_MSB 19u
#define M33_DHCSR_S_LOCKUP_LSB 19u
#define M33_DHCSR_S_LOCKUP_ACCESS "RO"
#define M33_DHCSR_S_SLEEP_RESET 0x0u
#define M33_DHCSR_S_SLEEP_BITS 0x00040000u
#define M33_DHCSR_S_SLEEP_MSB 18u
#define M33_DHCSR_S_SLEEP_LSB 18u
#define M33_DHCSR_S_SLEEP_ACCESS "RO"
#define M33_DHCSR_S_HALT_RESET 0x0u
#define M33_DHCSR_S_HALT_BITS 0x00020000u
#define M33_DHCSR_S_HALT_MSB 17u
#define M33_DHCSR_S_HALT_LSB 17u
#define M33_DHCSR_S_HALT_ACCESS "RO"
#define M33_DHCSR_S_REGRDY_RESET 0x0u
#define M33_DHCSR_S_REGRDY_BITS 0x00010000u
#define M33_DHCSR_S_REGRDY_MSB 16u
#define M33_DHCSR_S_REGRDY_LSB 16u
#define M33_DHCSR_S_REGRDY_ACCESS "RO"
#define M33_DHCSR_C_SNAPSTALL_RESET 0x0u
#define M33_DHCSR_C_SNAPSTALL_BITS 0x00000020u
#define M33_DHCSR_C_SNAPSTALL_MSB 5u
#define M33_DHCSR_C_SNAPSTALL_LSB 5u
#define M33_DHCSR_C_SNAPSTALL_ACCESS "RW"
#define M33_DHCSR_C_MASKINTS_RESET 0x0u
#define M33_DHCSR_C_MASKINTS_BITS 0x00000008u
#define M33_DHCSR_C_MASKINTS_MSB 3u
#define M33_DHCSR_C_MASKINTS_LSB 3u
#define M33_DHCSR_C_MASKINTS_ACCESS "RW"
#define M33_DHCSR_C_STEP_RESET 0x0u
#define M33_DHCSR_C_STEP_BITS 0x00000004u
#define M33_DHCSR_C_STEP_MSB 2u
#define M33_DHCSR_C_STEP_LSB 2u
#define M33_DHCSR_C_STEP_ACCESS "RW"
#define M33_DHCSR_C_HALT_RESET 0x0u
#define M33_DHCSR_C_HALT_BITS 0x00000002u
#define M33_DHCSR_C_HALT_MSB 1u
#define M33_DHCSR_C_HALT_LSB 1u
#define M33_DHCSR_C_HALT_ACCESS "RW"
#define M33_DHCSR_C_DEBUGEN_RESET 0x0u
#define M33_DHCSR_C_DEBUGEN_BITS 0x00000001u
#define M33_DHCSR_C_DEBUGEN_MSB 0u
#define M33_DHCSR_C_DEBUGEN_LSB 0u
#define M33_DHCSR_C_DEBUGEN_ACCESS "RW"
#define M33_DCRSR_OFFSET 0x0000edf4u
#define M33_DCRSR_BITS 0x0001007fu
#define M33_DCRSR_RESET 0x00000000u
#define M33_DCRSR_REGWNR_RESET 0x0u
#define M33_DCRSR_REGWNR_BITS 0x00010000u
#define M33_DCRSR_REGWNR_MSB 16u
#define M33_DCRSR_REGWNR_LSB 16u
#define M33_DCRSR_REGWNR_ACCESS "RW"
#define M33_DCRSR_REGSEL_RESET 0x00u
#define M33_DCRSR_REGSEL_BITS 0x0000007fu
#define M33_DCRSR_REGSEL_MSB 6u
#define M33_DCRSR_REGSEL_LSB 0u
#define M33_DCRSR_REGSEL_ACCESS "RW"
#define M33_DCRDR_OFFSET 0x0000edf8u
#define M33_DCRDR_BITS 0xffffffffu
#define M33_DCRDR_RESET 0x00000000u
#define M33_DCRDR_DBGTMP_RESET 0x00000000u
#define M33_DCRDR_DBGTMP_BITS 0xffffffffu
#define M33_DCRDR_DBGTMP_MSB 31u
#define M33_DCRDR_DBGTMP_LSB 0u
#define M33_DCRDR_DBGTMP_ACCESS "RW"
#define M33_DEMCR_OFFSET 0x0000edfcu
#define M33_DEMCR_BITS 0x011f0ff1u
#define M33_DEMCR_RESET 0x00000000u
#define M33_DEMCR_TRCENA_RESET 0x0u
#define M33_DEMCR_TRCENA_BITS 0x01000000u
#define M33_DEMCR_TRCENA_MSB 24u
#define M33_DEMCR_TRCENA_LSB 24u
#define M33_DEMCR_TRCENA_ACCESS "RW"
#define M33_DEMCR_SDME_RESET 0x0u
#define M33_DEMCR_SDME_BITS 0x00100000u
#define M33_DEMCR_SDME_MSB 20u
#define M33_DEMCR_SDME_LSB 20u
#define M33_DEMCR_SDME_ACCESS "RO"
#define M33_DEMCR_MON_REQ_RESET 0x0u
#define M33_DEMCR_MON_REQ_BITS 0x00080000u
#define M33_DEMCR_MON_REQ_MSB 19u
#define M33_DEMCR_MON_REQ_LSB 19u
#define M33_DEMCR_MON_REQ_ACCESS "RW"
#define M33_DEMCR_MON_STEP_RESET 0x0u
#define M33_DEMCR_MON_STEP_BITS 0x00040000u
#define M33_DEMCR_MON_STEP_MSB 18u
#define M33_DEMCR_MON_STEP_LSB 18u
#define M33_DEMCR_MON_STEP_ACCESS "RW"
#define M33_DEMCR_MON_PEND_RESET 0x0u
#define M33_DEMCR_MON_PEND_BITS 0x00020000u
#define M33_DEMCR_MON_PEND_MSB 17u
#define M33_DEMCR_MON_PEND_LSB 17u
#define M33_DEMCR_MON_PEND_ACCESS "RW"
#define M33_DEMCR_MON_EN_RESET 0x0u
#define M33_DEMCR_MON_EN_BITS 0x00010000u
#define M33_DEMCR_MON_EN_MSB 16u
#define M33_DEMCR_MON_EN_LSB 16u
#define M33_DEMCR_MON_EN_ACCESS "RW"
#define M33_DEMCR_VC_SFERR_RESET 0x0u
#define M33_DEMCR_VC_SFERR_BITS 0x00000800u
#define M33_DEMCR_VC_SFERR_MSB 11u
#define M33_DEMCR_VC_SFERR_LSB 11u
#define M33_DEMCR_VC_SFERR_ACCESS "RW"
#define M33_DEMCR_VC_HARDERR_RESET 0x0u
#define M33_DEMCR_VC_HARDERR_BITS 0x00000400u
#define M33_DEMCR_VC_HARDERR_MSB 10u
#define M33_DEMCR_VC_HARDERR_LSB 10u
#define M33_DEMCR_VC_HARDERR_ACCESS "RW"
#define M33_DEMCR_VC_INTERR_RESET 0x0u
#define M33_DEMCR_VC_INTERR_BITS 0x00000200u
#define M33_DEMCR_VC_INTERR_MSB 9u
#define M33_DEMCR_VC_INTERR_LSB 9u
#define M33_DEMCR_VC_INTERR_ACCESS "RW"
#define M33_DEMCR_VC_BUSERR_RESET 0x0u
#define M33_DEMCR_VC_BUSERR_BITS 0x00000100u
#define M33_DEMCR_VC_BUSERR_MSB 8u
#define M33_DEMCR_VC_BUSERR_LSB 8u
#define M33_DEMCR_VC_BUSERR_ACCESS "RW"
#define M33_DEMCR_VC_STATERR_RESET 0x0u
#define M33_DEMCR_VC_STATERR_BITS 0x00000080u
#define M33_DEMCR_VC_STATERR_MSB 7u
#define M33_DEMCR_VC_STATERR_LSB 7u
#define M33_DEMCR_VC_STATERR_ACCESS "RW"
#define M33_DEMCR_VC_CHKERR_RESET 0x0u
#define M33_DEMCR_VC_CHKERR_BITS 0x00000040u
#define M33_DEMCR_VC_CHKERR_MSB 6u
#define M33_DEMCR_VC_CHKERR_LSB 6u
#define M33_DEMCR_VC_CHKERR_ACCESS "RW"
#define M33_DEMCR_VC_NOCPERR_RESET 0x0u
#define M33_DEMCR_VC_NOCPERR_BITS 0x00000020u
#define M33_DEMCR_VC_NOCPERR_MSB 5u
#define M33_DEMCR_VC_NOCPERR_LSB 5u
#define M33_DEMCR_VC_NOCPERR_ACCESS "RW"
#define M33_DEMCR_VC_MMERR_RESET 0x0u
#define M33_DEMCR_VC_MMERR_BITS 0x00000010u
#define M33_DEMCR_VC_MMERR_MSB 4u
#define M33_DEMCR_VC_MMERR_LSB 4u
#define M33_DEMCR_VC_MMERR_ACCESS "RW"
#define M33_DEMCR_VC_CORERESET_RESET 0x0u
#define M33_DEMCR_VC_CORERESET_BITS 0x00000001u
#define M33_DEMCR_VC_CORERESET_MSB 0u
#define M33_DEMCR_VC_CORERESET_LSB 0u
#define M33_DEMCR_VC_CORERESET_ACCESS "RW"
#define M33_DSCSR_OFFSET 0x0000ee08u
#define M33_DSCSR_BITS 0x00030003u
#define M33_DSCSR_RESET 0x00000000u
#define M33_DSCSR_CDSKEY_RESET 0x0u
#define M33_DSCSR_CDSKEY_BITS 0x00020000u
#define M33_DSCSR_CDSKEY_MSB 17u
#define M33_DSCSR_CDSKEY_LSB 17u
#define M33_DSCSR_CDSKEY_ACCESS "RW"
#define M33_DSCSR_CDS_RESET 0x0u
#define M33_DSCSR_CDS_BITS 0x00010000u
#define M33_DSCSR_CDS_MSB 16u
#define M33_DSCSR_CDS_LSB 16u
#define M33_DSCSR_CDS_ACCESS "RW"
#define M33_DSCSR_SBRSEL_RESET 0x0u
#define M33_DSCSR_SBRSEL_BITS 0x00000002u
#define M33_DSCSR_SBRSEL_MSB 1u
#define M33_DSCSR_SBRSEL_LSB 1u
#define M33_DSCSR_SBRSEL_ACCESS "RW"
#define M33_DSCSR_SBRSELEN_RESET 0x0u
#define M33_DSCSR_SBRSELEN_BITS 0x00000001u
#define M33_DSCSR_SBRSELEN_MSB 0u
#define M33_DSCSR_SBRSELEN_LSB 0u
#define M33_DSCSR_SBRSELEN_ACCESS "RW"
#define M33_STIR_OFFSET 0x0000ef00u
#define M33_STIR_BITS 0x000001ffu
#define M33_STIR_RESET 0x00000000u
#define M33_STIR_INTID_RESET 0x000u
#define M33_STIR_INTID_BITS 0x000001ffu
#define M33_STIR_INTID_MSB 8u
#define M33_STIR_INTID_LSB 0u
#define M33_STIR_INTID_ACCESS "RW"
#define M33_FPCCR_OFFSET 0x0000ef34u
#define M33_FPCCR_BITS 0xfc0007ffu
#define M33_FPCCR_RESET 0x20000472u
#define M33_FPCCR_ASPEN_RESET 0x0u
#define M33_FPCCR_ASPEN_BITS 0x80000000u
#define M33_FPCCR_ASPEN_MSB 31u
#define M33_FPCCR_ASPEN_LSB 31u
#define M33_FPCCR_ASPEN_ACCESS "RW"
#define M33_FPCCR_LSPEN_RESET 0x0u
#define M33_FPCCR_LSPEN_BITS 0x40000000u
#define M33_FPCCR_LSPEN_MSB 30u
#define M33_FPCCR_LSPEN_LSB 30u
#define M33_FPCCR_LSPEN_ACCESS "RW"
#define M33_FPCCR_LSPENS_RESET 0x1u
#define M33_FPCCR_LSPENS_BITS 0x20000000u
#define M33_FPCCR_LSPENS_MSB 29u
#define M33_FPCCR_LSPENS_LSB 29u
#define M33_FPCCR_LSPENS_ACCESS "RW"
#define M33_FPCCR_CLRONRET_RESET 0x0u
#define M33_FPCCR_CLRONRET_BITS 0x10000000u
#define M33_FPCCR_CLRONRET_MSB 28u
#define M33_FPCCR_CLRONRET_LSB 28u
#define M33_FPCCR_CLRONRET_ACCESS "RW"
#define M33_FPCCR_CLRONRETS_RESET 0x0u
#define M33_FPCCR_CLRONRETS_BITS 0x08000000u
#define M33_FPCCR_CLRONRETS_MSB 27u
#define M33_FPCCR_CLRONRETS_LSB 27u
#define M33_FPCCR_CLRONRETS_ACCESS "RW"
#define M33_FPCCR_TS_RESET 0x0u
#define M33_FPCCR_TS_BITS 0x04000000u
#define M33_FPCCR_TS_MSB 26u
#define M33_FPCCR_TS_LSB 26u
#define M33_FPCCR_TS_ACCESS "RW"
#define M33_FPCCR_UFRDY_RESET 0x1u
#define M33_FPCCR_UFRDY_BITS 0x00000400u
#define M33_FPCCR_UFRDY_MSB 10u
#define M33_FPCCR_UFRDY_LSB 10u
#define M33_FPCCR_UFRDY_ACCESS "RW"
#define M33_FPCCR_SPLIMVIOL_RESET 0x0u
#define M33_FPCCR_SPLIMVIOL_BITS 0x00000200u
#define M33_FPCCR_SPLIMVIOL_MSB 9u
#define M33_FPCCR_SPLIMVIOL_LSB 9u
#define M33_FPCCR_SPLIMVIOL_ACCESS "RW"
#define M33_FPCCR_MONRDY_RESET 0x0u
#define M33_FPCCR_MONRDY_BITS 0x00000100u
#define M33_FPCCR_MONRDY_MSB 8u
#define M33_FPCCR_MONRDY_LSB 8u
#define M33_FPCCR_MONRDY_ACCESS "RW"
#define M33_FPCCR_SFRDY_RESET 0x0u
#define M33_FPCCR_SFRDY_BITS 0x00000080u
#define M33_FPCCR_SFRDY_MSB 7u
#define M33_FPCCR_SFRDY_LSB 7u
#define M33_FPCCR_SFRDY_ACCESS "RW"
#define M33_FPCCR_BFRDY_RESET 0x1u
#define M33_FPCCR_BFRDY_BITS 0x00000040u
#define M33_FPCCR_BFRDY_MSB 6u
#define M33_FPCCR_BFRDY_LSB 6u
#define M33_FPCCR_BFRDY_ACCESS "RW"
#define M33_FPCCR_MMRDY_RESET 0x1u
#define M33_FPCCR_MMRDY_BITS 0x00000020u
#define M33_FPCCR_MMRDY_MSB 5u
#define M33_FPCCR_MMRDY_LSB 5u
#define M33_FPCCR_MMRDY_ACCESS "RW"
#define M33_FPCCR_HFRDY_RESET 0x1u
#define M33_FPCCR_HFRDY_BITS 0x00000010u
#define M33_FPCCR_HFRDY_MSB 4u
#define M33_FPCCR_HFRDY_LSB 4u
#define M33_FPCCR_HFRDY_ACCESS "RW"
#define M33_FPCCR_THREAD_RESET 0x0u
#define M33_FPCCR_THREAD_BITS 0x00000008u
#define M33_FPCCR_THREAD_MSB 3u
#define M33_FPCCR_THREAD_LSB 3u
#define M33_FPCCR_THREAD_ACCESS "RW"
#define M33_FPCCR_S_RESET 0x0u
#define M33_FPCCR_S_BITS 0x00000004u
#define M33_FPCCR_S_MSB 2u
#define M33_FPCCR_S_LSB 2u
#define M33_FPCCR_S_ACCESS "RW"
#define M33_FPCCR_USER_RESET 0x1u
#define M33_FPCCR_USER_BITS 0x00000002u
#define M33_FPCCR_USER_MSB 1u
#define M33_FPCCR_USER_LSB 1u
#define M33_FPCCR_USER_ACCESS "RW"
#define M33_FPCCR_LSPACT_RESET 0x0u
#define M33_FPCCR_LSPACT_BITS 0x00000001u
#define M33_FPCCR_LSPACT_MSB 0u
#define M33_FPCCR_LSPACT_LSB 0u
#define M33_FPCCR_LSPACT_ACCESS "RW"
#define M33_FPCAR_OFFSET 0x0000ef38u
#define M33_FPCAR_BITS 0xfffffff8u
#define M33_FPCAR_RESET 0x00000000u
#define M33_FPCAR_ADDRESS_RESET 0x00000000u
#define M33_FPCAR_ADDRESS_BITS 0xfffffff8u
#define M33_FPCAR_ADDRESS_MSB 31u
#define M33_FPCAR_ADDRESS_LSB 3u
#define M33_FPCAR_ADDRESS_ACCESS "RW"
#define M33_FPDSCR_OFFSET 0x0000ef3cu
#define M33_FPDSCR_BITS 0x07c00000u
#define M33_FPDSCR_RESET 0x00000000u
#define M33_FPDSCR_AHP_RESET 0x0u
#define M33_FPDSCR_AHP_BITS 0x04000000u
#define M33_FPDSCR_AHP_MSB 26u
#define M33_FPDSCR_AHP_LSB 26u
#define M33_FPDSCR_AHP_ACCESS "RW"
#define M33_FPDSCR_DN_RESET 0x0u
#define M33_FPDSCR_DN_BITS 0x02000000u
#define M33_FPDSCR_DN_MSB 25u
#define M33_FPDSCR_DN_LSB 25u
#define M33_FPDSCR_DN_ACCESS "RW"
#define M33_FPDSCR_FZ_RESET 0x0u
#define M33_FPDSCR_FZ_BITS 0x01000000u
#define M33_FPDSCR_FZ_MSB 24u
#define M33_FPDSCR_FZ_LSB 24u
#define M33_FPDSCR_FZ_ACCESS "RW"
#define M33_FPDSCR_RMODE_RESET 0x0u
#define M33_FPDSCR_RMODE_BITS 0x00c00000u
#define M33_FPDSCR_RMODE_MSB 23u
#define M33_FPDSCR_RMODE_LSB 22u
#define M33_FPDSCR_RMODE_ACCESS "RW"
#define M33_MVFR0_OFFSET 0x0000ef40u
#define M33_MVFR0_BITS 0xf0ff0fffu
#define M33_MVFR0_RESET 0x60540601u
#define M33_MVFR0_FPROUND_RESET 0x6u
#define M33_MVFR0_FPROUND_BITS 0xf0000000u
#define M33_MVFR0_FPROUND_MSB 31u
#define M33_MVFR0_FPROUND_LSB 28u
#define M33_MVFR0_FPROUND_ACCESS "RO"
#define M33_MVFR0_FPSQRT_RESET 0x5u
#define M33_MVFR0_FPSQRT_BITS 0x00f00000u
#define M33_MVFR0_FPSQRT_MSB 23u
#define M33_MVFR0_FPSQRT_LSB 20u
#define M33_MVFR0_FPSQRT_ACCESS "RO"
#define M33_MVFR0_FPDIVIDE_RESET 0x4u
#define M33_MVFR0_FPDIVIDE_BITS 0x000f0000u
#define M33_MVFR0_FPDIVIDE_MSB 19u
#define M33_MVFR0_FPDIVIDE_LSB 16u
#define M33_MVFR0_FPDIVIDE_ACCESS "RO"
#define M33_MVFR0_FPDP_RESET 0x6u
#define M33_MVFR0_FPDP_BITS 0x00000f00u
#define M33_MVFR0_FPDP_MSB 11u
#define M33_MVFR0_FPDP_LSB 8u
#define M33_MVFR0_FPDP_ACCESS "RO"
#define M33_MVFR0_FPSP_RESET 0x0u
#define M33_MVFR0_FPSP_BITS 0x000000f0u
#define M33_MVFR0_FPSP_MSB 7u
#define M33_MVFR0_FPSP_LSB 4u
#define M33_MVFR0_FPSP_ACCESS "RO"
#define M33_MVFR0_SIMDREG_RESET 0x1u
#define M33_MVFR0_SIMDREG_BITS 0x0000000fu
#define M33_MVFR0_SIMDREG_MSB 3u
#define M33_MVFR0_SIMDREG_LSB 0u
#define M33_MVFR0_SIMDREG_ACCESS "RO"
#define M33_MVFR1_OFFSET 0x0000ef44u
#define M33_MVFR1_BITS 0xff0000ffu
#define M33_MVFR1_RESET 0x85000089u
#define M33_MVFR1_FMAC_RESET 0x8u
#define M33_MVFR1_FMAC_BITS 0xf0000000u
#define M33_MVFR1_FMAC_MSB 31u
#define M33_MVFR1_FMAC_LSB 28u
#define M33_MVFR1_FMAC_ACCESS "RO"
#define M33_MVFR1_FPHP_RESET 0x5u
#define M33_MVFR1_FPHP_BITS 0x0f000000u
#define M33_MVFR1_FPHP_MSB 27u
#define M33_MVFR1_FPHP_LSB 24u
#define M33_MVFR1_FPHP_ACCESS "RO"
#define M33_MVFR1_FPDNAN_RESET 0x8u
#define M33_MVFR1_FPDNAN_BITS 0x000000f0u
#define M33_MVFR1_FPDNAN_MSB 7u
#define M33_MVFR1_FPDNAN_LSB 4u
#define M33_MVFR1_FPDNAN_ACCESS "RO"
#define M33_MVFR1_FPFTZ_RESET 0x9u
#define M33_MVFR1_FPFTZ_BITS 0x0000000fu
#define M33_MVFR1_FPFTZ_MSB 3u
#define M33_MVFR1_FPFTZ_LSB 0u
#define M33_MVFR1_FPFTZ_ACCESS "RO"
#define M33_MVFR2_OFFSET 0x0000ef48u
#define M33_MVFR2_BITS 0x000000f0u
#define M33_MVFR2_RESET 0x00000060u
#define M33_MVFR2_FPMISC_RESET 0x6u
#define M33_MVFR2_FPMISC_BITS 0x000000f0u
#define M33_MVFR2_FPMISC_MSB 7u
#define M33_MVFR2_FPMISC_LSB 4u
#define M33_MVFR2_FPMISC_ACCESS "RO"
#define M33_DDEVARCH_OFFSET 0x0000efbcu
#define M33_DDEVARCH_BITS 0xffffffffu
#define M33_DDEVARCH_RESET 0x47702a04u
#define M33_DDEVARCH_ARCHITECT_RESET 0x23bu
#define M33_DDEVARCH_ARCHITECT_BITS 0xffe00000u
#define M33_DDEVARCH_ARCHITECT_MSB 31u
#define M33_DDEVARCH_ARCHITECT_LSB 21u
#define M33_DDEVARCH_ARCHITECT_ACCESS "RO"
#define M33_DDEVARCH_PRESENT_RESET 0x1u
#define M33_DDEVARCH_PRESENT_BITS 0x00100000u
#define M33_DDEVARCH_PRESENT_MSB 20u
#define M33_DDEVARCH_PRESENT_LSB 20u
#define M33_DDEVARCH_PRESENT_ACCESS "RO"
#define M33_DDEVARCH_REVISION_RESET 0x0u
#define M33_DDEVARCH_REVISION_BITS 0x000f0000u
#define M33_DDEVARCH_REVISION_MSB 19u
#define M33_DDEVARCH_REVISION_LSB 16u
#define M33_DDEVARCH_REVISION_ACCESS "RO"
#define M33_DDEVARCH_ARCHVER_RESET 0x2u
#define M33_DDEVARCH_ARCHVER_BITS 0x0000f000u
#define M33_DDEVARCH_ARCHVER_MSB 15u
#define M33_DDEVARCH_ARCHVER_LSB 12u
#define M33_DDEVARCH_ARCHVER_ACCESS "RO"
#define M33_DDEVARCH_ARCHPART_RESET 0xa04u
#define M33_DDEVARCH_ARCHPART_BITS 0x00000fffu
#define M33_DDEVARCH_ARCHPART_MSB 11u
#define M33_DDEVARCH_ARCHPART_LSB 0u
#define M33_DDEVARCH_ARCHPART_ACCESS "RO"
#define M33_DDEVTYPE_OFFSET 0x0000efccu
#define M33_DDEVTYPE_BITS 0x000000ffu
#define M33_DDEVTYPE_RESET 0x00000000u
#define M33_DDEVTYPE_SUB_RESET 0x0u
#define M33_DDEVTYPE_SUB_BITS 0x000000f0u
#define M33_DDEVTYPE_SUB_MSB 7u
#define M33_DDEVTYPE_SUB_LSB 4u
#define M33_DDEVTYPE_SUB_ACCESS "RO"
#define M33_DDEVTYPE_MAJOR_RESET 0x0u
#define M33_DDEVTYPE_MAJOR_BITS 0x0000000fu
#define M33_DDEVTYPE_MAJOR_MSB 3u
#define M33_DDEVTYPE_MAJOR_LSB 0u
#define M33_DDEVTYPE_MAJOR_ACCESS "RO"
#define M33_DPIDR4_OFFSET 0x0000efd0u
#define M33_DPIDR4_BITS 0x000000ffu
#define M33_DPIDR4_RESET 0x00000004u
#define M33_DPIDR4_SIZE_RESET 0x0u
#define M33_DPIDR4_SIZE_BITS 0x000000f0u
#define M33_DPIDR4_SIZE_MSB 7u
#define M33_DPIDR4_SIZE_LSB 4u
#define M33_DPIDR4_SIZE_ACCESS "RO"
#define M33_DPIDR4_DES_2_RESET 0x4u
#define M33_DPIDR4_DES_2_BITS 0x0000000fu
#define M33_DPIDR4_DES_2_MSB 3u
#define M33_DPIDR4_DES_2_LSB 0u
#define M33_DPIDR4_DES_2_ACCESS "RO"
#define M33_DPIDR5_OFFSET 0x0000efd4u
#define M33_DPIDR5_BITS 0x00000000u
#define M33_DPIDR5_RESET 0x00000000u
#define M33_DPIDR5_MSB 31u
#define M33_DPIDR5_LSB 0u
#define M33_DPIDR5_ACCESS "RW"
#define M33_DPIDR6_OFFSET 0x0000efd8u
#define M33_DPIDR6_BITS 0x00000000u
#define M33_DPIDR6_RESET 0x00000000u
#define M33_DPIDR6_MSB 31u
#define M33_DPIDR6_LSB 0u
#define M33_DPIDR6_ACCESS "RW"
#define M33_DPIDR7_OFFSET 0x0000efdcu
#define M33_DPIDR7_BITS 0x00000000u
#define M33_DPIDR7_RESET 0x00000000u
#define M33_DPIDR7_MSB 31u
#define M33_DPIDR7_LSB 0u
#define M33_DPIDR7_ACCESS "RW"
#define M33_DPIDR0_OFFSET 0x0000efe0u
#define M33_DPIDR0_BITS 0x000000ffu
#define M33_DPIDR0_RESET 0x00000021u
#define M33_DPIDR0_PART_0_RESET 0x21u
#define M33_DPIDR0_PART_0_BITS 0x000000ffu
#define M33_DPIDR0_PART_0_MSB 7u
#define M33_DPIDR0_PART_0_LSB 0u
#define M33_DPIDR0_PART_0_ACCESS "RO"
#define M33_DPIDR1_OFFSET 0x0000efe4u
#define M33_DPIDR1_BITS 0x000000ffu
#define M33_DPIDR1_RESET 0x000000bdu
#define M33_DPIDR1_DES_0_RESET 0xbu
#define M33_DPIDR1_DES_0_BITS 0x000000f0u
#define M33_DPIDR1_DES_0_MSB 7u
#define M33_DPIDR1_DES_0_LSB 4u
#define M33_DPIDR1_DES_0_ACCESS "RO"
#define M33_DPIDR1_PART_1_RESET 0xdu
#define M33_DPIDR1_PART_1_BITS 0x0000000fu
#define M33_DPIDR1_PART_1_MSB 3u
#define M33_DPIDR1_PART_1_LSB 0u
#define M33_DPIDR1_PART_1_ACCESS "RO"
#define M33_DPIDR2_OFFSET 0x0000efe8u
#define M33_DPIDR2_BITS 0x000000ffu
#define M33_DPIDR2_RESET 0x0000000bu
#define M33_DPIDR2_REVISION_RESET 0x0u
#define M33_DPIDR2_REVISION_BITS 0x000000f0u
#define M33_DPIDR2_REVISION_MSB 7u
#define M33_DPIDR2_REVISION_LSB 4u
#define M33_DPIDR2_REVISION_ACCESS "RO"
#define M33_DPIDR2_JEDEC_RESET 0x1u
#define M33_DPIDR2_JEDEC_BITS 0x00000008u
#define M33_DPIDR2_JEDEC_MSB 3u
#define M33_DPIDR2_JEDEC_LSB 3u
#define M33_DPIDR2_JEDEC_ACCESS "RO"
#define M33_DPIDR2_DES_1_RESET 0x3u
#define M33_DPIDR2_DES_1_BITS 0x00000007u
#define M33_DPIDR2_DES_1_MSB 2u
#define M33_DPIDR2_DES_1_LSB 0u
#define M33_DPIDR2_DES_1_ACCESS "RO"
#define M33_DPIDR3_OFFSET 0x0000efecu
#define M33_DPIDR3_BITS 0x000000ffu
#define M33_DPIDR3_RESET 0x00000000u
#define M33_DPIDR3_REVAND_RESET 0x0u
#define M33_DPIDR3_REVAND_BITS 0x000000f0u
#define M33_DPIDR3_REVAND_MSB 7u
#define M33_DPIDR3_REVAND_LSB 4u
#define M33_DPIDR3_REVAND_ACCESS "RO"
#define M33_DPIDR3_CMOD_RESET 0x0u
#define M33_DPIDR3_CMOD_BITS 0x0000000fu
#define M33_DPIDR3_CMOD_MSB 3u
#define M33_DPIDR3_CMOD_LSB 0u
#define M33_DPIDR3_CMOD_ACCESS "RO"
#define M33_DCIDR0_OFFSET 0x0000eff0u
#define M33_DCIDR0_BITS 0x000000ffu
#define M33_DCIDR0_RESET 0x0000000du
#define M33_DCIDR0_PRMBL_0_RESET 0x0du
#define M33_DCIDR0_PRMBL_0_BITS 0x000000ffu
#define M33_DCIDR0_PRMBL_0_MSB 7u
#define M33_DCIDR0_PRMBL_0_LSB 0u
#define M33_DCIDR0_PRMBL_0_ACCESS "RO"
#define M33_DCIDR1_OFFSET 0x0000eff4u
#define M33_DCIDR1_BITS 0x000000ffu
#define M33_DCIDR1_RESET 0x00000090u
#define M33_DCIDR1_CLASS_RESET 0x9u
#define M33_DCIDR1_CLASS_BITS 0x000000f0u
#define M33_DCIDR1_CLASS_MSB 7u
#define M33_DCIDR1_CLASS_LSB 4u
#define M33_DCIDR1_CLASS_ACCESS "RO"
#define M33_DCIDR1_PRMBL_1_RESET 0x0u
#define M33_DCIDR1_PRMBL_1_BITS 0x0000000fu
#define M33_DCIDR1_PRMBL_1_MSB 3u
#define M33_DCIDR1_PRMBL_1_LSB 0u
#define M33_DCIDR1_PRMBL_1_ACCESS "RO"
#define M33_DCIDR2_OFFSET 0x0000eff8u
#define M33_DCIDR2_BITS 0x000000ffu
#define M33_DCIDR2_RESET 0x00000005u
#define M33_DCIDR2_PRMBL_2_RESET 0x05u
#define M33_DCIDR2_PRMBL_2_BITS 0x000000ffu
#define M33_DCIDR2_PRMBL_2_MSB 7u
#define M33_DCIDR2_PRMBL_2_LSB 0u
#define M33_DCIDR2_PRMBL_2_ACCESS "RO"
#define M33_DCIDR3_OFFSET 0x0000effcu
#define M33_DCIDR3_BITS 0x000000ffu
#define M33_DCIDR3_RESET 0x000000b1u
#define M33_DCIDR3_PRMBL_3_RESET 0xb1u
#define M33_DCIDR3_PRMBL_3_BITS 0x000000ffu
#define M33_DCIDR3_PRMBL_3_MSB 7u
#define M33_DCIDR3_PRMBL_3_LSB 0u
#define M33_DCIDR3_PRMBL_3_ACCESS "RO"
#define M33_TRCPRGCTLR_OFFSET 0x00041004u
#define M33_TRCPRGCTLR_BITS 0x00000001u
#define M33_TRCPRGCTLR_RESET 0x00000000u
#define M33_TRCPRGCTLR_EN_RESET 0x0u
#define M33_TRCPRGCTLR_EN_BITS 0x00000001u
