gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define M33_TRCPRGCTLR_EN_MSB 0u
#define M33_TRCPRGCTLR_EN_LSB 0u
#define M33_TRCPRGCTLR_EN_ACCESS "RW"
#define M33_TRCSTATR_OFFSET 0x0004100cu
#define M33_TRCSTATR_BITS 0x00000003u
#define M33_TRCSTATR_RESET 0x00000000u
#define M33_TRCSTATR_PMSTABLE_RESET 0x0u
#define M33_TRCSTATR_PMSTABLE_BITS 0x00000002u
#define M33_TRCSTATR_PMSTABLE_MSB 1u
#define M33_TRCSTATR_PMSTABLE_LSB 1u
#define M33_TRCSTATR_PMSTABLE_ACCESS "RO"
#define M33_TRCSTATR_IDLE_RESET 0x0u
#define M33_TRCSTATR_IDLE_BITS 0x00000001u
#define M33_TRCSTATR_IDLE_MSB 0u
#define M33_TRCSTATR_IDLE_LSB 0u
#define M33_TRCSTATR_IDLE_ACCESS "RO"
#define M33_TRCCONFIGR_OFFSET 0x00041010u
#define M33_TRCCONFIGR_BITS 0x00001ff8u
#define M33_TRCCONFIGR_RESET 0x00000000u
#define M33_TRCCONFIGR_RS_RESET 0x0u
#define M33_TRCCONFIGR_RS_BITS 0x00001000u
#define M33_TRCCONFIGR_RS_MSB 12u
#define M33_TRCCONFIGR_RS_LSB 12u
#define M33_TRCCONFIGR_RS_ACCESS "RW"
#define M33_TRCCONFIGR_TS_RESET 0x0u
#define M33_TRCCONFIGR_TS_BITS 0x00000800u
#define M33_TRCCONFIGR_TS_MSB 11u
#define M33_TRCCONFIGR_TS_LSB 11u
#define M33_TRCCONFIGR_TS_ACCESS "RW"
#define M33_TRCCONFIGR_COND_RESET 0x00u
#define M33_TRCCONFIGR_COND_BITS 0x000007e0u
#define M33_TRCCONFIGR_COND_MSB 10u
#define M33_TRCCONFIGR_COND_LSB 5u
#define M33_TRCCONFIGR_COND_ACCESS "RW"
#define M33_TRCCONFIGR_CCI_RESET 0x0u
#define M33_TRCCONFIGR_CCI_BITS 0x00000010u
#define M33_TRCCONFIGR_CCI_MSB 4u
#define M33_TRCCONFIGR_CCI_LSB 4u
#define M33_TRCCONFIGR_CCI_ACCESS "RW"
#define M33_TRCCONFIGR_BB_RESET 0x0u
#define M33_TRCCONFIGR_BB_BITS 0x00000008u
#define M33_TRCCONFIGR_BB_MSB 3u
#define M33_TRCCONFIGR_BB_LSB 3u
#define M33_TRCCONFIGR_BB_ACCESS "RW"
#define M33_TRCEVENTCTL0R_OFFSET 0x00041020u
#define M33_TRCEVENTCTL0R_BITS 0x00008787u
#define M33_TRCEVENTCTL0R_RESET 0x00000000u
#define M33_TRCEVENTCTL0R_TYPE1_RESET 0x0u
#define M33_TRCEVENTCTL0R_TYPE1_BITS 0x00008000u
#define M33_TRCEVENTCTL0R_TYPE1_MSB 15u
#define M33_TRCEVENTCTL0R_TYPE1_LSB 15u
#define M33_TRCEVENTCTL0R_TYPE1_ACCESS "RW"
#define M33_TRCEVENTCTL0R_SEL1_RESET 0x0u
#define M33_TRCEVENTCTL0R_SEL1_BITS 0x00000700u
#define M33_TRCEVENTCTL0R_SEL1_MSB 10u
#define M33_TRCEVENTCTL0R_SEL1_LSB 8u
#define M33_TRCEVENTCTL0R_SEL1_ACCESS "RW"
#define M33_TRCEVENTCTL0R_TYPE0_RESET 0x0u
#define M33_TRCEVENTCTL0R_TYPE0_BITS 0x00000080u
#define M33_TRCEVENTCTL0R_TYPE0_MSB 7u
#define M33_TRCEVENTCTL0R_TYPE0_LSB 7u
#define M33_TRCEVENTCTL0R_TYPE0_ACCESS "RW"
#define M33_TRCEVENTCTL0R_SEL0_RESET 0x0u
#define M33_TRCEVENTCTL0R_SEL0_BITS 0x00000007u
#define M33_TRCEVENTCTL0R_SEL0_MSB 2u
#define M33_TRCEVENTCTL0R_SEL0_LSB 0u
#define M33_TRCEVENTCTL0R_SEL0_ACCESS "RW"
#define M33_TRCEVENTCTL1R_OFFSET 0x00041024u
#define M33_TRCEVENTCTL1R_BITS 0x00001803u
#define M33_TRCEVENTCTL1R_RESET 0x00000000u
#define M33_TRCEVENTCTL1R_LPOVERRIDE_RESET 0x0u
#define M33_TRCEVENTCTL1R_LPOVERRIDE_BITS 0x00001000u
#define M33_TRCEVENTCTL1R_LPOVERRIDE_MSB 12u
#define M33_TRCEVENTCTL1R_LPOVERRIDE_LSB 12u
#define M33_TRCEVENTCTL1R_LPOVERRIDE_ACCESS "RW"
#define M33_TRCEVENTCTL1R_ATB_RESET 0x0u
#define M33_TRCEVENTCTL1R_ATB_BITS 0x00000800u
#define M33_TRCEVENTCTL1R_ATB_MSB 11u
#define M33_TRCEVENTCTL1R_ATB_LSB 11u
#define M33_TRCEVENTCTL1R_ATB_ACCESS "RW"
#define M33_TRCEVENTCTL1R_INSTEN1_RESET 0x0u
#define M33_TRCEVENTCTL1R_INSTEN1_BITS 0x00000002u
#define M33_TRCEVENTCTL1R_INSTEN1_MSB 1u
#define M33_TRCEVENTCTL1R_INSTEN1_LSB 1u
#define M33_TRCEVENTCTL1R_INSTEN1_ACCESS "RW"
#define M33_TRCEVENTCTL1R_INSTEN0_RESET 0x0u
#define M33_TRCEVENTCTL1R_INSTEN0_BITS 0x00000001u
#define M33_TRCEVENTCTL1R_INSTEN0_MSB 0u
#define M33_TRCEVENTCTL1R_INSTEN0_LSB 0u
#define M33_TRCEVENTCTL1R_INSTEN0_ACCESS "RW"
#define M33_TRCSTALLCTLR_OFFSET 0x0004102cu
#define M33_TRCSTALLCTLR_BITS 0x0000050cu
#define M33_TRCSTALLCTLR_RESET 0x00000000u
#define M33_TRCSTALLCTLR_INSTPRIORITY_RESET 0x0u
#define M33_TRCSTALLCTLR_INSTPRIORITY_BITS 0x00000400u
#define M33_TRCSTALLCTLR_INSTPRIORITY_MSB 10u
#define M33_TRCSTALLCTLR_INSTPRIORITY_LSB 10u
#define M33_TRCSTALLCTLR_INSTPRIORITY_ACCESS "RO"
#define M33_TRCSTALLCTLR_ISTALL_RESET 0x0u
#define M33_TRCSTALLCTLR_ISTALL_BITS 0x00000100u
#define M33_TRCSTALLCTLR_ISTALL_MSB 8u
#define M33_TRCSTALLCTLR_ISTALL_LSB 8u
#define M33_TRCSTALLCTLR_ISTALL_ACCESS "RW"
#define M33_TRCSTALLCTLR_LEVEL_RESET 0x0u
#define M33_TRCSTALLCTLR_LEVEL_BITS 0x0000000cu
#define M33_TRCSTALLCTLR_LEVEL_MSB 3u
#define M33_TRCSTALLCTLR_LEVEL_LSB 2u
#define M33_TRCSTALLCTLR_LEVEL_ACCESS "RW"
#define M33_TRCTSCTLR_OFFSET 0x00041030u
#define M33_TRCTSCTLR_BITS 0x00000083u
#define M33_TRCTSCTLR_RESET 0x00000000u
#define M33_TRCTSCTLR_TYPE0_RESET 0x0u
#define M33_TRCTSCTLR_TYPE0_BITS 0x00000080u
#define M33_TRCTSCTLR_TYPE0_MSB 7u
#define M33_TRCTSCTLR_TYPE0_LSB 7u
#define M33_TRCTSCTLR_TYPE0_ACCESS "RW"
#define M33_TRCTSCTLR_SEL0_RESET 0x0u
#define M33_TRCTSCTLR_SEL0_BITS 0x00000003u
#define M33_TRCTSCTLR_SEL0_MSB 1u
#define M33_TRCTSCTLR_SEL0_LSB 0u
#define M33_TRCTSCTLR_SEL0_ACCESS "RW"
#define M33_TRCSYNCPR_OFFSET 0x00041034u
#define M33_TRCSYNCPR_BITS 0x0000001fu
#define M33_TRCSYNCPR_RESET 0x0000000au
#define M33_TRCSYNCPR_PERIOD_RESET 0x0au
#define M33_TRCSYNCPR_PERIOD_BITS 0x0000001fu
#define M33_TRCSYNCPR_PERIOD_MSB 4u
#define M33_TRCSYNCPR_PERIOD_LSB 0u
#define M33_TRCSYNCPR_PERIOD_ACCESS "RO"
#define M33_TRCCCCTLR_OFFSET 0x00041038u
#define M33_TRCCCCTLR_BITS 0x00000fffu
#define M33_TRCCCCTLR_RESET 0x00000000u
#define M33_TRCCCCTLR_THRESHOLD_RESET 0x000u
#define M33_TRCCCCTLR_THRESHOLD_BITS 0x00000fffu
#define M33_TRCCCCTLR_THRESHOLD_MSB 11u
#define M33_TRCCCCTLR_THRESHOLD_LSB 0u
#define M33_TRCCCCTLR_THRESHOLD_ACCESS "RW"
#define M33_TRCVICTLR_OFFSET 0x00041080u
#define M33_TRCVICTLR_BITS 0x00090e83u
#define M33_TRCVICTLR_RESET 0x00000000u
#define M33_TRCVICTLR_EXLEVEL_S3_RESET 0x0u
#define M33_TRCVICTLR_EXLEVEL_S3_BITS 0x00080000u
#define M33_TRCVICTLR_EXLEVEL_S3_MSB 19u
#define M33_TRCVICTLR_EXLEVEL_S3_LSB 19u
#define M33_TRCVICTLR_EXLEVEL_S3_ACCESS "RW"
#define M33_TRCVICTLR_EXLEVEL_S0_RESET 0x0u
#define M33_TRCVICTLR_EXLEVEL_S0_BITS 0x00010000u
#define M33_TRCVICTLR_EXLEVEL_S0_MSB 16u
#define M33_TRCVICTLR_EXLEVEL_S0_LSB 16u
#define M33_TRCVICTLR_EXLEVEL_S0_ACCESS "RW"
#define M33_TRCVICTLR_TRCERR_RESET 0x0u
#define M33_TRCVICTLR_TRCERR_BITS 0x00000800u
#define M33_TRCVICTLR_TRCERR_MSB 11u
#define M33_TRCVICTLR_TRCERR_LSB 11u
#define M33_TRCVICTLR_TRCERR_ACCESS "RW"
#define M33_TRCVICTLR_TRCRESET_RESET 0x0u
#define M33_TRCVICTLR_TRCRESET_BITS 0x00000400u
#define M33_TRCVICTLR_TRCRESET_MSB 10u
#define M33_TRCVICTLR_TRCRESET_LSB 10u
#define M33_TRCVICTLR_TRCRESET_ACCESS "RW"
#define M33_TRCVICTLR_SSSTATUS_RESET 0x0u
#define M33_TRCVICTLR_SSSTATUS_BITS 0x00000200u
#define M33_TRCVICTLR_SSSTATUS_MSB 9u
#define M33_TRCVICTLR_SSSTATUS_LSB 9u
#define M33_TRCVICTLR_SSSTATUS_ACCESS "RW"
#define M33_TRCVICTLR_TYPE0_RESET 0x0u
#define M33_TRCVICTLR_TYPE0_BITS 0x00000080u
#define M33_TRCVICTLR_TYPE0_MSB 7u
#define M33_TRCVICTLR_TYPE0_LSB 7u
#define M33_TRCVICTLR_TYPE0_ACCESS "RW"
#define M33_TRCVICTLR_SEL0_RESET 0x0u
#define M33_TRCVICTLR_SEL0_BITS 0x00000003u
#define M33_TRCVICTLR_SEL0_MSB 1u
#define M33_TRCVICTLR_SEL0_LSB 0u
#define M33_TRCVICTLR_SEL0_ACCESS "RW"
#define M33_TRCCNTRLDVR0_OFFSET 0x00041140u
#define M33_TRCCNTRLDVR0_BITS 0x0000ffffu
#define M33_TRCCNTRLDVR0_RESET 0x00000000u
#define M33_TRCCNTRLDVR0_VALUE_RESET 0x0000u
#define M33_TRCCNTRLDVR0_VALUE_BITS 0x0000ffffu
#define M33_TRCCNTRLDVR0_VALUE_MSB 15u
#define M33_TRCCNTRLDVR0_VALUE_LSB 0u
#define M33_TRCCNTRLDVR0_VALUE_ACCESS "RW"
#define M33_TRCIDR8_OFFSET 0x00041180u
#define M33_TRCIDR8_BITS 0xffffffffu
#define M33_TRCIDR8_RESET 0x00000000u
#define M33_TRCIDR8_MAXSPEC_RESET 0x00000000u
#define M33_TRCIDR8_MAXSPEC_BITS 0xffffffffu
#define M33_TRCIDR8_MAXSPEC_MSB 31u
#define M33_TRCIDR8_MAXSPEC_LSB 0u
#define M33_TRCIDR8_MAXSPEC_ACCESS "RO"
#define M33_TRCIDR9_OFFSET 0x00041184u
#define M33_TRCIDR9_BITS 0xffffffffu
#define M33_TRCIDR9_RESET 0x00000000u
#define M33_TRCIDR9_NUMP0KEY_RESET 0x00000000u
#define M33_TRCIDR9_NUMP0KEY_BITS 0xffffffffu
#define M33_TRCIDR9_NUMP0KEY_MSB 31u
#define M33_TRCIDR9_NUMP0KEY_LSB 0u
#define M33_TRCIDR9_NUMP0KEY_ACCESS "RO"
#define M33_TRCIDR10_OFFSET 0x00041188u
#define M33_TRCIDR10_BITS 0xffffffffu
#define M33_TRCIDR10_RESET 0x00000000u
#define M33_TRCIDR10_NUMP1KEY_RESET 0x00000000u
#define M33_TRCIDR10_NUMP1KEY_BITS 0xffffffffu
#define M33_TRCIDR10_NUMP1KEY_MSB 31u
#define M33_TRCIDR10_NUMP1KEY_LSB 0u
#define M33_TRCIDR10_NUMP1KEY_ACCESS "RO"
#define M33_TRCIDR11_OFFSET 0x0004118cu
#define M33_TRCIDR11_BITS 0xffffffffu
#define M33_TRCIDR11_RESET 0x00000000u
#define M33_TRCIDR11_NUMP1SPC_RESET 0x00000000u
#define M33_TRCIDR11_NUMP1SPC_BITS 0xffffffffu
#define M33_TRCIDR11_NUMP1SPC_MSB 31u
#define M33_TRCIDR11_NUMP1SPC_LSB 0u
#define M33_TRCIDR11_NUMP1SPC_ACCESS "RO"
#define M33_TRCIDR12_OFFSET 0x00041190u
#define M33_TRCIDR12_BITS 0xffffffffu
#define M33_TRCIDR12_RESET 0x00000001u
#define M33_TRCIDR12_NUMCONDKEY_RESET 0x00000001u
#define M33_TRCIDR12_NUMCONDKEY_BITS 0xffffffffu
#define M33_TRCIDR12_NUMCONDKEY_MSB 31u
#define M33_TRCIDR12_NUMCONDKEY_LSB 0u
#define M33_TRCIDR12_NUMCONDKEY_ACCESS "RO"
#define M33_TRCIDR13_OFFSET 0x00041194u
#define M33_TRCIDR13_BITS 0xffffffffu
#define M33_TRCIDR13_RESET 0x00000000u
#define M33_TRCIDR13_NUMCONDSPC_RESET 0x00000000u
#define M33_TRCIDR13_NUMCONDSPC_BITS 0xffffffffu
#define M33_TRCIDR13_NUMCONDSPC_MSB 31u
#define M33_TRCIDR13_NUMCONDSPC_LSB 0u
#define M33_TRCIDR13_NUMCONDSPC_ACCESS "RO"
#define M33_TRCIMSPEC_OFFSET 0x000411c0u
#define M33_TRCIMSPEC_BITS 0x0000000fu
#define M33_TRCIMSPEC_RESET 0x00000000u
#define M33_TRCIMSPEC_SUPPORT_RESET 0x0u
#define M33_TRCIMSPEC_SUPPORT_BITS 0x0000000fu
#define M33_TRCIMSPEC_SUPPORT_MSB 3u
#define M33_TRCIMSPEC_SUPPORT_LSB 0u
#define M33_TRCIMSPEC_SUPPORT_ACCESS "RO"
#define M33_TRCIDR0_OFFSET 0x000411e0u
#define M33_TRCIDR0_BITS 0x3f03feffu
#define M33_TRCIDR0_RESET 0x280006e1u
#define M33_TRCIDR0_COMMOPT_RESET 0x1u
#define M33_TRCIDR0_COMMOPT_BITS 0x20000000u
#define M33_TRCIDR0_COMMOPT_MSB 29u
#define M33_TRCIDR0_COMMOPT_LSB 29u
#define M33_TRCIDR0_COMMOPT_ACCESS "RO"
#define M33_TRCIDR0_TSSIZE_RESET 0x08u
#define M33_TRCIDR0_TSSIZE_BITS 0x1f000000u
#define M33_TRCIDR0_TSSIZE_MSB 28u
#define M33_TRCIDR0_TSSIZE_LSB 24u
#define M33_TRCIDR0_TSSIZE_ACCESS "RO"
#define M33_TRCIDR0_TRCEXDATA_RESET 0x0u
#define M33_TRCIDR0_TRCEXDATA_BITS 0x00020000u
#define M33_TRCIDR0_TRCEXDATA_MSB 17u
#define M33_TRCIDR0_TRCEXDATA_LSB 17u
#define M33_TRCIDR0_TRCEXDATA_ACCESS "RO"
#define M33_TRCIDR0_QSUPP_RESET 0x0u
#define M33_TRCIDR0_QSUPP_BITS 0x00018000u
#define M33_TRCIDR0_QSUPP_MSB 16u
#define M33_TRCIDR0_QSUPP_LSB 15u
#define M33_TRCIDR0_QSUPP_ACCESS "RO"
#define M33_TRCIDR0_QFILT_RESET 0x0u
#define M33_TRCIDR0_QFILT_BITS 0x00004000u
#define M33_TRCIDR0_QFILT_MSB 14u
#define M33_TRCIDR0_QFILT_LSB 14u
#define M33_TRCIDR0_QFILT_ACCESS "RO"
#define M33_TRCIDR0_CONDTYPE_RESET 0x0u
#define M33_TRCIDR0_CONDTYPE_BITS 0x00003000u
#define M33_TRCIDR0_CONDTYPE_MSB 13u
#define M33_TRCIDR0_CONDTYPE_LSB 12u
#define M33_TRCIDR0_CONDTYPE_ACCESS "RO"
#define M33_TRCIDR0_NUMEVENT_RESET 0x1u
#define M33_TRCIDR0_NUMEVENT_BITS 0x00000c00u
#define M33_TRCIDR0_NUMEVENT_MSB 11u
#define M33_TRCIDR0_NUMEVENT_LSB 10u
#define M33_TRCIDR0_NUMEVENT_ACCESS "RO"
#define M33_TRCIDR0_RETSTACK_RESET 0x1u
#define M33_TRCIDR0_RETSTACK_BITS 0x00000200u
#define M33_TRCIDR0_RETSTACK_MSB 9u
#define M33_TRCIDR0_RETSTACK_LSB 9u
#define M33_TRCIDR0_RETSTACK_ACCESS "RO"
#define M33_TRCIDR0_TRCCCI_RESET 0x1u
#define M33_TRCIDR0_TRCCCI_BITS 0x00000080u
#define M33_TRCIDR0_TRCCCI_MSB 7u
#define M33_TRCIDR0_TRCCCI_LSB 7u
#define M33_TRCIDR0_TRCCCI_ACCESS "RO"
#define M33_TRCIDR0_TRCCOND_RESET 0x1u
#define M33_TRCIDR0_TRCCOND_BITS 0x00000040u
#define M33_TRCIDR0_TRCCOND_MSB 6u
#define M33_TRCIDR0_TRCCOND_LSB 6u
#define M33_TRCIDR0_TRCCOND_ACCESS "RO"
#define M33_TRCIDR0_TRCBB_RESET 0x1u
#define M33_TRCIDR0_TRCBB_BITS 0x00000020u
#define M33_TRCIDR0_TRCBB_MSB 5u
#define M33_TRCIDR0_TRCBB_LSB 5u
#define M33_TRCIDR0_TRCBB_ACCESS "RO"
#define M33_TRCIDR0_TRCDATA_RESET 0x0u
#define M33_TRCIDR0_TRCDATA_BITS 0x00000018u
#define M33_TRCIDR0_TRCDATA_MSB 4u
#define M33_TRCIDR0_TRCDATA_LSB 3u
#define M33_TRCIDR0_TRCDATA_ACCESS "RO"
#define M33_TRCIDR0_INSTP0_RESET 0x0u
#define M33_TRCIDR0_INSTP0_BITS 0x00000006u
#define M33_TRCIDR0_INSTP0_MSB 2u
#define M33_TRCIDR0_INSTP0_LSB 1u
#define M33_TRCIDR0_INSTP0_ACCESS "RO"
#define M33_TRCIDR0_RES1_RESET 0x1u
#define M33_TRCIDR0_RES1_BITS 0x00000001u
#define M33_TRCIDR0_RES1_MSB 0u
#define M33_TRCIDR0_RES1_LSB 0u
#define M33_TRCIDR0_RES1_ACCESS "RO"
#define M33_TRCIDR1_OFFSET 0x000411e4u
#define M33_TRCIDR1_BITS 0xff00ffffu
#define M33_TRCIDR1_RESET 0x4100f421u
#define M33_TRCIDR1_DESIGNER_RESET 0x41u
#define M33_TRCIDR1_DESIGNER_BITS 0xff000000u
#define M33_TRCIDR1_DESIGNER_MSB 31u
#define M33_TRCIDR1_DESIGNER_LSB 24u
#define M33_TRCIDR1_DESIGNER_ACCESS "RO"
#define M33_TRCIDR1_RES1_RESET 0xfu
#define M33_TRCIDR1_RES1_BITS 0x0000f000u
#define M33_TRCIDR1_RES1_MSB 15u
#define M33_TRCIDR1_RES1_LSB 12u
#define M33_TRCIDR1_RES1_ACCESS "RO"
#define M33_TRCIDR1_TRCARCHMAJ_RESET 0x4u
#define M33_TRCIDR1_TRCARCHMAJ_BITS 0x00000f00u
#define M33_TRCIDR1_TRCARCHMAJ_MSB 11u
#define M33_TRCIDR1_TRCARCHMAJ_LSB 8u
#define M33_TRCIDR1_TRCARCHMAJ_ACCESS "RO"
#define M33_TRCIDR1_TRCARCHMIN_RESET 0x2u
#define M33_TRCIDR1_TRCARCHMIN_BITS 0x000000f0u
#define M33_TRCIDR1_TRCARCHMIN_MSB 7u
#define M33_TRCIDR1_TRCARCHMIN_LSB 4u
#define M33_TRCIDR1_TRCARCHMIN_ACCESS "RO"
#define M33_TRCIDR1_REVISION_RESET 0x1u
#define M33_TRCIDR1_REVISION_BITS 0x0000000fu
#define M33_TRCIDR1_REVISION_MSB 3u
#define M33_TRCIDR1_REVISION_LSB 0u
#define M33_TRCIDR1_REVISION_ACCESS "RO"
#define M33_TRCIDR2_OFFSET 0x000411e8u
#define M33_TRCIDR2_BITS 0x1fffffffu
#define M33_TRCIDR2_RESET 0x00000004u
#define M33_TRCIDR2_CCSIZE_RESET 0x0u
#define M33_TRCIDR2_CCSIZE_BITS 0x1e000000u
#define M33_TRCIDR2_CCSIZE_MSB 28u
#define M33_TRCIDR2_CCSIZE_LSB 25u
#define M33_TRCIDR2_CCSIZE_ACCESS "RO"
#define M33_TRCIDR2_DVSIZE_RESET 0x00u
#define M33_TRCIDR2_DVSIZE_BITS 0x01f00000u
#define M33_TRCIDR2_DVSIZE_MSB 24u
#define M33_TRCIDR2_DVSIZE_LSB 20u
#define M33_TRCIDR2_DVSIZE_ACCESS "RO"
#define M33_TRCIDR2_DASIZE_RESET 0x00u
#define M33_TRCIDR2_DASIZE_BITS 0x000f8000u
#define M33_TRCIDR2_DASIZE_MSB 19u
#define M33_TRCIDR2_DASIZE_LSB 15u
#define M33_TRCIDR2_DASIZE_ACCESS "RO"
#define M33_TRCIDR2_VMIDSIZE_RESET 0x00u
#define M33_TRCIDR2_VMIDSIZE_BITS 0x00007c00u
#define M33_TRCIDR2_VMIDSIZE_MSB 14u
#define M33_TRCIDR2_VMIDSIZE_LSB 10u
#define M33_TRCIDR2_VMIDSIZE_ACCESS "RO"
#define M33_TRCIDR2_CIDSIZE_RESET 0x00u
#define M33_TRCIDR2_CIDSIZE_BITS 0x000003e0u
#define M33_TRCIDR2_CIDSIZE_MSB 9u
#define M33_TRCIDR2_CIDSIZE_LSB 5u
#define M33_TRCIDR2_CIDSIZE_ACCESS "RO"
#define M33_TRCIDR2_IASIZE_RESET 0x04u
#define M33_TRCIDR2_IASIZE_BITS 0x0000001fu
#define M33_TRCIDR2_IASIZE_MSB 4u
#define M33_TRCIDR2_IASIZE_LSB 0u
#define M33_TRCIDR2_IASIZE_ACCESS "RO"
#define M33_TRCIDR3_OFFSET 0x000411ecu
#define M33_TRCIDR3_BITS 0xffff0fffu
#define M33_TRCIDR3_RESET 0x0f090004u
#define M33_TRCIDR3_NOOVERFLOW_RESET 0x0u
#define M33_TRCIDR3_NOOVERFLOW_BITS 0x80000000u
#define M33_TRCIDR3_NOOVERFLOW_MSB 31u
#define M33_TRCIDR3_NOOVERFLOW_LSB 31u
#define M33_TRCIDR3_NOOVERFLOW_ACCESS "RO"
#define M33_TRCIDR3_NUMPROC_RESET 0x0u
#define M33_TRCIDR3_NUMPROC_BITS 0x70000000u
#define M33_TRCIDR3_NUMPROC_MSB 30u
#define M33_TRCIDR3_NUMPROC_LSB 28u
#define M33_TRCIDR3_NUMPROC_ACCESS "RO"
#define M33_TRCIDR3_SYSSTALL_RESET 0x1u
#define M33_TRCIDR3_SYSSTALL_BITS 0x08000000u
#define M33_TRCIDR3_SYSSTALL_MSB 27u
#define M33_TRCIDR3_SYSSTALL_LSB 27u
#define M33_TRCIDR3_SYSSTALL_ACCESS "RO"
#define M33_TRCIDR3_STALLCTL_RESET 0x1u
#define M33_TRCIDR3_STALLCTL_BITS 0x04000000u
#define M33_TRCIDR3_STALLCTL_MSB 26u
#define M33_TRCIDR3_STALLCTL_LSB 26u
#define M33_TRCIDR3_STALLCTL_ACCESS "RO"
#define M33_TRCIDR3_SYNCPR_RESET 0x1u
#define M33_TRCIDR3_SYNCPR_BITS 0x02000000u
#define M33_TRCIDR3_SYNCPR_MSB 25u
#define M33_TRCIDR3_SYNCPR_LSB 25u
#define M33_TRCIDR3_SYNCPR_ACCESS "RO"
#define M33_TRCIDR3_TRCERR_RESET 0x1u
#define M33_TRCIDR3_TRCERR_BITS 0x01000000u
#define M33_TRCIDR3_TRCERR_MSB 24u
#define M33_TRCIDR3_TRCERR_LSB 24u
#define M33_TRCIDR3_TRCERR_ACCESS "RO"
#define M33_TRCIDR3_EXLEVEL_NS_RESET 0x0u
#define M33_TRCIDR3_EXLEVEL_NS_BITS 0x00f00000u
#define M33_TRCIDR3_EXLEVEL_NS_MSB 23u
#define M33_TRCIDR3_EXLEVEL_NS_LSB 20u
#define M33_TRCIDR3_EXLEVEL_NS_ACCESS "RO"
#define M33_TRCIDR3_EXLEVEL_S_RESET 0x9u
#define M33_TRCIDR3_EXLEVEL_S_BITS 0x000f0000u
#define M33_TRCIDR3_EXLEVEL_S_MSB 19u
#define M33_TRCIDR3_EXLEVEL_S_LSB 16u
#define M33_TRCIDR3_EXLEVEL_S_ACCESS "RO"
#define M33_TRCIDR3_CCITMIN_RESET 0x004u
#define M33_TRCIDR3_CCITMIN_BITS 0x00000fffu
#define M33_TRCIDR3_CCITMIN_MSB 11u
#define M33_TRCIDR3_CCITMIN_LSB 0u
#define M33_TRCIDR3_CCITMIN_ACCESS "RO"
#define M33_TRCIDR4_OFFSET 0x000411f0u
#define M33_TRCIDR4_BITS 0xfffff1ffu
#define M33_TRCIDR4_RESET 0x00114000u
#define M33_TRCIDR4_NUMVMIDC_RESET 0x0u
#define M33_TRCIDR4_NUMVMIDC_BITS 0xf0000000u
#define M33_TRCIDR4_NUMVMIDC_MSB 31u
#define M33_TRCIDR4_NUMVMIDC_LSB 28u
#define M33_TRCIDR4_NUMVMIDC_ACCESS "RO"
#define M33_TRCIDR4_NUMCIDC_RESET 0x0u
#define M33_TRCIDR4_NUMCIDC_BITS 0x0f000000u
#define M33_TRCIDR4_NUMCIDC_MSB 27u
#define M33_TRCIDR4_NUMCIDC_LSB 24u
#define M33_TRCIDR4_NUMCIDC_ACCESS "RO"
#define M33_TRCIDR4_NUMSSCC_RESET 0x1u
#define M33_TRCIDR4_NUMSSCC_BITS 0x00f00000u
#define M33_TRCIDR4_NUMSSCC_MSB 23u
#define M33_TRCIDR4_NUMSSCC_LSB 20u
#define M33_TRCIDR4_NUMSSCC_ACCESS "RO"
#define M33_TRCIDR4_NUMRSPAIR_RESET 0x1u
#define M33_TRCIDR4_NUMRSPAIR_BITS 0x000f0000u
#define M33_TRCIDR4_NUMRSPAIR_MSB 19u
#define M33_TRCIDR4_NUMRSPAIR_LSB 16u
#define M33_TRCIDR4_NUMRSPAIR_ACCESS "RO"
#define M33_TRCIDR4_NUMPC_RESET 0x4u
#define M33_TRCIDR4_NUMPC_BITS 0x0000f000u
#define M33_TRCIDR4_NUMPC_MSB 15u
#define M33_TRCIDR4_NUMPC_LSB 12u
#define M33_TRCIDR4_NUMPC_ACCESS "RO"
#define M33_TRCIDR4_SUPPDAC_RESET 0x0u
#define M33_TRCIDR4_SUPPDAC_BITS 0x00000100u
#define M33_TRCIDR4_SUPPDAC_MSB 8u
#define M33_TRCIDR4_SUPPDAC_LSB 8u
#define M33_TRCIDR4_SUPPDAC_ACCESS "RO"
#define M33_TRCIDR4_NUMDVC_RESET 0x0u
#define M33_TRCIDR4_NUMDVC_BITS 0x000000f0u
#define M33_TRCIDR4_NUMDVC_MSB 7u
#define M33_TRCIDR4_NUMDVC_LSB 4u
#define M33_TRCIDR4_NUMDVC_ACCESS "RO"
#define M33_TRCIDR4_NUMACPAIRS_RESET 0x0u
#define M33_TRCIDR4_NUMACPAIRS_BITS 0x0000000fu
#define M33_TRCIDR4_NUMACPAIRS_MSB 3u
#define M33_TRCIDR4_NUMACPAIRS_LSB 0u
#define M33_TRCIDR4_NUMACPAIRS_ACCESS "RO"
#define M33_TRCIDR5_OFFSET 0x000411f4u
#define M33_TRCIDR5_BITS 0xfeff0fffu
#define M33_TRCIDR5_RESET 0x90c70004u
#define M33_TRCIDR5_REDFUNCNTR_RESET 0x1u
#define M33_TRCIDR5_REDFUNCNTR_BITS 0x80000000u
#define M33_TRCIDR5_REDFUNCNTR_MSB 31u
#define M33_TRCIDR5_REDFUNCNTR_LSB 31u
#define M33_TRCIDR5_REDFUNCNTR_ACCESS "RO"
#define M33_TRCIDR5_NUMCNTR_RESET 0x1u
#define M33_TRCIDR5_NUMCNTR_BITS 0x70000000u
#define M33_TRCIDR5_NUMCNTR_MSB 30u
#define M33_TRCIDR5_NUMCNTR_LSB 28u
#define M33_TRCIDR5_NUMCNTR_ACCESS "RO"
#define M33_TRCIDR5_NUMSEQSTATE_RESET 0x0u
#define M33_TRCIDR5_NUMSEQSTATE_BITS 0x0e000000u
#define M33_TRCIDR5_NUMSEQSTATE_MSB 27u
#define M33_TRCIDR5_NUMSEQSTATE_LSB 25u
#define M33_TRCIDR5_NUMSEQSTATE_ACCESS "RO"
#define M33_TRCIDR5_LPOVERRIDE_RESET 0x1u
#define M33_TRCIDR5_LPOVERRIDE_BITS 0x00800000u
#define M33_TRCIDR5_LPOVERRIDE_MSB 23u
#define M33_TRCIDR5_LPOVERRIDE_LSB 23u
#define M33_TRCIDR5_LPOVERRIDE_ACCESS "RO"
#define M33_TRCIDR5_ATBTRIG_RESET 0x1u
#define M33_TRCIDR5_ATBTRIG_BITS 0x00400000u
#define M33_TRCIDR5_ATBTRIG_MSB 22u
#define M33_TRCIDR5_ATBTRIG_LSB 22u
#define M33_TRCIDR5_ATBTRIG_ACCESS "RO"
#define M33_TRCIDR5_TRACEIDSIZE_RESET 0x07u
#define M33_TRCIDR5_TRACEIDSIZE_BITS 0x003f0000u
#define M33_TRCIDR5_TRACEIDSIZE_MSB 21u
#define M33_TRCIDR5_TRACEIDSIZE_LSB 16u
#define M33_TRCIDR5_TRACEIDSIZE_ACCESS "RO"
#define M33_TRCIDR5_NUMEXTINSEL_RESET 0x0u
#define M33_TRCIDR5_NUMEXTINSEL_BITS 0x00000e00u
#define M33_TRCIDR5_NUMEXTINSEL_MSB 11u
#define M33_TRCIDR5_NUMEXTINSEL_LSB 9u
#define M33_TRCIDR5_NUMEXTINSEL_ACCESS "RO"
#define M33_TRCIDR5_NUMEXTIN_RESET 0x004u
#define M33_TRCIDR5_NUMEXTIN_BITS 0x000001ffu
#define M33_TRCIDR5_NUMEXTIN_MSB 8u
#define M33_TRCIDR5_NUMEXTIN_LSB 0u
#define M33_TRCIDR5_NUMEXTIN_ACCESS "RO"
#define M33_TRCIDR6_OFFSET 0x000411f8u
#define M33_TRCIDR6_BITS 0x00000000u
#define M33_TRCIDR6_RESET 0x00000000u
#define M33_TRCIDR6_MSB 31u
#define M33_TRCIDR6_LSB 0u
#define M33_TRCIDR6_ACCESS "RW"
#define M33_TRCIDR7_OFFSET 0x000411fcu
#define M33_TRCIDR7_BITS 0x00000000u
#define M33_TRCIDR7_RESET 0x00000000u
#define M33_TRCIDR7_MSB 31u
#define M33_TRCIDR7_LSB 0u
#define M33_TRCIDR7_ACCESS "RW"
#define M33_TRCRSCTLR2_OFFSET 0x00041208u
#define M33_TRCRSCTLR2_BITS 0x003700ffu
#define M33_TRCRSCTLR2_RESET 0x00000000u
#define M33_TRCRSCTLR2_PAIRINV_RESET 0x0u
#define M33_TRCRSCTLR2_PAIRINV_BITS 0x00200000u
#define M33_TRCRSCTLR2_PAIRINV_MSB 21u
#define M33_TRCRSCTLR2_PAIRINV_LSB 21u
#define M33_TRCRSCTLR2_PAIRINV_ACCESS "RW"
#define M33_TRCRSCTLR2_INV_RESET 0x0u
#define M33_TRCRSCTLR2_INV_BITS 0x00100000u
#define M33_TRCRSCTLR2_INV_MSB 20u
#define M33_TRCRSCTLR2_INV_LSB 20u
#define M33_TRCRSCTLR2_INV_ACCESS "RW"
#define M33_TRCRSCTLR2_GROUP_RESET 0x0u
#define M33_TRCRSCTLR2_GROUP_BITS 0x00070000u
#define M33_TRCRSCTLR2_GROUP_MSB 18u
#define M33_TRCRSCTLR2_GROUP_LSB 16u
#define M33_TRCRSCTLR2_GROUP_ACCESS "RW"
#define M33_TRCRSCTLR2_SELECT_RESET 0x00u
#define M33_TRCRSCTLR2_SELECT_BITS 0x000000ffu
#define M33_TRCRSCTLR2_SELECT_MSB 7u
#define M33_TRCRSCTLR2_SELECT_LSB 0u
#define M33_TRCRSCTLR2_SELECT_ACCESS "RW"
#define M33_TRCRSCTLR3_OFFSET 0x0004120cu
#define M33_TRCRSCTLR3_BITS 0x003700ffu
#define M33_TRCRSCTLR3_RESET 0x00000000u
#define M33_TRCRSCTLR3_PAIRINV_RESET 0x0u
#define M33_TRCRSCTLR3_PAIRINV_BITS 0x00200000u
#define M33_TRCRSCTLR3_PAIRINV_MSB 21u
#define M33_TRCRSCTLR3_PAIRINV_LSB 21u
#define M33_TRCRSCTLR3_PAIRINV_ACCESS "RW"
#define M33_TRCRSCTLR3_INV_RESET 0x0u
#define M33_TRCRSCTLR3_INV_BITS 0x00100000u
#define M33_TRCRSCTLR3_INV_MSB 20u
#define M33_TRCRSCTLR3_INV_LSB 20u
#define M33_TRCRSCTLR3_INV_ACCESS "RW"
#define M33_TRCRSCTLR3_GROUP_RESET 0x0u
#define M33_TRCRSCTLR3_GROUP_BITS 0x00070000u
#define M33_TRCRSCTLR3_GROUP_MSB 18u
#define M33_TRCRSCTLR3_GROUP_LSB 16u
#define M33_TRCRSCTLR3_GROUP_ACCESS "RW"
#define M33_TRCRSCTLR3_SELECT_RESET 0x00u
#define M33_TRCRSCTLR3_SELECT_BITS 0x000000ffu
#define M33_TRCRSCTLR3_SELECT_MSB 7u
#define M33_TRCRSCTLR3_SELECT_LSB 0u
#define M33_TRCRSCTLR3_SELECT_ACCESS "RW"
#define M33_TRCSSCSR_OFFSET 0x000412a0u
#define M33_TRCSSCSR_BITS 0x8000000fu
#define M33_TRCSSCSR_RESET 0x00000000u
#define M33_TRCSSCSR_STATUS_RESET 0x0u
#define M33_TRCSSCSR_STATUS_BITS 0x80000000u
#define M33_TRCSSCSR_STATUS_MSB 31u
#define M33_TRCSSCSR_STATUS_LSB 31u
#define M33_TRCSSCSR_STATUS_ACCESS "RW"
#define M33_TRCSSCSR_PC_RESET 0x0u
#define M33_TRCSSCSR_PC_BITS 0x00000008u
#define M33_TRCSSCSR_PC_MSB 3u
#define M33_TRCSSCSR_PC_LSB 3u
#define M33_TRCSSCSR_PC_ACCESS "RO"
#define M33_TRCSSCSR_DV_RESET 0x0u
#define M33_TRCSSCSR_DV_BITS 0x00000004u
#define M33_TRCSSCSR_DV_MSB 2u
#define M33_TRCSSCSR_DV_LSB 2u
#define M33_TRCSSCSR_DV_ACCESS "RO"
#define M33_TRCSSCSR_DA_RESET 0x0u
#define M33_TRCSSCSR_DA_BITS 0x00000002u
#define M33_TRCSSCSR_DA_MSB 1u
#define M33_TRCSSCSR_DA_LSB 1u
#define M33_TRCSSCSR_DA_ACCESS "RO"
#define M33_TRCSSCSR_INST_RESET 0x0u
#define M33_TRCSSCSR_INST_BITS 0x00000001u
#define M33_TRCSSCSR_INST_MSB 0u
#define M33_TRCSSCSR_INST_LSB 0u
#define M33_TRCSSCSR_INST_ACCESS "RO"
#define M33_TRCSSPCICR_OFFSET 0x000412c0u
#define M33_TRCSSPCICR_BITS 0x0000000fu
#define M33_TRCSSPCICR_RESET 0x00000000u
#define M33_TRCSSPCICR_PC_RESET 0x0u
#define M33_TRCSSPCICR_PC_BITS 0x0000000fu
#define M33_TRCSSPCICR_PC_MSB 3u
#define M33_TRCSSPCICR_PC_LSB 0u
