gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
    io_rw_32 fp_ctrl;
   
    io_ro_32 fp_remap;
   
    io_rw_32 fp_comp[8];
    uint32_t _pad20[997];
   
    io_ro_32 fp_devarch;
    uint32_t _pad21[3];
   
    io_ro_32 fp_devtype;
   
    io_ro_32 fp_pidr4;
   
    io_rw_32 fp_pidr5;
   
    io_rw_32 fp_pidr6;
   
    io_rw_32 fp_pidr7;
   
    io_ro_32 fp_pidr0;
   
    io_ro_32 fp_pidr1;
   
    io_ro_32 fp_pidr2;
   
    io_ro_32 fp_pidr3;
   
    io_ro_32 fp_cidr[4];
    uint32_t _pad22[11265];
   
    io_ro_32 ictr;
   
    io_rw_32 actlr;
    uint32_t _pad23;
   
    io_rw_32 syst_csr;
   
    io_rw_32 syst_rvr;
   
    io_rw_32 syst_cvr;
   
    io_ro_32 syst_calib;
    uint32_t _pad24[56];
   
    io_rw_32 nvic_iser[2];
    uint32_t _pad25[30];
   
    io_rw_32 nvic_icer[2];
    uint32_t _pad26[30];
   
    io_rw_32 nvic_ispr[2];
    uint32_t _pad27[30];
   
    io_rw_32 nvic_icpr[2];
    uint32_t _pad28[30];
   
    io_rw_32 nvic_iabr[2];
    uint32_t _pad29[30];
   
    io_rw_32 nvic_itns[2];
    uint32_t _pad30[30];
   
    io_rw_32 nvic_ipr[16];
    uint32_t _pad31[560];
   
    io_ro_32 cpuid;
   
    io_rw_32 icsr;
   
    io_rw_32 vtor;
   
    io_rw_32 aircr;
   
    io_rw_32 scr;
   
    io_rw_32 ccr;
   
    io_rw_32 shpr[3];
   
    io_rw_32 shcsr;
   
    io_rw_32 cfsr;
   
    io_rw_32 hfsr;
   
    io_rw_32 dfsr;
   
    io_rw_32 mmfar;
   
    io_rw_32 bfar;
    uint32_t _pad32;
   
    io_ro_32 id_pfr[2];
   
    io_ro_32 id_dfr0;
   
    io_ro_32 id_afr0;
   
    io_ro_32 id_mmfr[4];
   
    io_ro_32 id_isar[6];
    uint32_t _pad33;
   
    io_ro_32 ctr;
    uint32_t _pad34[2];
   
    io_rw_32 cpacr;
   
    io_rw_32 nsacr;
   
    io_ro_32 mpu_type;
   
    io_rw_32 mpu_ctrl;
   
    io_rw_32 mpu_rnr;
   
    io_rw_32 mpu_rbar;
   
    io_rw_32 mpu_rlar;
   
    io_rw_32 mpu_rbar_a1;
   
    io_rw_32 mpu_rlar_a1;
   
    io_rw_32 mpu_rbar_a2;
   
    io_rw_32 mpu_rlar_a2;
   
    io_rw_32 mpu_rbar_a3;
   
    io_rw_32 mpu_rlar_a3;
    uint32_t _pad35;
   
    io_rw_32 mpu_mair[2];
    uint32_t _pad36[2];
   
    io_rw_32 sau_ctrl;
   
    io_ro_32 sau_type;
   
    io_rw_32 sau_rnr;
   
    io_rw_32 sau_rbar;
   
    io_rw_32 sau_rlar;
   
    io_rw_32 sfsr;
   
    io_rw_32 sfar;
    uint32_t _pad37;
   
    io_rw_32 dhcsr;
   
    io_rw_32 dcrsr;
   
    io_rw_32 dcrdr;
   
    io_rw_32 demcr;
    uint32_t _pad38[2];
   
    io_rw_32 dscsr;
    uint32_t _pad39[61];
   
    io_rw_32 stir;
    uint32_t _pad40[12];
   
    io_rw_32 fpccr;
   
    io_rw_32 fpcar;
   
    io_rw_32 fpdscr;
   
    io_ro_32 mvfr[3];
    uint32_t _pad41[28];
   
    io_ro_32 ddevarch;
    uint32_t _pad42[3];
   
    io_ro_32 ddevtype;
   
    io_ro_32 dpidr4;
   
    io_rw_32 dpidr5;
   
    io_rw_32 dpidr6;
   
    io_rw_32 dpidr7;
   
    io_ro_32 dpidr0;
   
    io_ro_32 dpidr1;
   
    io_ro_32 dpidr2;
   
    io_ro_32 dpidr3;
   
    io_ro_32 dcidr[4];
    uint32_t _pad43[51201];
   
    io_rw_32 trcprgctlr;
    uint32_t _pad44;
   
    io_ro_32 trcstatr;
   
    io_rw_32 trcconfigr;
    uint32_t _pad45[3];
   
    io_rw_32 trceventctl0r;
   
    io_rw_32 trceventctl1r;
    uint32_t _pad46;
   
    io_rw_32 trcstallctlr;
   
    io_rw_32 trctsctlr;
   
    io_ro_32 trcsyncpr;
   
    io_rw_32 trcccctlr;
    uint32_t _pad47[17];
   
    io_rw_32 trcvictlr;
    uint32_t _pad48[47];
   
    io_rw_32 trccntrldvr0;
    uint32_t _pad49[15];
   
    io_ro_32 trcidr8;
   
    io_ro_32 trcidr9;
   
    io_ro_32 trcidr10;
   
    io_ro_32 trcidr11;
   
    io_ro_32 trcidr12;
   
    io_ro_32 trcidr13;
    uint32_t _pad50[10];
   
    io_ro_32 trcimspec;
    uint32_t _pad51[7];
   
    io_ro_32 trcidr0;
   
    io_ro_32 trcidr1;
   
    io_ro_32 trcidr2;
   
    io_ro_32 trcidr3;
   
    io_ro_32 trcidr4;
   
    io_ro_32 trcidr5;
   
    io_rw_32 trcidr6;
   
    io_rw_32 trcidr7;
    uint32_t _pad52[2];
   
    io_rw_32 trcrsctlr[2];
    uint32_t _pad53[36];
   
    io_rw_32 trcsscsr;
    uint32_t _pad54[7];
   
    io_rw_32 trcsspcicr;
    uint32_t _pad55[19];
   
    io_rw_32 trcpdcr;
   
    io_ro_32 trcpdsr;
    uint32_t _pad56[755];
   
    io_rw_32 trcitatbidr;
    uint32_t _pad57[3];
   
    io_rw_32 trcitiatbinr;
    uint32_t _pad58;
   
    io_rw_32 trcitiatboutr;
    uint32_t _pad59[40];
   
    io_rw_32 trcclaimset;
   
    io_rw_32 trcclaimclr;
    uint32_t _pad60[4];
   
    io_ro_32 trcauthstatus;
   
    io_ro_32 trcdevarch;
    uint32_t _pad61[2];
   
    io_rw_32 trcdevid;
   
    io_ro_32 trcdevtype;
   
    io_ro_32 trcpidr4;
   
    io_rw_32 trcpidr5;
   
    io_rw_32 trcpidr6;
   
    io_rw_32 trcpidr7;
   
    io_ro_32 trcpidr0;
   
    io_ro_32 trcpidr1;
   
    io_ro_32 trcpidr2;
   
    io_ro_32 trcpidr3;
   
    io_ro_32 trccidr[4];
   
    io_rw_32 cticontrol;
    uint32_t _pad62[3];
   
    io_rw_32 ctiintack;
   
    io_rw_32 ctiappset;
   
    io_rw_32 ctiappclear;
   
    io_rw_32 ctiapppulse;
   
    io_rw_32 ctiinen[8];
    uint32_t _pad63[24];
   
    io_rw_32 ctiouten[8];
    uint32_t _pad64[28];
   
    io_ro_32 ctitriginstatus;
   
    io_ro_32 ctitrigoutstatus;
   
    io_ro_32 ctichinstatus;
    uint32_t _pad65;
   
    io_rw_32 ctigate;
   
    io_rw_32 asicctl;
    uint32_t _pad66[871];
   
    io_rw_32 itchout;
   
    io_rw_32 ittrigout;
    uint32_t _pad67[2];
   
    io_ro_32 itchin;
    uint32_t _pad68[2];
   
    io_rw_32 itctrl;
    uint32_t _pad69[46];
   
    io_ro_32 devarch;
    uint32_t _pad70[2];
   
    io_ro_32 devid;
   
    io_ro_32 devtype;
   
    io_ro_32 pidr4;
   
    io_rw_32 pidr5;
   
    io_rw_32 pidr6;
   
    io_rw_32 pidr7;
   
    io_ro_32 pidr0;
   
    io_ro_32 pidr1;
   
    io_ro_32 pidr2;
   
    io_ro_32 pidr3;
   
    io_ro_32 cidr[4];
} m33_hw_t;
#define m33_hw ((m33_hw_t *)PPB_BASE)
#define m33_ns_hw ((m33_hw_t *)PPB_NONSEC_BASE)
_Static_assert(sizeof (m33_hw_t) == 0x43000, "");
#define arm_cpu_hw m33_hw
#define _HARDWARE_STRUCTS_NVIC_H 
typedef struct {
   
    io_rw_32 iser[2];
    uint32_t _pad0[30];
   
    io_rw_32 icer[2];
    uint32_t _pad1[30];
   
    io_rw_32 ispr[2];
    uint32_t _pad2[30];
   
