gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
    io_rw_32 icpr[2];
    uint32_t _pad3[30];
   
    io_rw_32 iabr[2];
    uint32_t _pad4[30];
   
    io_rw_32 itns[2];
    uint32_t _pad5[30];
   
    io_rw_32 ipr[16];
} nvic_hw_t;
#define nvic_hw ((nvic_hw_t *)(PPB_BASE + M33_NVIC_ISER0_OFFSET))
#define nvic_ns_hw ((nvic_hw_t *)(PPB_NONSEC_BASE + M33_NVIC_ISER0_OFFSET))
_Static_assert(sizeof (nvic_hw_t) == 0x0340, "");
#define _HARDWARE_STRUCTS_SCB_H 
typedef struct {
   
    io_ro_32 cpuid;
   
    io_rw_32 icsr;
   
    io_rw_32 vtor;
   
    io_rw_32 aircr;
   
    io_rw_32 scr;
   
    io_rw_32 ccr;
   
    io_rw_32 shpr[3];
   
    io_rw_32 shcsr;
   
    io_rw_32 cfsr;
   
    io_rw_32 hfsr;
   
    io_rw_32 dfsr;
   
    io_rw_32 mmfar;
   
    io_rw_32 bfar;
    uint32_t _pad0;
   
    io_ro_32 id_pfr[2];
   
    io_ro_32 id_dfr0;
   
    io_ro_32 id_afr0;
   
    io_ro_32 id_mmfr[4];
   
    io_ro_32 id_isar[6];
    uint32_t _pad1;
   
    io_ro_32 ctr;
    uint32_t _pad2[2];
   
    io_rw_32 cpacr;
   
    io_rw_32 nsacr;
} armv8m_scb_hw_t;
#define scb_hw ((armv8m_scb_hw_t *)(PPB_BASE + M33_CPUID_OFFSET))
#define scb_ns_hw ((armv8m_scb_hw_t *)(PPB_NONSEC_BASE + M33_CPUID_OFFSET))
_Static_assert(sizeof (armv8m_scb_hw_t) == 0x0090, "");
#define PICO_DEFAULT_IRQ_PRIORITY 0x80
#define PICO_LOWEST_IRQ_PRIORITY 0xff
#define PICO_HIGHEST_IRQ_PRIORITY 0x00
#define PICO_SHARED_IRQ_HANDLER_DEFAULT_ORDER_PRIORITY 0x80
#define PICO_SHARED_IRQ_HANDLER_HIGHEST_ORDER_PRIORITY 0xff
#define PICO_SHARED_IRQ_HANDLER_LOWEST_ORDER_PRIORITY 0x00
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_IRQ 0
typedef void (*irq_handler_t)(void);
static inline void check_irq_param(__attribute__((__unused__)) uint num) {
    ({if (((0 || 0) && !0)) ((!(num >= 52u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_irq/include/hardware/irq.h", 198, __func__, "!(num >= 52u)"));});
}
void irq_set_priority(uint num, uint8_t hardware_priority);
uint irq_get_priority(uint num);
void irq_set_enabled(uint num, _Bool enabled);
_Bool irq_is_enabled(uint num);
void irq_set_mask_enabled(uint32_t mask, _Bool enabled);
void irq_set_mask_n_enabled(uint n, uint32_t mask, _Bool enabled);
void irq_set_exclusive_handler(uint num, irq_handler_t handler);
irq_handler_t irq_get_exclusive_handler(uint num);
void irq_add_shared_handler(uint num, irq_handler_t handler, uint8_t order_priority);
void irq_remove_handler(uint num, irq_handler_t handler);
_Bool irq_has_handler(uint num);
_Bool irq_has_shared_handler(uint num);
irq_handler_t irq_get_vtable_handler(uint num);
static inline void irq_clear(uint int_num) {
    ((nvic_hw_t *)(0xe0000000u + 0x0000e100u))->icpr[int_num/32] = 1 << (int_num % 32);
}
void irq_set_pending(uint num);
void runtime_init_per_core_irq_priorities(void);
static __inline__ __attribute__((__always_inline__)) void irq_init_priorities(void) {
    runtime_init_per_core_irq_priorities();
}
void user_irq_claim(uint irq_num);
void user_irq_unclaim(uint irq_num);
int user_irq_claim_unused(_Bool required);
_Bool user_irq_is_claimed(uint irq_num);
void __unhandled_user_irq(void);
#define PICO_USE_GPIO_COPROCESSOR 1
#define _HARDWARE_GPIO_COPROC_H 
__inline__ __attribute__((__always_inline__)) static void gpioc_lo_out_put(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #0, %0, c0, c0" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_lo_out_xor(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #1, %0, c0, c0" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_lo_out_set(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #2, %0, c0, c0" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_lo_out_clr(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #3, %0, c0, c0" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hi_out_put(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #0, %0, c0, c1" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hi_out_xor(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #1, %0, c0, c1" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hi_out_set(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #2, %0, c0, c1" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hi_out_clr(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #3, %0, c0, c1" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hilo_out_put(uint64_t x) {
    __asm volatile (".syntax unified\n" "mcrr p0, #0, %0, %1, c0" : : "r" (x & 0xffffffffu), "r" (x >> 32));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hilo_out_xor(uint64_t x) {
    __asm volatile (".syntax unified\n" "mcrr p0, #1, %0, %1, c0" : : "r" (x & 0xffffffffu), "r" (x >> 32));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hilo_out_set(uint64_t x) {
    __asm volatile (".syntax unified\n" "mcrr p0, #2, %0, %1, c0" : : "r" (x & 0xffffffffu), "r" (x >> 32));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hilo_out_clr(uint64_t x) {
    __asm volatile (".syntax unified\n" "mcrr p0, #3, %0, %1, c0" : : "r" (x & 0xffffffffu), "r" (x >> 32));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_lo_oe_put(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #0, %0, c0, c4" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_lo_oe_xor(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #1, %0, c0, c4" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_lo_oe_set(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #2, %0, c0, c4" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_lo_oe_clr(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #3, %0, c0, c4" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hi_oe_put(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #0, %0, c0, c5" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hi_oe_xor(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #1, %0, c0, c5" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hi_oe_set(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #2, %0, c0, c5" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hi_oe_clr(uint32_t x) {
    __asm volatile (".syntax unified\n" "mcr p0, #3, %0, c0, c5" : : "r" (x));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hilo_oe_put(uint64_t x) {
    __asm volatile (".syntax unified\n" "mcrr p0, #0, %0, %1, c4" : : "r" (x & 0xffffffffu), "r" (x >> 32));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hilo_oe_xor(uint64_t x) {
    __asm volatile (".syntax unified\n" "mcrr p0, #1, %0, %1, c4" : : "r" (x & 0xffffffffu), "r" (x >> 32));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hilo_oe_set(uint64_t x) {
    __asm volatile (".syntax unified\n" "mcrr p0, #2, %0, %1, c4" : : "r" (x & 0xffffffffu), "r" (x >> 32));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_hilo_oe_clr(uint64_t x) {
    __asm volatile (".syntax unified\n" "mcrr p0, #3, %0, %1, c4" : : "r" (x & 0xffffffffu), "r" (x >> 32));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_out_put(uint pin, _Bool val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #4, %0, %1, c0" : : "r" (pin), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_out_xor(uint pin) {
    __asm volatile (".syntax unified\n" "mcr p0, #5, %0, c0, c0" : : "r" (pin));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_out_set(uint pin) {
    __asm volatile (".syntax unified\n" "mcr p0, #6, %0, c0, c0" : : "r" (pin));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_out_clr(uint pin) {
    __asm volatile (".syntax unified\n" "mcr p0, #7, %0, c0, c0" : : "r" (pin));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_out_xor2(uint pin, _Bool val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #5, %0, %1, c0" : : "r" (pin), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_out_set2(uint pin, _Bool val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #6, %0, %1, c0" : : "r" (pin), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_out_clr2(uint pin, _Bool val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #7, %0, %1, c0" : : "r" (pin), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_oe_put(uint pin, _Bool val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #4, %0, %1, c4" : : "r" (pin), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_oe_xor(uint pin) {
    __asm volatile (".syntax unified\n" "mcr p0, #5, %0, c0, c4" : : "r" (pin));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_oe_set(uint pin) {
    __asm volatile (".syntax unified\n" "mcr p0, #6, %0, c0, c4" : : "r" (pin));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_oe_clr(uint pin) {
    __asm volatile (".syntax unified\n" "mcr p0, #7, %0, c0, c4" : : "r" (pin));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_oe_xor2(uint pin, _Bool val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #5, %0, %1, c4" : : "r" (pin), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_oe_set2(uint pin, _Bool val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #6, %0, %1, c4" : : "r" (pin), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_bit_oe_clr2(uint pin, _Bool val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #7, %0, %1, c4" : : "r" (pin), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_index_out_put(uint reg_index, uint32_t val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #8, %1, %0, c0" : : "r" (reg_index), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_index_out_xor(uint reg_index, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr p0, #9, %1, %0, c0" : : "r" (reg_index), "r" (mask));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_index_out_set(uint reg_index, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr p0, #10, %1, %0, c0" : : "r" (reg_index), "r" (mask));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_index_out_clr(uint reg_index, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr p0, #11, %1, %0, c0" : : "r" (reg_index), "r" (mask));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_index_oe_put(uint reg_index, uint32_t val) {
    __asm volatile (".syntax unified\n" "mcrr p0, #8, %1, %0, c4" : : "r" (reg_index), "r" (val));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_index_oe_xor(uint reg_index, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr p0, #9, %1, %0, c4" : : "r" (reg_index), "r" (mask));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_index_oe_set(uint reg_index, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr p0, #10, %1, %0, c4" : : "r" (reg_index), "r" (mask));
}
__inline__ __attribute__((__always_inline__)) static void gpioc_index_oe_clr(uint reg_index, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr p0, #11, %1, %0, c4" : : "r" (reg_index), "r" (mask));
}
__inline__ __attribute__((__always_inline__)) static uint32_t gpioc_lo_out_get(void) {
    uint32_t lo;
    __asm volatile (".syntax unified\n" "mrc p0, #0, %0, c0, c0" : "=r" (lo));
    return lo;
}
__inline__ __attribute__((__always_inline__)) static uint32_t gpioc_hi_out_get(void) {
    uint32_t hi;
    __asm volatile (".syntax unified\n" "mrc p0, #0, %0, c0, c1" : "=r" (hi));
    return hi;
}
__inline__ __attribute__((__always_inline__)) static uint64_t gpioc_hilo_out_get(void) {
    uint32_t hi, lo;
    __asm volatile (".syntax unified\n" "mrrc p0, #0, %0, %1, c0" : "=r" (lo), "=r" (hi));
    return ((uint64_t)hi << 32) | lo;
}
__inline__ __attribute__((__always_inline__)) static uint32_t gpioc_lo_oe_get(void) {
    uint32_t lo;
    __asm volatile (".syntax unified\n" "mrc p0, #0, %0, c0, c4" : "=r" (lo));
    return lo;
}
__inline__ __attribute__((__always_inline__)) static uint32_t gpioc_hi_oe_get(void) {
    uint32_t hi;
    __asm volatile (".syntax unified\n" "mrc p0, #0, %0, c0, c5" : "=r" (hi));
    return hi;
}
__inline__ __attribute__((__always_inline__)) static uint64_t gpioc_hilo_oe_get(void) {
    uint32_t hi, lo;
    __asm volatile (".syntax unified\n" "mrrc p0, #0, %0, %1, c4" : "=r" (lo), "=r" (hi));
    return ((uint64_t)hi << 32) | lo;
}
__inline__ __attribute__((__always_inline__)) static uint32_t gpioc_lo_in_get(void) {
    uint32_t lo;
    __asm volatile (".syntax unified\n" "mrc p0, #0, %0, c0, c8" : "=r" (lo));
    return lo;
}
__inline__ __attribute__((__always_inline__)) static uint32_t gpioc_hi_in_get(void) {
    uint32_t hi;
    __asm volatile (".syntax unified\n" "mrc p0, #0, %0, c0, c9" : "=r" (hi));
    return hi;
}
__inline__ __attribute__((__always_inline__)) static uint64_t gpioc_hilo_in_get(void) {
    uint32_t hi, lo;
    __asm volatile (".syntax unified\n" "mrrc p0, #0, %0, %1, c8" : "=r" (lo), "=r" (hi));
    return ((uint64_t)hi << 32) | lo;
}
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_GPIO 0
enum gpio_dir {
    GPIO_OUT = 1u,
    GPIO_IN = 0u,
};
enum gpio_irq_level {
    GPIO_IRQ_LEVEL_LOW = 0x1u,
    GPIO_IRQ_LEVEL_HIGH = 0x2u,
    GPIO_IRQ_EDGE_FALL = 0x4u,
    GPIO_IRQ_EDGE_RISE = 0x8u,
};
typedef void (*gpio_irq_callback_t)(uint gpio, uint32_t event_mask);
enum gpio_override {
    GPIO_OVERRIDE_NORMAL = 0,
    GPIO_OVERRIDE_INVERT = 1,
    GPIO_OVERRIDE_LOW = 2,
    GPIO_OVERRIDE_HIGH = 3,
};
