gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
enum gpio_slew_rate {
    GPIO_SLEW_RATE_SLOW = 0,
    GPIO_SLEW_RATE_FAST = 1
};
enum gpio_drive_strength {
    GPIO_DRIVE_STRENGTH_2MA = 0,
    GPIO_DRIVE_STRENGTH_4MA = 1,
    GPIO_DRIVE_STRENGTH_8MA = 2,
    GPIO_DRIVE_STRENGTH_12MA = 3
};
static inline void check_gpio_param(__attribute__((__unused__)) uint gpio) {
    ({if (((0 || 0) && !0)) ((!(gpio >= 48u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_gpio/include/hardware/gpio.h", 245, __func__, "!(gpio >= 48u)"));});
}
void gpio_set_function(uint gpio, gpio_function_t fn);
void gpio_set_function_masked(uint32_t gpio_mask, gpio_function_t fn);
void gpio_set_function_masked64(uint64_t gpio_mask, gpio_function_t fn);
gpio_function_t gpio_get_function(uint gpio);
void gpio_set_pulls(uint gpio, _Bool up, _Bool down);
static inline void gpio_pull_up(uint gpio) {
    gpio_set_pulls(gpio, 1, 0);
}
static inline _Bool gpio_is_pulled_up(uint gpio) {
    return (((pads_bank0_hw_t *)0x40038000u)->io[gpio] & 0x00000008u) != 0;
}
static inline void gpio_pull_down(uint gpio) {
    gpio_set_pulls(gpio, 0, 1);
}
static inline _Bool gpio_is_pulled_down(uint gpio) {
    return (((pads_bank0_hw_t *)0x40038000u)->io[gpio] & 0x00000004u) != 0;
}
static inline void gpio_disable_pulls(uint gpio) {
    gpio_set_pulls(gpio, 0, 0);
}
void gpio_set_irqover(uint gpio, uint value);
void gpio_set_outover(uint gpio, uint value);
void gpio_set_inover(uint gpio, uint value);
void gpio_set_oeover(uint gpio, uint value);
void gpio_set_input_enabled(uint gpio, _Bool enabled);
void gpio_set_input_hysteresis_enabled(uint gpio, _Bool enabled);
_Bool gpio_is_input_hysteresis_enabled(uint gpio);
void gpio_set_slew_rate(uint gpio, enum gpio_slew_rate slew);
enum gpio_slew_rate gpio_get_slew_rate(uint gpio);
void gpio_set_drive_strength(uint gpio, enum gpio_drive_strength drive);
enum gpio_drive_strength gpio_get_drive_strength(uint gpio);
void gpio_set_irq_enabled(uint gpio, uint32_t event_mask, _Bool enabled);
#define GPIO_IRQ_CALLBACK_ORDER_PRIORITY PICO_SHARED_IRQ_HANDLER_LOWEST_ORDER_PRIORITY
#define GPIO_RAW_IRQ_HANDLER_DEFAULT_ORDER_PRIORITY PICO_SHARED_IRQ_HANDLER_DEFAULT_ORDER_PRIORITY
void gpio_set_irq_callback(gpio_irq_callback_t callback);
void gpio_set_irq_enabled_with_callback(uint gpio, uint32_t event_mask, _Bool enabled, gpio_irq_callback_t callback);
void gpio_set_dormant_irq_enabled(uint gpio, uint32_t event_mask, _Bool enabled);
static inline uint32_t gpio_get_irq_event_mask(uint gpio) {
    check_gpio_param(gpio);
    io_bank0_irq_ctrl_hw_t *irq_ctrl_base = get_core_num() ?
                                            &((io_bank0_hw_t *)0x40028000u)->proc1_irq_ctrl : &((io_bank0_hw_t *)0x40028000u)->proc0_irq_ctrl;
    io_ro_32 *status_reg = &irq_ctrl_base->ints[gpio >> 3u];
    return (*status_reg >> (4 * (gpio & 7u))) & 0xfu;
}
static inline void gpio_acknowledge_irq(uint gpio, uint32_t event_mask) {
    check_gpio_param(gpio);
    ((io_bank0_hw_t *)0x40028000u)->intr[gpio / 8] = event_mask << (4 * (gpio % 8));
}
void gpio_add_raw_irq_handler_with_order_priority_masked(uint32_t gpio_mask, irq_handler_t handler, uint8_t order_priority);
void gpio_add_raw_irq_handler_with_order_priority_masked64(uint64_t gpio_mask, irq_handler_t handler, uint8_t order_priority);
static inline void gpio_add_raw_irq_handler_with_order_priority(uint gpio, irq_handler_t handler, uint8_t order_priority) {
    check_gpio_param(gpio);
    gpio_add_raw_irq_handler_with_order_priority_masked64(1ull << gpio, handler, order_priority);
}
void gpio_add_raw_irq_handler_masked(uint32_t gpio_mask, irq_handler_t handler);
void gpio_add_raw_irq_handler_masked64(uint64_t gpio_mask, irq_handler_t handler);
static inline void gpio_add_raw_irq_handler(uint gpio, irq_handler_t handler) {
    check_gpio_param(gpio);
    gpio_add_raw_irq_handler_masked64(1ull << gpio, handler);
}
void gpio_remove_raw_irq_handler_masked(uint32_t gpio_mask, irq_handler_t handler);
void gpio_remove_raw_irq_handler_masked64(uint64_t gpio_mask, irq_handler_t handler);
static inline void gpio_remove_raw_irq_handler(uint gpio, irq_handler_t handler) {
    check_gpio_param(gpio);
    gpio_remove_raw_irq_handler_masked64(1ull << gpio, handler);
}
void gpio_init(uint gpio);
void gpio_deinit(uint gpio);
void gpio_init_mask(uint gpio_mask);
static inline _Bool gpio_get(uint gpio) {
    if (gpio < 32) {
        return ((sio_hw_t *)0xd0000000u)->gpio_in & (1u << gpio);
    } else {
        return ((sio_hw_t *)0xd0000000u)->gpio_hi_in & (1u << (gpio - 32));
    }
}
static inline uint32_t gpio_get_all(void) {
    return gpioc_lo_in_get();
}
static inline uint64_t gpio_get_all64(void) {
    return gpioc_hilo_in_get();
}
static inline void gpio_set_mask(uint32_t mask) {
    gpioc_lo_out_set(mask);
}
static inline void gpio_set_mask64(uint64_t mask) {
    gpioc_hilo_out_set(mask);
}
static inline void gpio_set_mask_n(uint n, uint32_t mask) {
    if (!n) {
        gpio_set_mask(mask);
    } else if (n == 1) {
        gpioc_hi_out_set(mask);
    }
}
static inline void gpio_clr_mask(uint32_t mask) {
    gpioc_lo_out_clr(mask);
}
static inline void gpio_clr_mask64(uint64_t mask) {
    gpioc_hilo_out_clr(mask);
}
static inline void gpio_clr_mask_n(uint n, uint32_t mask) {
    if (!n) {
        gpio_clr_mask(mask);
    } else if (n == 1) {
        gpioc_hi_out_clr(mask);
    }
}
static inline void gpio_xor_mask(uint32_t mask) {
    gpioc_lo_out_xor(mask);
}
static inline void gpio_xor_mask64(uint64_t mask) {
    gpioc_hilo_out_xor(mask);
}
static inline void gpio_xor_mask_n(uint n, uint32_t mask) {
    if (!n) {
        gpio_xor_mask(mask);
    } else if (n == 1) {
        gpioc_hi_out_xor(mask);
    }
}
static inline void gpio_put_masked(uint32_t mask, uint32_t value) {
    gpioc_lo_out_xor((gpioc_lo_out_get() ^ value) & mask);
}
static inline void gpio_put_masked64(uint64_t mask, uint64_t value) {
    gpioc_hilo_out_xor((gpioc_hilo_out_get() ^ value) & mask);
}
static inline void gpio_put_masked_n(uint n, uint32_t mask, uint32_t value) {
    if (!n) {
        gpio_put_masked(mask, value);
    } else if (n == 1) {
        gpioc_hi_out_xor((gpioc_hi_out_get() ^ value) & mask);
    }
}
static inline void gpio_put_all(uint32_t value) {
    gpioc_lo_out_put(value);
}
static inline void gpio_put_all64(uint64_t value) {
    gpioc_hilo_out_put(value);
}
static inline void gpio_put(uint gpio, _Bool value) {
    gpioc_bit_out_put(gpio, value);
}
static inline _Bool gpio_get_out_level(uint gpio) {
    uint32_t bits = gpio < 32 ? ((sio_hw_t *)0xd0000000u)->gpio_out : ((sio_hw_t *)0xd0000000u)->gpio_hi_out;
    return bits & (1u << (gpio & 0x1fu));
}
static inline void gpio_set_dir_out_masked(uint32_t mask) {
    gpioc_lo_oe_set(mask);
}
static inline void gpio_set_dir_out_masked64(uint64_t mask) {
    gpioc_hilo_oe_set(mask);
}
static inline void gpio_set_dir_in_masked(uint32_t mask) {
    gpioc_lo_oe_clr(mask);
}
static inline void gpio_set_dir_in_masked64(uint64_t mask) {
    gpioc_hilo_oe_clr(mask);
}
static inline void gpio_set_dir_masked(uint32_t mask, uint32_t value) {
    gpioc_lo_oe_xor((gpioc_lo_oe_get() ^ value) & mask);
}
static inline void gpio_set_dir_masked64(uint64_t mask, uint64_t value) {
    gpioc_hilo_oe_xor((gpioc_hilo_oe_get() ^ value) & mask);
}
static inline void gpio_set_dir_all_bits(uint32_t values) {
    gpioc_lo_oe_put(values);
}
static inline void gpio_set_dir_all_bits64(uint64_t values) {
    gpioc_hilo_oe_put(values);
}
static inline void gpio_set_dir(uint gpio, _Bool out) {
    gpioc_bit_oe_put(gpio, out);
}
static inline _Bool gpio_is_dir_out(uint gpio) {
    uint32_t bits = gpio < 32 ? ((sio_hw_t *)0xd0000000u)->gpio_oe : ((sio_hw_t *)0xd0000000u)->gpio_hi_oe;
    return bits & (1u << (gpio & 0x1fu));
}
static inline uint gpio_get_dir(uint gpio) {
    return gpio_is_dir_out(gpio);
}
extern void gpio_debug_pins_init(void);
#define PICO_DEBUG_PIN_BASE 19u
#define PICO_DEBUG_PIN_COUNT 3u
#define CU_REGISTER_DEBUG_PINS(...) enum __unused DEBUG_PIN_TYPE { _none = 0, __VA_ARGS__ }; static enum DEBUG_PIN_TYPE __selected_debug_pins;
#define CU_SELECT_DEBUG_PINS(x) static enum DEBUG_PIN_TYPE __selected_debug_pins = (x);
#define DEBUG_PINS_ENABLED(p) (__selected_debug_pins == (p))
#define DEBUG_PINS_SET(p,v) if (DEBUG_PINS_ENABLED(p)) gpio_set_mask((unsigned)(v)<<PICO_DEBUG_PIN_BASE)
#define DEBUG_PINS_CLR(p,v) if (DEBUG_PINS_ENABLED(p)) gpio_clr_mask((unsigned)(v)<<PICO_DEBUG_PIN_BASE)
#define DEBUG_PINS_XOR(p,v) if (DEBUG_PINS_ENABLED(p)) gpio_xor_mask((unsigned)(v)<<PICO_DEBUG_PIN_BASE)
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_ADC 0
#define ADC_TEMPERATURE_CHANNEL_NUM (NUM_ADC_CHANNELS - 1)
#define PICO_ADC_CLKDIV_ROUND_NEAREST PICO_CLKDIV_ROUND_NEAREST
void adc_init(void);
static inline void adc_gpio_init(uint gpio) {
    ({if (((0 || 0) && !0)) ((!(gpio < 40u || gpio >= 40u + 9u - 1)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_adc/include/hardware/adc.h", 96, __func__, "!(gpio < 40u || gpio >= 40u + 9u - 1)"));});
    gpio_set_function(gpio, GPIO_FUNC_NULL);
    gpio_disable_pulls(gpio);
    gpio_set_input_enabled(gpio, 0);
}
static inline void adc_select_input(uint input) {
    ({if (((0 || 0) && !0)) ((input < 9u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_adc/include/hardware/adc.h", 119, __func__, "input < 9u"));});
    hw_write_masked(&((adc_hw_t *)0x400a0000u)->cs, input << 12u, 0x0000f000u);
}
static inline uint adc_get_selected_input(void) {
    return (((adc_hw_t *)0x400a0000u)->cs & 0x0000f000u) >> 12u;
}
static inline void adc_set_round_robin(uint input_mask) {
    ({if (((0 || 0) && !0)) ((input_mask < (1 << 9u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_adc/include/hardware/adc.h", 151, __func__, "input_mask < (1 << 9u)"));});
    hw_write_masked(&((adc_hw_t *)0x400a0000u)->cs, input_mask << 16u, 0x01ff0000u);
}
static inline void adc_set_temp_sensor_enabled(_Bool enable) {
    if (enable)
        hw_set_bits(&((adc_hw_t *)0x400a0000u)->cs, 0x00000002u);
    else
        hw_clear_bits(&((adc_hw_t *)0x400a0000u)->cs, 0x00000002u);
}
static inline uint16_t adc_read(void) {
    hw_set_bits(&((adc_hw_t *)0x400a0000u)->cs, 0x00000004u);
    while (!(((adc_hw_t *)0x400a0000u)->cs & 0x00000100u))
        tight_loop_contents();
    return (uint16_t) ((adc_hw_t *)0x400a0000u)->result;
}
static inline void adc_run(_Bool run) {
    if (run)
        hw_set_bits(&((adc_hw_t *)0x400a0000u)->cs, 0x00000008u);
    else
        hw_clear_bits(&((adc_hw_t *)0x400a0000u)->cs, 0x00000008u);
}
static inline void adc_set_clkdiv(float clkdiv) {
    ({if (((0 || 0) && !0)) ((!(clkdiv >= 1 << (23u + 1 - 8u))) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_adc/include/hardware/adc.h", 205, __func__, "!(clkdiv >= 1 << (23u + 1 - 8u))"));});
    const int frac_bit_count = (7u + 1 - 0u);
    clkdiv += 0.5f / (1 << frac_bit_count);
    ((adc_hw_t *)0x400a0000u)->div = (uint32_t)(clkdiv * (float) (1 << frac_bit_count));
}
 static inline void adc_fifo_setup(_Bool en, _Bool dreq_en, uint16_t dreq_thresh, _Bool err_in_fifo, _Bool byte_shift) {
    hw_write_masked(&((adc_hw_t *)0x400a0000u)->fcs,
                   (((uint)!!(en)) << 0u) |
                   (((uint)!!(dreq_en)) << 3u) |
                   (((uint)dreq_thresh) << 24u) |
                   (((uint)!!(err_in_fifo)) << 2u) |
                   (((uint)!!(byte_shift)) << 1u),
                   0x00000001u |
                   0x00000008u |
                   0x0f000000u |
                   0x00000004u |
                   0x00000002u
    );
}
static inline _Bool adc_fifo_is_empty(void) {
    return ((adc_hw_t *)0x400a0000u)->fcs & 0x00000100u;
}
static inline uint8_t adc_fifo_get_level(void) {
    return (((adc_hw_t *)0x400a0000u)->fcs & 0x000f0000u) >> 16u;
}
static inline uint16_t adc_fifo_get(void) {
    return (uint16_t)((adc_hw_t *)0x400a0000u)->fifo;
}
static inline uint16_t adc_fifo_get_blocking(void) {
    while (adc_fifo_is_empty())
        tight_loop_contents();
    return (uint16_t)((adc_hw_t *)0x400a0000u)->fifo;
}
static inline void adc_fifo_drain(void) {
    while (!(((adc_hw_t *)0x400a0000u)->cs & 0x00000100u))
        tight_loop_contents();
    while (!adc_fifo_is_empty())
        (void) adc_fifo_get();
}
static inline void adc_irq_set_enabled(_Bool enabled) {
    ((adc_hw_t *)0x400a0000u)->inte = !!enabled;
}
#define _HARDWARE_BOOT_LOCK_H 
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_BOOT_LOCK 0
#define _HARDWARE_STRUCTS_BOOTRAM_H 
#define _HARDWARE_REGS_BOOTRAM_H 
#define BOOTRAM_WRITE_ONCE0_OFFSET 0x00000800u
#define BOOTRAM_WRITE_ONCE0_BITS 0xffffffffu
#define BOOTRAM_WRITE_ONCE0_RESET 0x00000000u
#define BOOTRAM_WRITE_ONCE0_MSB 31u
#define BOOTRAM_WRITE_ONCE0_LSB 0u
#define BOOTRAM_WRITE_ONCE0_ACCESS "RW"
#define BOOTRAM_WRITE_ONCE1_OFFSET 0x00000804u
#define BOOTRAM_WRITE_ONCE1_BITS 0xffffffffu
#define BOOTRAM_WRITE_ONCE1_RESET 0x00000000u
#define BOOTRAM_WRITE_ONCE1_MSB 31u
#define BOOTRAM_WRITE_ONCE1_LSB 0u
#define BOOTRAM_WRITE_ONCE1_ACCESS "RW"
#define BOOTRAM_BOOTLOCK_STAT_OFFSET 0x00000808u
#define BOOTRAM_BOOTLOCK_STAT_BITS 0x000000ffu
#define BOOTRAM_BOOTLOCK_STAT_RESET 0x000000ffu
#define BOOTRAM_BOOTLOCK_STAT_MSB 7u
#define BOOTRAM_BOOTLOCK_STAT_LSB 0u
#define BOOTRAM_BOOTLOCK_STAT_ACCESS "RW"
#define BOOTRAM_BOOTLOCK0_OFFSET 0x0000080cu
#define BOOTRAM_BOOTLOCK0_BITS 0xffffffffu
#define BOOTRAM_BOOTLOCK0_RESET 0x00000000u
#define BOOTRAM_BOOTLOCK0_MSB 31u
#define BOOTRAM_BOOTLOCK0_LSB 0u
#define BOOTRAM_BOOTLOCK0_ACCESS "RW"
#define BOOTRAM_BOOTLOCK1_OFFSET 0x00000810u
#define BOOTRAM_BOOTLOCK1_BITS 0xffffffffu
#define BOOTRAM_BOOTLOCK1_RESET 0x00000000u
#define BOOTRAM_BOOTLOCK1_MSB 31u
#define BOOTRAM_BOOTLOCK1_LSB 0u
#define BOOTRAM_BOOTLOCK1_ACCESS "RW"
#define BOOTRAM_BOOTLOCK2_OFFSET 0x00000814u
#define BOOTRAM_BOOTLOCK2_BITS 0xffffffffu
#define BOOTRAM_BOOTLOCK2_RESET 0x00000000u
#define BOOTRAM_BOOTLOCK2_MSB 31u
#define BOOTRAM_BOOTLOCK2_LSB 0u
#define BOOTRAM_BOOTLOCK2_ACCESS "RW"
#define BOOTRAM_BOOTLOCK3_OFFSET 0x00000818u
#define BOOTRAM_BOOTLOCK3_BITS 0xffffffffu
#define BOOTRAM_BOOTLOCK3_RESET 0x00000000u
#define BOOTRAM_BOOTLOCK3_MSB 31u
#define BOOTRAM_BOOTLOCK3_LSB 0u
#define BOOTRAM_BOOTLOCK3_ACCESS "RW"
#define BOOTRAM_BOOTLOCK4_OFFSET 0x0000081cu
#define BOOTRAM_BOOTLOCK4_BITS 0xffffffffu
#define BOOTRAM_BOOTLOCK4_RESET 0x00000000u
#define BOOTRAM_BOOTLOCK4_MSB 31u
#define BOOTRAM_BOOTLOCK4_LSB 0u
#define BOOTRAM_BOOTLOCK4_ACCESS "RW"
#define BOOTRAM_BOOTLOCK5_OFFSET 0x00000820u
#define BOOTRAM_BOOTLOCK5_BITS 0xffffffffu
#define BOOTRAM_BOOTLOCK5_RESET 0x00000000u
#define BOOTRAM_BOOTLOCK5_MSB 31u
#define BOOTRAM_BOOTLOCK5_LSB 0u
#define BOOTRAM_BOOTLOCK5_ACCESS "RW"
#define BOOTRAM_BOOTLOCK6_OFFSET 0x00000824u
#define BOOTRAM_BOOTLOCK6_BITS 0xffffffffu
#define BOOTRAM_BOOTLOCK6_RESET 0x00000000u
#define BOOTRAM_BOOTLOCK6_MSB 31u
#define BOOTRAM_BOOTLOCK6_LSB 0u
#define BOOTRAM_BOOTLOCK6_ACCESS "RW"
#define BOOTRAM_BOOTLOCK7_OFFSET 0x00000828u
#define BOOTRAM_BOOTLOCK7_BITS 0xffffffffu
#define BOOTRAM_BOOTLOCK7_RESET 0x00000000u
#define BOOTRAM_BOOTLOCK7_MSB 31u
#define BOOTRAM_BOOTLOCK7_LSB 0u
#define BOOTRAM_BOOTLOCK7_ACCESS "RW"
typedef struct {
   
    io_rw_32 write_once[2];
   
    io_rw_32 bootlock_stat;
   
