gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define CLOCKS_CLK_HSTX_CTRL_NUDGE_LSB 20u
#define CLOCKS_CLK_HSTX_CTRL_NUDGE_ACCESS "RW"
#define CLOCKS_CLK_HSTX_CTRL_PHASE_RESET 0x0u
#define CLOCKS_CLK_HSTX_CTRL_PHASE_BITS 0x00030000u
#define CLOCKS_CLK_HSTX_CTRL_PHASE_MSB 17u
#define CLOCKS_CLK_HSTX_CTRL_PHASE_LSB 16u
#define CLOCKS_CLK_HSTX_CTRL_PHASE_ACCESS "RW"
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_RESET 0x0u
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_BITS 0x00000800u
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_MSB 11u
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_LSB 11u
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_ACCESS "RW"
#define CLOCKS_CLK_HSTX_CTRL_KILL_RESET 0x0u
#define CLOCKS_CLK_HSTX_CTRL_KILL_BITS 0x00000400u
#define CLOCKS_CLK_HSTX_CTRL_KILL_MSB 10u
#define CLOCKS_CLK_HSTX_CTRL_KILL_LSB 10u
#define CLOCKS_CLK_HSTX_CTRL_KILL_ACCESS "RW"
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_RESET 0x0u
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_BITS 0x000000e0u
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_MSB 7u
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLK_SYS 0x0u
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS 0x1u
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x2u
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x3u
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x4u
#define CLOCKS_CLK_HSTX_DIV_OFFSET 0x00000058u
#define CLOCKS_CLK_HSTX_DIV_BITS 0x00030000u
#define CLOCKS_CLK_HSTX_DIV_RESET 0x00010000u
#define CLOCKS_CLK_HSTX_DIV_INT_RESET 0x1u
#define CLOCKS_CLK_HSTX_DIV_INT_BITS 0x00030000u
#define CLOCKS_CLK_HSTX_DIV_INT_MSB 17u
#define CLOCKS_CLK_HSTX_DIV_INT_LSB 16u
#define CLOCKS_CLK_HSTX_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_HSTX_SELECTED_OFFSET 0x0000005cu
#define CLOCKS_CLK_HSTX_SELECTED_BITS 0x00000001u
#define CLOCKS_CLK_HSTX_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_HSTX_SELECTED_MSB 0u
#define CLOCKS_CLK_HSTX_SELECTED_LSB 0u
#define CLOCKS_CLK_HSTX_SELECTED_ACCESS "RO"
#define CLOCKS_CLK_USB_CTRL_OFFSET 0x00000060u
#define CLOCKS_CLK_USB_CTRL_BITS 0x10130ce0u
#define CLOCKS_CLK_USB_CTRL_RESET 0x00000000u
#define CLOCKS_CLK_USB_CTRL_ENABLED_RESET 0x0u
#define CLOCKS_CLK_USB_CTRL_ENABLED_BITS 0x10000000u
#define CLOCKS_CLK_USB_CTRL_ENABLED_MSB 28u
#define CLOCKS_CLK_USB_CTRL_ENABLED_LSB 28u
#define CLOCKS_CLK_USB_CTRL_ENABLED_ACCESS "RO"
#define CLOCKS_CLK_USB_CTRL_NUDGE_RESET 0x0u
#define CLOCKS_CLK_USB_CTRL_NUDGE_BITS 0x00100000u
#define CLOCKS_CLK_USB_CTRL_NUDGE_MSB 20u
#define CLOCKS_CLK_USB_CTRL_NUDGE_LSB 20u
#define CLOCKS_CLK_USB_CTRL_NUDGE_ACCESS "RW"
#define CLOCKS_CLK_USB_CTRL_PHASE_RESET 0x0u
#define CLOCKS_CLK_USB_CTRL_PHASE_BITS 0x00030000u
#define CLOCKS_CLK_USB_CTRL_PHASE_MSB 17u
#define CLOCKS_CLK_USB_CTRL_PHASE_LSB 16u
#define CLOCKS_CLK_USB_CTRL_PHASE_ACCESS "RW"
#define CLOCKS_CLK_USB_CTRL_ENABLE_RESET 0x0u
#define CLOCKS_CLK_USB_CTRL_ENABLE_BITS 0x00000800u
#define CLOCKS_CLK_USB_CTRL_ENABLE_MSB 11u
#define CLOCKS_CLK_USB_CTRL_ENABLE_LSB 11u
#define CLOCKS_CLK_USB_CTRL_ENABLE_ACCESS "RW"
#define CLOCKS_CLK_USB_CTRL_KILL_RESET 0x0u
#define CLOCKS_CLK_USB_CTRL_KILL_BITS 0x00000400u
#define CLOCKS_CLK_USB_CTRL_KILL_MSB 10u
#define CLOCKS_CLK_USB_CTRL_KILL_LSB 10u
#define CLOCKS_CLK_USB_CTRL_KILL_ACCESS "RW"
#define CLOCKS_CLK_USB_CTRL_AUXSRC_RESET 0x0u
#define CLOCKS_CLK_USB_CTRL_AUXSRC_BITS 0x000000e0u
#define CLOCKS_CLK_USB_CTRL_AUXSRC_MSB 7u
#define CLOCKS_CLK_USB_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_USB_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x0u
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS 0x1u
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH 0x2u
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_XOSC_CLKSRC 0x3u
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x4u
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x5u
#define CLOCKS_CLK_USB_DIV_OFFSET 0x00000064u
#define CLOCKS_CLK_USB_DIV_BITS 0x000f0000u
#define CLOCKS_CLK_USB_DIV_RESET 0x00010000u
#define CLOCKS_CLK_USB_DIV_INT_RESET 0x1u
#define CLOCKS_CLK_USB_DIV_INT_BITS 0x000f0000u
#define CLOCKS_CLK_USB_DIV_INT_MSB 19u
#define CLOCKS_CLK_USB_DIV_INT_LSB 16u
#define CLOCKS_CLK_USB_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_USB_SELECTED_OFFSET 0x00000068u
#define CLOCKS_CLK_USB_SELECTED_BITS 0x00000001u
#define CLOCKS_CLK_USB_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_USB_SELECTED_MSB 0u
#define CLOCKS_CLK_USB_SELECTED_LSB 0u
#define CLOCKS_CLK_USB_SELECTED_ACCESS "RO"
#define CLOCKS_CLK_ADC_CTRL_OFFSET 0x0000006cu
#define CLOCKS_CLK_ADC_CTRL_BITS 0x10130ce0u
#define CLOCKS_CLK_ADC_CTRL_RESET 0x00000000u
#define CLOCKS_CLK_ADC_CTRL_ENABLED_RESET 0x0u
#define CLOCKS_CLK_ADC_CTRL_ENABLED_BITS 0x10000000u
#define CLOCKS_CLK_ADC_CTRL_ENABLED_MSB 28u
#define CLOCKS_CLK_ADC_CTRL_ENABLED_LSB 28u
#define CLOCKS_CLK_ADC_CTRL_ENABLED_ACCESS "RO"
#define CLOCKS_CLK_ADC_CTRL_NUDGE_RESET 0x0u
#define CLOCKS_CLK_ADC_CTRL_NUDGE_BITS 0x00100000u
#define CLOCKS_CLK_ADC_CTRL_NUDGE_MSB 20u
#define CLOCKS_CLK_ADC_CTRL_NUDGE_LSB 20u
#define CLOCKS_CLK_ADC_CTRL_NUDGE_ACCESS "RW"
#define CLOCKS_CLK_ADC_CTRL_PHASE_RESET 0x0u
#define CLOCKS_CLK_ADC_CTRL_PHASE_BITS 0x00030000u
#define CLOCKS_CLK_ADC_CTRL_PHASE_MSB 17u
#define CLOCKS_CLK_ADC_CTRL_PHASE_LSB 16u
#define CLOCKS_CLK_ADC_CTRL_PHASE_ACCESS "RW"
#define CLOCKS_CLK_ADC_CTRL_ENABLE_RESET 0x0u
#define CLOCKS_CLK_ADC_CTRL_ENABLE_BITS 0x00000800u
#define CLOCKS_CLK_ADC_CTRL_ENABLE_MSB 11u
#define CLOCKS_CLK_ADC_CTRL_ENABLE_LSB 11u
#define CLOCKS_CLK_ADC_CTRL_ENABLE_ACCESS "RW"
#define CLOCKS_CLK_ADC_CTRL_KILL_RESET 0x0u
#define CLOCKS_CLK_ADC_CTRL_KILL_BITS 0x00000400u
#define CLOCKS_CLK_ADC_CTRL_KILL_MSB 10u
#define CLOCKS_CLK_ADC_CTRL_KILL_LSB 10u
#define CLOCKS_CLK_ADC_CTRL_KILL_ACCESS "RW"
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_RESET 0x0u
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_BITS 0x000000e0u
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_MSB 7u
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x0u
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS 0x1u
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH 0x2u
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_XOSC_CLKSRC 0x3u
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x4u
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x5u
#define CLOCKS_CLK_ADC_DIV_OFFSET 0x00000070u
#define CLOCKS_CLK_ADC_DIV_BITS 0x000f0000u
#define CLOCKS_CLK_ADC_DIV_RESET 0x00010000u
#define CLOCKS_CLK_ADC_DIV_INT_RESET 0x1u
#define CLOCKS_CLK_ADC_DIV_INT_BITS 0x000f0000u
#define CLOCKS_CLK_ADC_DIV_INT_MSB 19u
#define CLOCKS_CLK_ADC_DIV_INT_LSB 16u
#define CLOCKS_CLK_ADC_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_ADC_SELECTED_OFFSET 0x00000074u
#define CLOCKS_CLK_ADC_SELECTED_BITS 0x00000001u
#define CLOCKS_CLK_ADC_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_ADC_SELECTED_MSB 0u
#define CLOCKS_CLK_ADC_SELECTED_LSB 0u
#define CLOCKS_CLK_ADC_SELECTED_ACCESS "RO"
#define CLOCKS_DFTCLK_XOSC_CTRL_OFFSET 0x00000078u
#define CLOCKS_DFTCLK_XOSC_CTRL_BITS 0x00000003u
#define CLOCKS_DFTCLK_XOSC_CTRL_RESET 0x00000000u
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_RESET 0x0u
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_BITS 0x00000003u
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_MSB 1u
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_LSB 0u
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_ACCESS "RW"
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_VALUE_NULL 0x0u
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_VALUE_CLKSRC_PLL_USB_PRIMARY 0x1u
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_VALUE_CLKSRC_GPIN0 0x2u
#define CLOCKS_DFTCLK_ROSC_CTRL_OFFSET 0x0000007cu
#define CLOCKS_DFTCLK_ROSC_CTRL_BITS 0x00000003u
#define CLOCKS_DFTCLK_ROSC_CTRL_RESET 0x00000000u
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_RESET 0x0u
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_BITS 0x00000003u
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_MSB 1u
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_LSB 0u
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_ACCESS "RW"
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_VALUE_NULL 0x0u
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_VALUE_CLKSRC_PLL_SYS_PRIMARY_ROSC 0x1u
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_VALUE_CLKSRC_GPIN1 0x2u
#define CLOCKS_DFTCLK_LPOSC_CTRL_OFFSET 0x00000080u
#define CLOCKS_DFTCLK_LPOSC_CTRL_BITS 0x00000003u
#define CLOCKS_DFTCLK_LPOSC_CTRL_RESET 0x00000000u
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_RESET 0x0u
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_BITS 0x00000003u
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_MSB 1u
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_LSB 0u
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_ACCESS "RW"
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_VALUE_NULL 0x0u
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_VALUE_CLKSRC_PLL_USB_PRIMARY_LPOSC 0x1u
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_VALUE_CLKSRC_GPIN1 0x2u
#define CLOCKS_CLK_SYS_RESUS_CTRL_OFFSET 0x00000084u
#define CLOCKS_CLK_SYS_RESUS_CTRL_BITS 0x000111ffu
#define CLOCKS_CLK_SYS_RESUS_CTRL_RESET 0x000000ffu
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_RESET 0x0u
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_BITS 0x00010000u
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_MSB 16u
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_LSB 16u
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_ACCESS "RW"
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_RESET 0x0u
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_BITS 0x00001000u
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_MSB 12u
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_LSB 12u
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_ACCESS "RW"
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_RESET 0x0u
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_BITS 0x00000100u
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_MSB 8u
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_LSB 8u
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_ACCESS "RW"
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_RESET 0xffu
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_BITS 0x000000ffu
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_MSB 7u
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_LSB 0u
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_ACCESS "RW"
#define CLOCKS_CLK_SYS_RESUS_STATUS_OFFSET 0x00000088u
#define CLOCKS_CLK_SYS_RESUS_STATUS_BITS 0x00000001u
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESET 0x00000000u
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_RESET 0x0u
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_BITS 0x00000001u
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_MSB 0u
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_LSB 0u
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_ACCESS "RO"
#define CLOCKS_FC0_REF_KHZ_OFFSET 0x0000008cu
#define CLOCKS_FC0_REF_KHZ_BITS 0x000fffffu
#define CLOCKS_FC0_REF_KHZ_RESET 0x00000000u
#define CLOCKS_FC0_REF_KHZ_MSB 19u
#define CLOCKS_FC0_REF_KHZ_LSB 0u
#define CLOCKS_FC0_REF_KHZ_ACCESS "RW"
#define CLOCKS_FC0_MIN_KHZ_OFFSET 0x00000090u
#define CLOCKS_FC0_MIN_KHZ_BITS 0x01ffffffu
#define CLOCKS_FC0_MIN_KHZ_RESET 0x00000000u
#define CLOCKS_FC0_MIN_KHZ_MSB 24u
#define CLOCKS_FC0_MIN_KHZ_LSB 0u
#define CLOCKS_FC0_MIN_KHZ_ACCESS "RW"
#define CLOCKS_FC0_MAX_KHZ_OFFSET 0x00000094u
#define CLOCKS_FC0_MAX_KHZ_BITS 0x01ffffffu
#define CLOCKS_FC0_MAX_KHZ_RESET 0x01ffffffu
#define CLOCKS_FC0_MAX_KHZ_MSB 24u
#define CLOCKS_FC0_MAX_KHZ_LSB 0u
#define CLOCKS_FC0_MAX_KHZ_ACCESS "RW"
#define CLOCKS_FC0_DELAY_OFFSET 0x00000098u
#define CLOCKS_FC0_DELAY_BITS 0x00000007u
#define CLOCKS_FC0_DELAY_RESET 0x00000001u
#define CLOCKS_FC0_DELAY_MSB 2u
#define CLOCKS_FC0_DELAY_LSB 0u
#define CLOCKS_FC0_DELAY_ACCESS "RW"
#define CLOCKS_FC0_INTERVAL_OFFSET 0x0000009cu
#define CLOCKS_FC0_INTERVAL_BITS 0x0000000fu
#define CLOCKS_FC0_INTERVAL_RESET 0x00000008u
#define CLOCKS_FC0_INTERVAL_MSB 3u
#define CLOCKS_FC0_INTERVAL_LSB 0u
#define CLOCKS_FC0_INTERVAL_ACCESS "RW"
#define CLOCKS_FC0_SRC_OFFSET 0x000000a0u
#define CLOCKS_FC0_SRC_BITS 0x000000ffu
#define CLOCKS_FC0_SRC_RESET 0x00000000u
#define CLOCKS_FC0_SRC_MSB 7u
#define CLOCKS_FC0_SRC_LSB 0u
#define CLOCKS_FC0_SRC_ACCESS "RW"
#define CLOCKS_FC0_SRC_VALUE_NULL 0x00u
#define CLOCKS_FC0_SRC_VALUE_PLL_SYS_CLKSRC_PRIMARY 0x01u
#define CLOCKS_FC0_SRC_VALUE_PLL_USB_CLKSRC_PRIMARY 0x02u
#define CLOCKS_FC0_SRC_VALUE_ROSC_CLKSRC 0x03u
#define CLOCKS_FC0_SRC_VALUE_ROSC_CLKSRC_PH 0x04u
#define CLOCKS_FC0_SRC_VALUE_XOSC_CLKSRC 0x05u
#define CLOCKS_FC0_SRC_VALUE_CLKSRC_GPIN0 0x06u
#define CLOCKS_FC0_SRC_VALUE_CLKSRC_GPIN1 0x07u
#define CLOCKS_FC0_SRC_VALUE_CLK_REF 0x08u
#define CLOCKS_FC0_SRC_VALUE_CLK_SYS 0x09u
#define CLOCKS_FC0_SRC_VALUE_CLK_PERI 0x0au
#define CLOCKS_FC0_SRC_VALUE_CLK_USB 0x0bu
#define CLOCKS_FC0_SRC_VALUE_CLK_ADC 0x0cu
#define CLOCKS_FC0_SRC_VALUE_CLK_HSTX 0x0du
#define CLOCKS_FC0_SRC_VALUE_LPOSC_CLKSRC 0x0eu
#define CLOCKS_FC0_SRC_VALUE_OTP_CLK2FC 0x0fu
#define CLOCKS_FC0_SRC_VALUE_PLL_USB_CLKSRC_PRIMARY_DFT 0x10u
#define CLOCKS_FC0_STATUS_OFFSET 0x000000a4u
#define CLOCKS_FC0_STATUS_BITS 0x11111111u
#define CLOCKS_FC0_STATUS_RESET 0x00000000u
#define CLOCKS_FC0_STATUS_DIED_RESET 0x0u
#define CLOCKS_FC0_STATUS_DIED_BITS 0x10000000u
#define CLOCKS_FC0_STATUS_DIED_MSB 28u
#define CLOCKS_FC0_STATUS_DIED_LSB 28u
#define CLOCKS_FC0_STATUS_DIED_ACCESS "RO"
#define CLOCKS_FC0_STATUS_FAST_RESET 0x0u
#define CLOCKS_FC0_STATUS_FAST_BITS 0x01000000u
#define CLOCKS_FC0_STATUS_FAST_MSB 24u
#define CLOCKS_FC0_STATUS_FAST_LSB 24u
#define CLOCKS_FC0_STATUS_FAST_ACCESS "RO"
#define CLOCKS_FC0_STATUS_SLOW_RESET 0x0u
#define CLOCKS_FC0_STATUS_SLOW_BITS 0x00100000u
#define CLOCKS_FC0_STATUS_SLOW_MSB 20u
#define CLOCKS_FC0_STATUS_SLOW_LSB 20u
#define CLOCKS_FC0_STATUS_SLOW_ACCESS "RO"
#define CLOCKS_FC0_STATUS_FAIL_RESET 0x0u
#define CLOCKS_FC0_STATUS_FAIL_BITS 0x00010000u
#define CLOCKS_FC0_STATUS_FAIL_MSB 16u
#define CLOCKS_FC0_STATUS_FAIL_LSB 16u
#define CLOCKS_FC0_STATUS_FAIL_ACCESS "RO"
#define CLOCKS_FC0_STATUS_WAITING_RESET 0x0u
#define CLOCKS_FC0_STATUS_WAITING_BITS 0x00001000u
#define CLOCKS_FC0_STATUS_WAITING_MSB 12u
#define CLOCKS_FC0_STATUS_WAITING_LSB 12u
#define CLOCKS_FC0_STATUS_WAITING_ACCESS "RO"
#define CLOCKS_FC0_STATUS_RUNNING_RESET 0x0u
#define CLOCKS_FC0_STATUS_RUNNING_BITS 0x00000100u
#define CLOCKS_FC0_STATUS_RUNNING_MSB 8u
#define CLOCKS_FC0_STATUS_RUNNING_LSB 8u
#define CLOCKS_FC0_STATUS_RUNNING_ACCESS "RO"
#define CLOCKS_FC0_STATUS_DONE_RESET 0x0u
#define CLOCKS_FC0_STATUS_DONE_BITS 0x00000010u
#define CLOCKS_FC0_STATUS_DONE_MSB 4u
#define CLOCKS_FC0_STATUS_DONE_LSB 4u
#define CLOCKS_FC0_STATUS_DONE_ACCESS "RO"
#define CLOCKS_FC0_STATUS_PASS_RESET 0x0u
#define CLOCKS_FC0_STATUS_PASS_BITS 0x00000001u
#define CLOCKS_FC0_STATUS_PASS_MSB 0u
#define CLOCKS_FC0_STATUS_PASS_LSB 0u
#define CLOCKS_FC0_STATUS_PASS_ACCESS "RO"
#define CLOCKS_FC0_RESULT_OFFSET 0x000000a8u
#define CLOCKS_FC0_RESULT_BITS 0x3fffffffu
#define CLOCKS_FC0_RESULT_RESET 0x00000000u
#define CLOCKS_FC0_RESULT_KHZ_RESET 0x0000000u
#define CLOCKS_FC0_RESULT_KHZ_BITS 0x3fffffe0u
#define CLOCKS_FC0_RESULT_KHZ_MSB 29u
#define CLOCKS_FC0_RESULT_KHZ_LSB 5u
#define CLOCKS_FC0_RESULT_KHZ_ACCESS "RO"
#define CLOCKS_FC0_RESULT_FRAC_RESET 0x00u
#define CLOCKS_FC0_RESULT_FRAC_BITS 0x0000001fu
#define CLOCKS_FC0_RESULT_FRAC_MSB 4u
#define CLOCKS_FC0_RESULT_FRAC_LSB 0u
#define CLOCKS_FC0_RESULT_FRAC_ACCESS "RO"
#define CLOCKS_WAKE_EN0_OFFSET 0x000000acu
#define CLOCKS_WAKE_EN0_BITS 0xffffffffu
#define CLOCKS_WAKE_EN0_RESET 0xffffffffu
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_BITS 0x80000000u
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_MSB 31u
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_LSB 31u
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_BITS 0x40000000u
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_MSB 30u
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_LSB 30u
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_BITS 0x20000000u
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_MSB 29u
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_LSB 29u
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_BITS 0x10000000u
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_MSB 28u
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_LSB 28u
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_BITS 0x08000000u
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_MSB 27u
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_LSB 27u
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_BITS 0x04000000u
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_MSB 26u
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_LSB 26u
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_BITS 0x02000000u
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_MSB 25u
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_LSB 25u
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_BITS 0x01000000u
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_MSB 24u
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_LSB 24u
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_BITS 0x00800000u
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_MSB 23u
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_LSB 23u
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_BITS 0x00400000u
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_MSB 22u
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_LSB 22u
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_BITS 0x00200000u
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_MSB 21u
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_LSB 21u
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_BITS 0x00100000u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_MSB 20u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_LSB 20u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_BITS 0x00080000u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_MSB 19u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_LSB 19u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_BITS 0x00040000u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_MSB 18u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_LSB 18u
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_BITS 0x00020000u
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_MSB 17u
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_LSB 17u
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_BITS 0x00010000u
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_MSB 16u
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_LSB 16u
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_BITS 0x00008000u
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_MSB 15u
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_LSB 15u
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_BITS 0x00004000u
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_MSB 14u
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_LSB 14u
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_BITS 0x00002000u
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_MSB 13u
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_LSB 13u
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_BITS 0x00001000u
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_MSB 12u
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_LSB 12u
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_BITS 0x00000800u
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_MSB 11u
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_LSB 11u
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_BITS 0x00000400u
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_MSB 10u
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_LSB 10u
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_HSTX_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_HSTX_BITS 0x00000200u
#define CLOCKS_WAKE_EN0_CLK_HSTX_MSB 9u
#define CLOCKS_WAKE_EN0_CLK_HSTX_LSB 9u
#define CLOCKS_WAKE_EN0_CLK_HSTX_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_BITS 0x00000100u
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_MSB 8u
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_LSB 8u
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_BITS 0x00000080u
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_MSB 7u
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_LSB 7u
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_BITS 0x00000040u
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_MSB 6u
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_LSB 6u
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_BITS 0x00000020u
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_MSB 5u
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_LSB 5u
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_BITS 0x00000010u
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_MSB 4u
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_LSB 4u
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_BITS 0x00000008u
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_MSB 3u
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_LSB 3u
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_ADC_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_ADC_BITS 0x00000004u
#define CLOCKS_WAKE_EN0_CLK_ADC_MSB 2u
#define CLOCKS_WAKE_EN0_CLK_ADC_LSB 2u
#define CLOCKS_WAKE_EN0_CLK_ADC_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_BITS 0x00000002u
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_MSB 1u
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_LSB 1u
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_ACCESS "RW"
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_RESET 0x1u
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_BITS 0x00000001u
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_MSB 0u
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_LSB 0u
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_ACCESS "RW"
#define CLOCKS_WAKE_EN1_OFFSET 0x000000b0u
#define CLOCKS_WAKE_EN1_BITS 0x7fffffffu
#define CLOCKS_WAKE_EN1_RESET 0x7fffffffu
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_BITS 0x40000000u
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_MSB 30u
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_LSB 30u
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_BITS 0x20000000u
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_MSB 29u
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_LSB 29u
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_BITS 0x10000000u
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_MSB 28u
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_LSB 28u
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_USB_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_USB_BITS 0x08000000u
#define CLOCKS_WAKE_EN1_CLK_USB_MSB 27u
#define CLOCKS_WAKE_EN1_CLK_USB_LSB 27u
#define CLOCKS_WAKE_EN1_CLK_USB_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_RESET 0x1u
