gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define DMA_CH14_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD 0x2u
#define DMA_CH14_CTRL_TRIG_HIGH_PRIORITY_RESET 0x0u
#define DMA_CH14_CTRL_TRIG_HIGH_PRIORITY_BITS 0x00000002u
#define DMA_CH14_CTRL_TRIG_HIGH_PRIORITY_MSB 1u
#define DMA_CH14_CTRL_TRIG_HIGH_PRIORITY_LSB 1u
#define DMA_CH14_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
#define DMA_CH14_CTRL_TRIG_EN_RESET 0x0u
#define DMA_CH14_CTRL_TRIG_EN_BITS 0x00000001u
#define DMA_CH14_CTRL_TRIG_EN_MSB 0u
#define DMA_CH14_CTRL_TRIG_EN_LSB 0u
#define DMA_CH14_CTRL_TRIG_EN_ACCESS "RW"
#define DMA_CH14_AL1_CTRL_OFFSET 0x00000390u
#define DMA_CH14_AL1_CTRL_BITS 0xffffffffu
#define DMA_CH14_AL1_CTRL_RESET "-"
#define DMA_CH14_AL1_CTRL_MSB 31u
#define DMA_CH14_AL1_CTRL_LSB 0u
#define DMA_CH14_AL1_CTRL_ACCESS "RW"
#define DMA_CH14_AL1_READ_ADDR_OFFSET 0x00000394u
#define DMA_CH14_AL1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH14_AL1_READ_ADDR_RESET "-"
#define DMA_CH14_AL1_READ_ADDR_MSB 31u
#define DMA_CH14_AL1_READ_ADDR_LSB 0u
#define DMA_CH14_AL1_READ_ADDR_ACCESS "RW"
#define DMA_CH14_AL1_WRITE_ADDR_OFFSET 0x00000398u
#define DMA_CH14_AL1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH14_AL1_WRITE_ADDR_RESET "-"
#define DMA_CH14_AL1_WRITE_ADDR_MSB 31u
#define DMA_CH14_AL1_WRITE_ADDR_LSB 0u
#define DMA_CH14_AL1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH14_AL1_TRANS_COUNT_TRIG_OFFSET 0x0000039cu
#define DMA_CH14_AL1_TRANS_COUNT_TRIG_BITS 0xffffffffu
#define DMA_CH14_AL1_TRANS_COUNT_TRIG_RESET "-"
#define DMA_CH14_AL1_TRANS_COUNT_TRIG_MSB 31u
#define DMA_CH14_AL1_TRANS_COUNT_TRIG_LSB 0u
#define DMA_CH14_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
#define DMA_CH14_AL2_CTRL_OFFSET 0x000003a0u
#define DMA_CH14_AL2_CTRL_BITS 0xffffffffu
#define DMA_CH14_AL2_CTRL_RESET "-"
#define DMA_CH14_AL2_CTRL_MSB 31u
#define DMA_CH14_AL2_CTRL_LSB 0u
#define DMA_CH14_AL2_CTRL_ACCESS "RW"
#define DMA_CH14_AL2_TRANS_COUNT_OFFSET 0x000003a4u
#define DMA_CH14_AL2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH14_AL2_TRANS_COUNT_RESET "-"
#define DMA_CH14_AL2_TRANS_COUNT_MSB 31u
#define DMA_CH14_AL2_TRANS_COUNT_LSB 0u
#define DMA_CH14_AL2_TRANS_COUNT_ACCESS "RW"
#define DMA_CH14_AL2_READ_ADDR_OFFSET 0x000003a8u
#define DMA_CH14_AL2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH14_AL2_READ_ADDR_RESET "-"
#define DMA_CH14_AL2_READ_ADDR_MSB 31u
#define DMA_CH14_AL2_READ_ADDR_LSB 0u
#define DMA_CH14_AL2_READ_ADDR_ACCESS "RW"
#define DMA_CH14_AL2_WRITE_ADDR_TRIG_OFFSET 0x000003acu
#define DMA_CH14_AL2_WRITE_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH14_AL2_WRITE_ADDR_TRIG_RESET "-"
#define DMA_CH14_AL2_WRITE_ADDR_TRIG_MSB 31u
#define DMA_CH14_AL2_WRITE_ADDR_TRIG_LSB 0u
#define DMA_CH14_AL2_WRITE_ADDR_TRIG_ACCESS "RW"
#define DMA_CH14_AL3_CTRL_OFFSET 0x000003b0u
#define DMA_CH14_AL3_CTRL_BITS 0xffffffffu
#define DMA_CH14_AL3_CTRL_RESET "-"
#define DMA_CH14_AL3_CTRL_MSB 31u
#define DMA_CH14_AL3_CTRL_LSB 0u
#define DMA_CH14_AL3_CTRL_ACCESS "RW"
#define DMA_CH14_AL3_WRITE_ADDR_OFFSET 0x000003b4u
#define DMA_CH14_AL3_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH14_AL3_WRITE_ADDR_RESET "-"
#define DMA_CH14_AL3_WRITE_ADDR_MSB 31u
#define DMA_CH14_AL3_WRITE_ADDR_LSB 0u
#define DMA_CH14_AL3_WRITE_ADDR_ACCESS "RW"
#define DMA_CH14_AL3_TRANS_COUNT_OFFSET 0x000003b8u
#define DMA_CH14_AL3_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH14_AL3_TRANS_COUNT_RESET "-"
#define DMA_CH14_AL3_TRANS_COUNT_MSB 31u
#define DMA_CH14_AL3_TRANS_COUNT_LSB 0u
#define DMA_CH14_AL3_TRANS_COUNT_ACCESS "RW"
#define DMA_CH14_AL3_READ_ADDR_TRIG_OFFSET 0x000003bcu
#define DMA_CH14_AL3_READ_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH14_AL3_READ_ADDR_TRIG_RESET "-"
#define DMA_CH14_AL3_READ_ADDR_TRIG_MSB 31u
#define DMA_CH14_AL3_READ_ADDR_TRIG_LSB 0u
#define DMA_CH14_AL3_READ_ADDR_TRIG_ACCESS "RW"
#define DMA_CH15_READ_ADDR_OFFSET 0x000003c0u
#define DMA_CH15_READ_ADDR_BITS 0xffffffffu
#define DMA_CH15_READ_ADDR_RESET 0x00000000u
#define DMA_CH15_READ_ADDR_MSB 31u
#define DMA_CH15_READ_ADDR_LSB 0u
#define DMA_CH15_READ_ADDR_ACCESS "RW"
#define DMA_CH15_WRITE_ADDR_OFFSET 0x000003c4u
#define DMA_CH15_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH15_WRITE_ADDR_RESET 0x00000000u
#define DMA_CH15_WRITE_ADDR_MSB 31u
#define DMA_CH15_WRITE_ADDR_LSB 0u
#define DMA_CH15_WRITE_ADDR_ACCESS "RW"
#define DMA_CH15_TRANS_COUNT_OFFSET 0x000003c8u
#define DMA_CH15_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH15_TRANS_COUNT_RESET 0x00000000u
#define DMA_CH15_TRANS_COUNT_MODE_RESET 0x0u
#define DMA_CH15_TRANS_COUNT_MODE_BITS 0xf0000000u
#define DMA_CH15_TRANS_COUNT_MODE_MSB 31u
#define DMA_CH15_TRANS_COUNT_MODE_LSB 28u
#define DMA_CH15_TRANS_COUNT_MODE_ACCESS "RW"
#define DMA_CH15_TRANS_COUNT_MODE_VALUE_NORMAL 0x0u
#define DMA_CH15_TRANS_COUNT_MODE_VALUE_TRIGGER_SELF 0x1u
#define DMA_CH15_TRANS_COUNT_MODE_VALUE_ENDLESS 0xfu
#define DMA_CH15_TRANS_COUNT_COUNT_RESET 0x0000000u
#define DMA_CH15_TRANS_COUNT_COUNT_BITS 0x0fffffffu
#define DMA_CH15_TRANS_COUNT_COUNT_MSB 27u
#define DMA_CH15_TRANS_COUNT_COUNT_LSB 0u
#define DMA_CH15_TRANS_COUNT_COUNT_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_OFFSET 0x000003ccu
#define DMA_CH15_CTRL_TRIG_BITS 0xe7ffffffu
#define DMA_CH15_CTRL_TRIG_RESET 0x00000000u
#define DMA_CH15_CTRL_TRIG_AHB_ERROR_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_AHB_ERROR_BITS 0x80000000u
#define DMA_CH15_CTRL_TRIG_AHB_ERROR_MSB 31u
#define DMA_CH15_CTRL_TRIG_AHB_ERROR_LSB 31u
#define DMA_CH15_CTRL_TRIG_AHB_ERROR_ACCESS "RO"
#define DMA_CH15_CTRL_TRIG_READ_ERROR_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_READ_ERROR_BITS 0x40000000u
#define DMA_CH15_CTRL_TRIG_READ_ERROR_MSB 30u
#define DMA_CH15_CTRL_TRIG_READ_ERROR_LSB 30u
#define DMA_CH15_CTRL_TRIG_READ_ERROR_ACCESS "WC"
#define DMA_CH15_CTRL_TRIG_WRITE_ERROR_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_WRITE_ERROR_BITS 0x20000000u
#define DMA_CH15_CTRL_TRIG_WRITE_ERROR_MSB 29u
#define DMA_CH15_CTRL_TRIG_WRITE_ERROR_LSB 29u
#define DMA_CH15_CTRL_TRIG_WRITE_ERROR_ACCESS "WC"
#define DMA_CH15_CTRL_TRIG_BUSY_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_BUSY_BITS 0x04000000u
#define DMA_CH15_CTRL_TRIG_BUSY_MSB 26u
#define DMA_CH15_CTRL_TRIG_BUSY_LSB 26u
#define DMA_CH15_CTRL_TRIG_BUSY_ACCESS "RO"
#define DMA_CH15_CTRL_TRIG_SNIFF_EN_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_SNIFF_EN_BITS 0x02000000u
#define DMA_CH15_CTRL_TRIG_SNIFF_EN_MSB 25u
#define DMA_CH15_CTRL_TRIG_SNIFF_EN_LSB 25u
#define DMA_CH15_CTRL_TRIG_SNIFF_EN_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_BSWAP_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_BSWAP_BITS 0x01000000u
#define DMA_CH15_CTRL_TRIG_BSWAP_MSB 24u
#define DMA_CH15_CTRL_TRIG_BSWAP_LSB 24u
#define DMA_CH15_CTRL_TRIG_BSWAP_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_IRQ_QUIET_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_IRQ_QUIET_BITS 0x00800000u
#define DMA_CH15_CTRL_TRIG_IRQ_QUIET_MSB 23u
#define DMA_CH15_CTRL_TRIG_IRQ_QUIET_LSB 23u
#define DMA_CH15_CTRL_TRIG_IRQ_QUIET_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_RESET 0x00u
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_BITS 0x007e0000u
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_MSB 22u
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_LSB 17u
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_VALUE_TIMER0 0x3bu
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_VALUE_TIMER1 0x3cu
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_VALUE_TIMER2 0x3du
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_VALUE_TIMER3 0x3eu
#define DMA_CH15_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT 0x3fu
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_BITS 0x0001e000u
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_MSB 16u
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_LSB 13u
#define DMA_CH15_CTRL_TRIG_CHAIN_TO_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_RING_SEL_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_RING_SEL_BITS 0x00001000u
#define DMA_CH15_CTRL_TRIG_RING_SEL_MSB 12u
#define DMA_CH15_CTRL_TRIG_RING_SEL_LSB 12u
#define DMA_CH15_CTRL_TRIG_RING_SEL_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_RING_SIZE_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_RING_SIZE_BITS 0x00000f00u
#define DMA_CH15_CTRL_TRIG_RING_SIZE_MSB 11u
#define DMA_CH15_CTRL_TRIG_RING_SIZE_LSB 8u
#define DMA_CH15_CTRL_TRIG_RING_SIZE_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE 0x0u
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_BITS 0x00000080u
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_MSB 7u
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_LSB 7u
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_REV_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_BITS 0x00000040u
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_MSB 6u
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_LSB 6u
#define DMA_CH15_CTRL_TRIG_INCR_WRITE_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_BITS 0x00000020u
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_MSB 5u
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_LSB 5u
#define DMA_CH15_CTRL_TRIG_INCR_READ_REV_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_INCR_READ_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_INCR_READ_BITS 0x00000010u
#define DMA_CH15_CTRL_TRIG_INCR_READ_MSB 4u
#define DMA_CH15_CTRL_TRIG_INCR_READ_LSB 4u
#define DMA_CH15_CTRL_TRIG_INCR_READ_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_BITS 0x0000000cu
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_MSB 3u
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_LSB 2u
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE 0x0u
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD 0x1u
#define DMA_CH15_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD 0x2u
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_BITS 0x00000002u
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_MSB 1u
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_LSB 1u
#define DMA_CH15_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
#define DMA_CH15_CTRL_TRIG_EN_RESET 0x0u
#define DMA_CH15_CTRL_TRIG_EN_BITS 0x00000001u
#define DMA_CH15_CTRL_TRIG_EN_MSB 0u
#define DMA_CH15_CTRL_TRIG_EN_LSB 0u
#define DMA_CH15_CTRL_TRIG_EN_ACCESS "RW"
#define DMA_CH15_AL1_CTRL_OFFSET 0x000003d0u
#define DMA_CH15_AL1_CTRL_BITS 0xffffffffu
#define DMA_CH15_AL1_CTRL_RESET "-"
#define DMA_CH15_AL1_CTRL_MSB 31u
#define DMA_CH15_AL1_CTRL_LSB 0u
#define DMA_CH15_AL1_CTRL_ACCESS "RW"
#define DMA_CH15_AL1_READ_ADDR_OFFSET 0x000003d4u
#define DMA_CH15_AL1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH15_AL1_READ_ADDR_RESET "-"
#define DMA_CH15_AL1_READ_ADDR_MSB 31u
#define DMA_CH15_AL1_READ_ADDR_LSB 0u
#define DMA_CH15_AL1_READ_ADDR_ACCESS "RW"
#define DMA_CH15_AL1_WRITE_ADDR_OFFSET 0x000003d8u
#define DMA_CH15_AL1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH15_AL1_WRITE_ADDR_RESET "-"
#define DMA_CH15_AL1_WRITE_ADDR_MSB 31u
#define DMA_CH15_AL1_WRITE_ADDR_LSB 0u
#define DMA_CH15_AL1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_OFFSET 0x000003dcu
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_BITS 0xffffffffu
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_RESET "-"
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_MSB 31u
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_LSB 0u
#define DMA_CH15_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
#define DMA_CH15_AL2_CTRL_OFFSET 0x000003e0u
#define DMA_CH15_AL2_CTRL_BITS 0xffffffffu
#define DMA_CH15_AL2_CTRL_RESET "-"
#define DMA_CH15_AL2_CTRL_MSB 31u
#define DMA_CH15_AL2_CTRL_LSB 0u
#define DMA_CH15_AL2_CTRL_ACCESS "RW"
#define DMA_CH15_AL2_TRANS_COUNT_OFFSET 0x000003e4u
#define DMA_CH15_AL2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH15_AL2_TRANS_COUNT_RESET "-"
#define DMA_CH15_AL2_TRANS_COUNT_MSB 31u
#define DMA_CH15_AL2_TRANS_COUNT_LSB 0u
#define DMA_CH15_AL2_TRANS_COUNT_ACCESS "RW"
#define DMA_CH15_AL2_READ_ADDR_OFFSET 0x000003e8u
#define DMA_CH15_AL2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH15_AL2_READ_ADDR_RESET "-"
#define DMA_CH15_AL2_READ_ADDR_MSB 31u
#define DMA_CH15_AL2_READ_ADDR_LSB 0u
#define DMA_CH15_AL2_READ_ADDR_ACCESS "RW"
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_OFFSET 0x000003ecu
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_RESET "-"
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_MSB 31u
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_LSB 0u
#define DMA_CH15_AL2_WRITE_ADDR_TRIG_ACCESS "RW"
#define DMA_CH15_AL3_CTRL_OFFSET 0x000003f0u
#define DMA_CH15_AL3_CTRL_BITS 0xffffffffu
#define DMA_CH15_AL3_CTRL_RESET "-"
#define DMA_CH15_AL3_CTRL_MSB 31u
#define DMA_CH15_AL3_CTRL_LSB 0u
#define DMA_CH15_AL3_CTRL_ACCESS "RW"
#define DMA_CH15_AL3_WRITE_ADDR_OFFSET 0x000003f4u
#define DMA_CH15_AL3_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH15_AL3_WRITE_ADDR_RESET "-"
#define DMA_CH15_AL3_WRITE_ADDR_MSB 31u
#define DMA_CH15_AL3_WRITE_ADDR_LSB 0u
#define DMA_CH15_AL3_WRITE_ADDR_ACCESS "RW"
#define DMA_CH15_AL3_TRANS_COUNT_OFFSET 0x000003f8u
#define DMA_CH15_AL3_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH15_AL3_TRANS_COUNT_RESET "-"
#define DMA_CH15_AL3_TRANS_COUNT_MSB 31u
#define DMA_CH15_AL3_TRANS_COUNT_LSB 0u
#define DMA_CH15_AL3_TRANS_COUNT_ACCESS "RW"
#define DMA_CH15_AL3_READ_ADDR_TRIG_OFFSET 0x000003fcu
#define DMA_CH15_AL3_READ_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH15_AL3_READ_ADDR_TRIG_RESET "-"
#define DMA_CH15_AL3_READ_ADDR_TRIG_MSB 31u
#define DMA_CH15_AL3_READ_ADDR_TRIG_LSB 0u
#define DMA_CH15_AL3_READ_ADDR_TRIG_ACCESS "RW"
#define DMA_INTR_OFFSET 0x00000400u
#define DMA_INTR_BITS 0x0000ffffu
#define DMA_INTR_RESET 0x00000000u
#define DMA_INTR_MSB 15u
#define DMA_INTR_LSB 0u
#define DMA_INTR_ACCESS "WC"
#define DMA_INTE0_OFFSET 0x00000404u
#define DMA_INTE0_BITS 0x0000ffffu
#define DMA_INTE0_RESET 0x00000000u
#define DMA_INTE0_MSB 15u
#define DMA_INTE0_LSB 0u
#define DMA_INTE0_ACCESS "RW"
#define DMA_INTF0_OFFSET 0x00000408u
#define DMA_INTF0_BITS 0x0000ffffu
#define DMA_INTF0_RESET 0x00000000u
#define DMA_INTF0_MSB 15u
#define DMA_INTF0_LSB 0u
#define DMA_INTF0_ACCESS "RW"
#define DMA_INTS0_OFFSET 0x0000040cu
#define DMA_INTS0_BITS 0x0000ffffu
#define DMA_INTS0_RESET 0x00000000u
#define DMA_INTS0_MSB 15u
#define DMA_INTS0_LSB 0u
#define DMA_INTS0_ACCESS "WC"
#define DMA_INTE1_OFFSET 0x00000414u
#define DMA_INTE1_BITS 0x0000ffffu
#define DMA_INTE1_RESET 0x00000000u
#define DMA_INTE1_MSB 15u
#define DMA_INTE1_LSB 0u
#define DMA_INTE1_ACCESS "RW"
#define DMA_INTF1_OFFSET 0x00000418u
#define DMA_INTF1_BITS 0x0000ffffu
#define DMA_INTF1_RESET 0x00000000u
#define DMA_INTF1_MSB 15u
#define DMA_INTF1_LSB 0u
#define DMA_INTF1_ACCESS "RW"
#define DMA_INTS1_OFFSET 0x0000041cu
#define DMA_INTS1_BITS 0x0000ffffu
#define DMA_INTS1_RESET 0x00000000u
#define DMA_INTS1_MSB 15u
#define DMA_INTS1_LSB 0u
#define DMA_INTS1_ACCESS "WC"
#define DMA_INTE2_OFFSET 0x00000424u
#define DMA_INTE2_BITS 0x0000ffffu
#define DMA_INTE2_RESET 0x00000000u
#define DMA_INTE2_MSB 15u
#define DMA_INTE2_LSB 0u
#define DMA_INTE2_ACCESS "RW"
#define DMA_INTF2_OFFSET 0x00000428u
#define DMA_INTF2_BITS 0x0000ffffu
#define DMA_INTF2_RESET 0x00000000u
#define DMA_INTF2_MSB 15u
#define DMA_INTF2_LSB 0u
#define DMA_INTF2_ACCESS "RW"
#define DMA_INTS2_OFFSET 0x0000042cu
#define DMA_INTS2_BITS 0x0000ffffu
#define DMA_INTS2_RESET 0x00000000u
#define DMA_INTS2_MSB 15u
#define DMA_INTS2_LSB 0u
#define DMA_INTS2_ACCESS "WC"
#define DMA_INTE3_OFFSET 0x00000434u
#define DMA_INTE3_BITS 0x0000ffffu
#define DMA_INTE3_RESET 0x00000000u
#define DMA_INTE3_MSB 15u
#define DMA_INTE3_LSB 0u
#define DMA_INTE3_ACCESS "RW"
#define DMA_INTF3_OFFSET 0x00000438u
#define DMA_INTF3_BITS 0x0000ffffu
#define DMA_INTF3_RESET 0x00000000u
#define DMA_INTF3_MSB 15u
#define DMA_INTF3_LSB 0u
#define DMA_INTF3_ACCESS "RW"
#define DMA_INTS3_OFFSET 0x0000043cu
#define DMA_INTS3_BITS 0x0000ffffu
#define DMA_INTS3_RESET 0x00000000u
#define DMA_INTS3_MSB 15u
#define DMA_INTS3_LSB 0u
#define DMA_INTS3_ACCESS "WC"
#define DMA_TIMER0_OFFSET 0x00000440u
#define DMA_TIMER0_BITS 0xffffffffu
#define DMA_TIMER0_RESET 0x00000000u
#define DMA_TIMER0_X_RESET 0x0000u
#define DMA_TIMER0_X_BITS 0xffff0000u
#define DMA_TIMER0_X_MSB 31u
#define DMA_TIMER0_X_LSB 16u
#define DMA_TIMER0_X_ACCESS "RW"
#define DMA_TIMER0_Y_RESET 0x0000u
#define DMA_TIMER0_Y_BITS 0x0000ffffu
#define DMA_TIMER0_Y_MSB 15u
#define DMA_TIMER0_Y_LSB 0u
#define DMA_TIMER0_Y_ACCESS "RW"
#define DMA_TIMER1_OFFSET 0x00000444u
#define DMA_TIMER1_BITS 0xffffffffu
#define DMA_TIMER1_RESET 0x00000000u
#define DMA_TIMER1_X_RESET 0x0000u
#define DMA_TIMER1_X_BITS 0xffff0000u
#define DMA_TIMER1_X_MSB 31u
#define DMA_TIMER1_X_LSB 16u
#define DMA_TIMER1_X_ACCESS "RW"
#define DMA_TIMER1_Y_RESET 0x0000u
#define DMA_TIMER1_Y_BITS 0x0000ffffu
#define DMA_TIMER1_Y_MSB 15u
#define DMA_TIMER1_Y_LSB 0u
#define DMA_TIMER1_Y_ACCESS "RW"
#define DMA_TIMER2_OFFSET 0x00000448u
#define DMA_TIMER2_BITS 0xffffffffu
#define DMA_TIMER2_RESET 0x00000000u
#define DMA_TIMER2_X_RESET 0x0000u
#define DMA_TIMER2_X_BITS 0xffff0000u
#define DMA_TIMER2_X_MSB 31u
#define DMA_TIMER2_X_LSB 16u
#define DMA_TIMER2_X_ACCESS "RW"
#define DMA_TIMER2_Y_RESET 0x0000u
#define DMA_TIMER2_Y_BITS 0x0000ffffu
#define DMA_TIMER2_Y_MSB 15u
#define DMA_TIMER2_Y_LSB 0u
#define DMA_TIMER2_Y_ACCESS "RW"
#define DMA_TIMER3_OFFSET 0x0000044cu
#define DMA_TIMER3_BITS 0xffffffffu
#define DMA_TIMER3_RESET 0x00000000u
#define DMA_TIMER3_X_RESET 0x0000u
#define DMA_TIMER3_X_BITS 0xffff0000u
#define DMA_TIMER3_X_MSB 31u
#define DMA_TIMER3_X_LSB 16u
#define DMA_TIMER3_X_ACCESS "RW"
#define DMA_TIMER3_Y_RESET 0x0000u
#define DMA_TIMER3_Y_BITS 0x0000ffffu
#define DMA_TIMER3_Y_MSB 15u
#define DMA_TIMER3_Y_LSB 0u
#define DMA_TIMER3_Y_ACCESS "RW"
#define DMA_MULTI_CHAN_TRIGGER_OFFSET 0x00000450u
#define DMA_MULTI_CHAN_TRIGGER_BITS 0x0000ffffu
#define DMA_MULTI_CHAN_TRIGGER_RESET 0x00000000u
#define DMA_MULTI_CHAN_TRIGGER_MSB 15u
#define DMA_MULTI_CHAN_TRIGGER_LSB 0u
#define DMA_MULTI_CHAN_TRIGGER_ACCESS "SC"
#define DMA_SNIFF_CTRL_OFFSET 0x00000454u
#define DMA_SNIFF_CTRL_BITS 0x00000fffu
#define DMA_SNIFF_CTRL_RESET 0x00000000u
#define DMA_SNIFF_CTRL_OUT_INV_RESET 0x0u
#define DMA_SNIFF_CTRL_OUT_INV_BITS 0x00000800u
#define DMA_SNIFF_CTRL_OUT_INV_MSB 11u
#define DMA_SNIFF_CTRL_OUT_INV_LSB 11u
#define DMA_SNIFF_CTRL_OUT_INV_ACCESS "RW"
#define DMA_SNIFF_CTRL_OUT_REV_RESET 0x0u
#define DMA_SNIFF_CTRL_OUT_REV_BITS 0x00000400u
#define DMA_SNIFF_CTRL_OUT_REV_MSB 10u
#define DMA_SNIFF_CTRL_OUT_REV_LSB 10u
#define DMA_SNIFF_CTRL_OUT_REV_ACCESS "RW"
#define DMA_SNIFF_CTRL_BSWAP_RESET 0x0u
#define DMA_SNIFF_CTRL_BSWAP_BITS 0x00000200u
#define DMA_SNIFF_CTRL_BSWAP_MSB 9u
#define DMA_SNIFF_CTRL_BSWAP_LSB 9u
#define DMA_SNIFF_CTRL_BSWAP_ACCESS "RW"
#define DMA_SNIFF_CTRL_CALC_RESET 0x0u
#define DMA_SNIFF_CTRL_CALC_BITS 0x000001e0u
#define DMA_SNIFF_CTRL_CALC_MSB 8u
#define DMA_SNIFF_CTRL_CALC_LSB 5u
#define DMA_SNIFF_CTRL_CALC_ACCESS "RW"
#define DMA_SNIFF_CTRL_CALC_VALUE_CRC32 0x0u
#define DMA_SNIFF_CTRL_CALC_VALUE_CRC32R 0x1u
#define DMA_SNIFF_CTRL_CALC_VALUE_CRC16 0x2u
#define DMA_SNIFF_CTRL_CALC_VALUE_CRC16R 0x3u
#define DMA_SNIFF_CTRL_CALC_VALUE_EVEN 0xeu
#define DMA_SNIFF_CTRL_CALC_VALUE_SUM 0xfu
#define DMA_SNIFF_CTRL_DMACH_RESET 0x0u
#define DMA_SNIFF_CTRL_DMACH_BITS 0x0000001eu
#define DMA_SNIFF_CTRL_DMACH_MSB 4u
#define DMA_SNIFF_CTRL_DMACH_LSB 1u
#define DMA_SNIFF_CTRL_DMACH_ACCESS "RW"
#define DMA_SNIFF_CTRL_EN_RESET 0x0u
#define DMA_SNIFF_CTRL_EN_BITS 0x00000001u
#define DMA_SNIFF_CTRL_EN_MSB 0u
#define DMA_SNIFF_CTRL_EN_LSB 0u
#define DMA_SNIFF_CTRL_EN_ACCESS "RW"
#define DMA_SNIFF_DATA_OFFSET 0x00000458u
#define DMA_SNIFF_DATA_BITS 0xffffffffu
#define DMA_SNIFF_DATA_RESET 0x00000000u
#define DMA_SNIFF_DATA_MSB 31u
#define DMA_SNIFF_DATA_LSB 0u
#define DMA_SNIFF_DATA_ACCESS "RW"
#define DMA_FIFO_LEVELS_OFFSET 0x00000460u
#define DMA_FIFO_LEVELS_BITS 0x00ffffffu
#define DMA_FIFO_LEVELS_RESET 0x00000000u
#define DMA_FIFO_LEVELS_RAF_LVL_RESET 0x00u
#define DMA_FIFO_LEVELS_RAF_LVL_BITS 0x00ff0000u
#define DMA_FIFO_LEVELS_RAF_LVL_MSB 23u
#define DMA_FIFO_LEVELS_RAF_LVL_LSB 16u
#define DMA_FIFO_LEVELS_RAF_LVL_ACCESS "RO"
#define DMA_FIFO_LEVELS_WAF_LVL_RESET 0x00u
#define DMA_FIFO_LEVELS_WAF_LVL_BITS 0x0000ff00u
#define DMA_FIFO_LEVELS_WAF_LVL_MSB 15u
#define DMA_FIFO_LEVELS_WAF_LVL_LSB 8u
#define DMA_FIFO_LEVELS_WAF_LVL_ACCESS "RO"
#define DMA_FIFO_LEVELS_TDF_LVL_RESET 0x00u
#define DMA_FIFO_LEVELS_TDF_LVL_BITS 0x000000ffu
#define DMA_FIFO_LEVELS_TDF_LVL_MSB 7u
#define DMA_FIFO_LEVELS_TDF_LVL_LSB 0u
#define DMA_FIFO_LEVELS_TDF_LVL_ACCESS "RO"
#define DMA_CHAN_ABORT_OFFSET 0x00000464u
#define DMA_CHAN_ABORT_BITS 0x0000ffffu
#define DMA_CHAN_ABORT_RESET 0x00000000u
#define DMA_CHAN_ABORT_MSB 15u
#define DMA_CHAN_ABORT_LSB 0u
#define DMA_CHAN_ABORT_ACCESS "SC"
#define DMA_N_CHANNELS_OFFSET 0x00000468u
#define DMA_N_CHANNELS_BITS 0x0000001fu
#define DMA_N_CHANNELS_RESET "-"
#define DMA_N_CHANNELS_MSB 4u
#define DMA_N_CHANNELS_LSB 0u
#define DMA_N_CHANNELS_ACCESS "RO"
#define DMA_SECCFG_CH0_OFFSET 0x00000480u
#define DMA_SECCFG_CH0_BITS 0x00000007u
#define DMA_SECCFG_CH0_RESET 0x00000003u
#define DMA_SECCFG_CH0_LOCK_RESET 0x0u
#define DMA_SECCFG_CH0_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH0_LOCK_MSB 2u
#define DMA_SECCFG_CH0_LOCK_LSB 2u
#define DMA_SECCFG_CH0_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH0_S_RESET 0x1u
#define DMA_SECCFG_CH0_S_BITS 0x00000002u
#define DMA_SECCFG_CH0_S_MSB 1u
#define DMA_SECCFG_CH0_S_LSB 1u
#define DMA_SECCFG_CH0_S_ACCESS "RW"
#define DMA_SECCFG_CH0_P_RESET 0x1u
#define DMA_SECCFG_CH0_P_BITS 0x00000001u
#define DMA_SECCFG_CH0_P_MSB 0u
#define DMA_SECCFG_CH0_P_LSB 0u
#define DMA_SECCFG_CH0_P_ACCESS "RW"
#define DMA_SECCFG_CH1_OFFSET 0x00000484u
#define DMA_SECCFG_CH1_BITS 0x00000007u
#define DMA_SECCFG_CH1_RESET 0x00000003u
#define DMA_SECCFG_CH1_LOCK_RESET 0x0u
#define DMA_SECCFG_CH1_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH1_LOCK_MSB 2u
#define DMA_SECCFG_CH1_LOCK_LSB 2u
#define DMA_SECCFG_CH1_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH1_S_RESET 0x1u
#define DMA_SECCFG_CH1_S_BITS 0x00000002u
#define DMA_SECCFG_CH1_S_MSB 1u
#define DMA_SECCFG_CH1_S_LSB 1u
#define DMA_SECCFG_CH1_S_ACCESS "RW"
#define DMA_SECCFG_CH1_P_RESET 0x1u
#define DMA_SECCFG_CH1_P_BITS 0x00000001u
#define DMA_SECCFG_CH1_P_MSB 0u
#define DMA_SECCFG_CH1_P_LSB 0u
#define DMA_SECCFG_CH1_P_ACCESS "RW"
#define DMA_SECCFG_CH2_OFFSET 0x00000488u
#define DMA_SECCFG_CH2_BITS 0x00000007u
#define DMA_SECCFG_CH2_RESET 0x00000003u
#define DMA_SECCFG_CH2_LOCK_RESET 0x0u
#define DMA_SECCFG_CH2_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH2_LOCK_MSB 2u
#define DMA_SECCFG_CH2_LOCK_LSB 2u
#define DMA_SECCFG_CH2_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH2_S_RESET 0x1u
#define DMA_SECCFG_CH2_S_BITS 0x00000002u
#define DMA_SECCFG_CH2_S_MSB 1u
#define DMA_SECCFG_CH2_S_LSB 1u
#define DMA_SECCFG_CH2_S_ACCESS "RW"
#define DMA_SECCFG_CH2_P_RESET 0x1u
#define DMA_SECCFG_CH2_P_BITS 0x00000001u
#define DMA_SECCFG_CH2_P_MSB 0u
#define DMA_SECCFG_CH2_P_LSB 0u
#define DMA_SECCFG_CH2_P_ACCESS "RW"
#define DMA_SECCFG_CH3_OFFSET 0x0000048cu
#define DMA_SECCFG_CH3_BITS 0x00000007u
#define DMA_SECCFG_CH3_RESET 0x00000003u
#define DMA_SECCFG_CH3_LOCK_RESET 0x0u
#define DMA_SECCFG_CH3_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH3_LOCK_MSB 2u
#define DMA_SECCFG_CH3_LOCK_LSB 2u
#define DMA_SECCFG_CH3_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH3_S_RESET 0x1u
#define DMA_SECCFG_CH3_S_BITS 0x00000002u
#define DMA_SECCFG_CH3_S_MSB 1u
#define DMA_SECCFG_CH3_S_LSB 1u
#define DMA_SECCFG_CH3_S_ACCESS "RW"
#define DMA_SECCFG_CH3_P_RESET 0x1u
#define DMA_SECCFG_CH3_P_BITS 0x00000001u
#define DMA_SECCFG_CH3_P_MSB 0u
#define DMA_SECCFG_CH3_P_LSB 0u
#define DMA_SECCFG_CH3_P_ACCESS "RW"
#define DMA_SECCFG_CH4_OFFSET 0x00000490u
#define DMA_SECCFG_CH4_BITS 0x00000007u
#define DMA_SECCFG_CH4_RESET 0x00000003u
#define DMA_SECCFG_CH4_LOCK_RESET 0x0u
#define DMA_SECCFG_CH4_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH4_LOCK_MSB 2u
#define DMA_SECCFG_CH4_LOCK_LSB 2u
#define DMA_SECCFG_CH4_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH4_S_RESET 0x1u
#define DMA_SECCFG_CH4_S_BITS 0x00000002u
#define DMA_SECCFG_CH4_S_MSB 1u
#define DMA_SECCFG_CH4_S_LSB 1u
#define DMA_SECCFG_CH4_S_ACCESS "RW"
#define DMA_SECCFG_CH4_P_RESET 0x1u
#define DMA_SECCFG_CH4_P_BITS 0x00000001u
#define DMA_SECCFG_CH4_P_MSB 0u
#define DMA_SECCFG_CH4_P_LSB 0u
#define DMA_SECCFG_CH4_P_ACCESS "RW"
#define DMA_SECCFG_CH5_OFFSET 0x00000494u
#define DMA_SECCFG_CH5_BITS 0x00000007u
