gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define PICO_LOWEST_EXCEPTION_PRIORITY 0xff
#define PICO_HIGHEST_EXCEPTION_PRIORITY 0x00
typedef void (*exception_handler_t)(void);
exception_handler_t exception_set_exclusive_handler(enum exception_number num, exception_handler_t handler);
void exception_restore_handler(enum exception_number num, exception_handler_t original_handler);
exception_handler_t exception_get_vtable_handler(enum exception_number num);
_Bool exception_set_priority(uint num, uint8_t hardware_priority);
uint exception_get_priority(uint num);
#define _HARDWARE_FLASH_H 
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_FLASH 0
#define FLASH_PAGE_SIZE (1u << 8)
#define FLASH_SECTOR_SIZE (1u << 12)
#define FLASH_BLOCK_SIZE (1u << 16)
#define FLASH_UNIQUE_ID_SIZE_BYTES 8
void flash_start_xip(void);
void flash_range_erase(uint32_t flash_offs, size_t count);
void flash_range_program(uint32_t flash_offs, const uint8_t *data, size_t count);
void flash_get_unique_id(uint8_t *id_out);
void flash_do_cmd(const uint8_t *txbuf, uint8_t *rxbuf, size_t count);
void flash_flush_cache(void);
typedef enum {
    FLASH_DEVINFO_SIZE_NONE = 0x0,
    FLASH_DEVINFO_SIZE_8K = 0x1,
    FLASH_DEVINFO_SIZE_16K = 0x2,
    FLASH_DEVINFO_SIZE_32K = 0x3,
    FLASH_DEVINFO_SIZE_64K = 0x4,
    FLASH_DEVINFO_SIZE_128K = 0x5,
    FLASH_DEVINFO_SIZE_256K = 0x6,
    FLASH_DEVINFO_SIZE_512K = 0x7,
    FLASH_DEVINFO_SIZE_1M = 0x8,
    FLASH_DEVINFO_SIZE_2M = 0x9,
    FLASH_DEVINFO_SIZE_4M = 0xa,
    FLASH_DEVINFO_SIZE_8M = 0xb,
    FLASH_DEVINFO_SIZE_16M = 0xc,
    FLASH_DEVINFO_SIZE_MAX = 0xc
} flash_devinfo_size_t;
static inline uint32_t flash_devinfo_size_to_bytes(flash_devinfo_size_t size) {
    if (size == FLASH_DEVINFO_SIZE_NONE) {
        return 0;
    } else {
        return 4096u << (uint)size;
    }
}
static inline flash_devinfo_size_t flash_devinfo_bytes_to_size(uint32_t bytes) {
    ({if (((0 || 0) && !0)) (((bytes & (bytes - 1)) == 0u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_flash/include/hardware/flash.h", 185, __func__, "(bytes & (bytes - 1)) == 0u"));});
    uint sectors = bytes / 4096u;
    if (sectors <= 1u) {
        return FLASH_DEVINFO_SIZE_NONE;
    } else {
        return (flash_devinfo_size_t) __builtin_ctz(sectors);
    }
}
flash_devinfo_size_t flash_devinfo_get_cs_size(uint cs);
void flash_devinfo_set_cs_size(uint cs, flash_devinfo_size_t size);
_Bool flash_devinfo_get_d8h_erase_supported(void);
void flash_devinfo_set_d8h_erase_supported(_Bool supported);
uint flash_devinfo_get_cs_gpio(uint cs);
void flash_devinfo_set_cs_gpio(uint cs, uint gpio);
#define _HARDWARE_I2C_H 
#define _HARDWARE_STRUCTS_I2C_H 
#define _HARDWARE_REGS_I2C_H 
#define I2C_IC_CON_OFFSET 0x00000000u
#define I2C_IC_CON_BITS 0x000007ffu
#define I2C_IC_CON_RESET 0x00000065u
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_RESET 0x0u
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_BITS 0x00000400u
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_MSB 10u
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_LSB 10u
#define I2C_IC_CON_STOP_DET_IF_MASTER_ACTIVE_ACCESS "RO"
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_RESET 0x0u
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_BITS 0x00000200u
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_MSB 9u
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_LSB 9u
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_ACCESS "RW"
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_VALUE_DISABLED 0x0u
#define I2C_IC_CON_RX_FIFO_FULL_HLD_CTRL_VALUE_ENABLED 0x1u
#define I2C_IC_CON_TX_EMPTY_CTRL_RESET 0x0u
#define I2C_IC_CON_TX_EMPTY_CTRL_BITS 0x00000100u
#define I2C_IC_CON_TX_EMPTY_CTRL_MSB 8u
#define I2C_IC_CON_TX_EMPTY_CTRL_LSB 8u
#define I2C_IC_CON_TX_EMPTY_CTRL_ACCESS "RW"
#define I2C_IC_CON_TX_EMPTY_CTRL_VALUE_DISABLED 0x0u
#define I2C_IC_CON_TX_EMPTY_CTRL_VALUE_ENABLED 0x1u
#define I2C_IC_CON_STOP_DET_IFADDRESSED_RESET 0x0u
#define I2C_IC_CON_STOP_DET_IFADDRESSED_BITS 0x00000080u
#define I2C_IC_CON_STOP_DET_IFADDRESSED_MSB 7u
#define I2C_IC_CON_STOP_DET_IFADDRESSED_LSB 7u
#define I2C_IC_CON_STOP_DET_IFADDRESSED_ACCESS "RW"
#define I2C_IC_CON_STOP_DET_IFADDRESSED_VALUE_DISABLED 0x0u
#define I2C_IC_CON_STOP_DET_IFADDRESSED_VALUE_ENABLED 0x1u
#define I2C_IC_CON_IC_SLAVE_DISABLE_RESET 0x1u
#define I2C_IC_CON_IC_SLAVE_DISABLE_BITS 0x00000040u
#define I2C_IC_CON_IC_SLAVE_DISABLE_MSB 6u
#define I2C_IC_CON_IC_SLAVE_DISABLE_LSB 6u
#define I2C_IC_CON_IC_SLAVE_DISABLE_ACCESS "RW"
#define I2C_IC_CON_IC_SLAVE_DISABLE_VALUE_SLAVE_ENABLED 0x0u
#define I2C_IC_CON_IC_SLAVE_DISABLE_VALUE_SLAVE_DISABLED 0x1u
#define I2C_IC_CON_IC_RESTART_EN_RESET 0x1u
#define I2C_IC_CON_IC_RESTART_EN_BITS 0x00000020u
#define I2C_IC_CON_IC_RESTART_EN_MSB 5u
#define I2C_IC_CON_IC_RESTART_EN_LSB 5u
#define I2C_IC_CON_IC_RESTART_EN_ACCESS "RW"
#define I2C_IC_CON_IC_RESTART_EN_VALUE_DISABLED 0x0u
#define I2C_IC_CON_IC_RESTART_EN_VALUE_ENABLED 0x1u
#define I2C_IC_CON_IC_10BITADDR_MASTER_RESET 0x0u
#define I2C_IC_CON_IC_10BITADDR_MASTER_BITS 0x00000010u
#define I2C_IC_CON_IC_10BITADDR_MASTER_MSB 4u
#define I2C_IC_CON_IC_10BITADDR_MASTER_LSB 4u
#define I2C_IC_CON_IC_10BITADDR_MASTER_ACCESS "RW"
#define I2C_IC_CON_IC_10BITADDR_MASTER_VALUE_ADDR_7BITS 0x0u
#define I2C_IC_CON_IC_10BITADDR_MASTER_VALUE_ADDR_10BITS 0x1u
#define I2C_IC_CON_IC_10BITADDR_SLAVE_RESET 0x0u
#define I2C_IC_CON_IC_10BITADDR_SLAVE_BITS 0x00000008u
#define I2C_IC_CON_IC_10BITADDR_SLAVE_MSB 3u
#define I2C_IC_CON_IC_10BITADDR_SLAVE_LSB 3u
#define I2C_IC_CON_IC_10BITADDR_SLAVE_ACCESS "RW"
#define I2C_IC_CON_IC_10BITADDR_SLAVE_VALUE_ADDR_7BITS 0x0u
#define I2C_IC_CON_IC_10BITADDR_SLAVE_VALUE_ADDR_10BITS 0x1u
#define I2C_IC_CON_SPEED_RESET 0x2u
#define I2C_IC_CON_SPEED_BITS 0x00000006u
#define I2C_IC_CON_SPEED_MSB 2u
#define I2C_IC_CON_SPEED_LSB 1u
#define I2C_IC_CON_SPEED_ACCESS "RW"
#define I2C_IC_CON_SPEED_VALUE_STANDARD 0x1u
#define I2C_IC_CON_SPEED_VALUE_FAST 0x2u
#define I2C_IC_CON_SPEED_VALUE_HIGH 0x3u
#define I2C_IC_CON_MASTER_MODE_RESET 0x1u
#define I2C_IC_CON_MASTER_MODE_BITS 0x00000001u
#define I2C_IC_CON_MASTER_MODE_MSB 0u
#define I2C_IC_CON_MASTER_MODE_LSB 0u
#define I2C_IC_CON_MASTER_MODE_ACCESS "RW"
#define I2C_IC_CON_MASTER_MODE_VALUE_DISABLED 0x0u
#define I2C_IC_CON_MASTER_MODE_VALUE_ENABLED 0x1u
#define I2C_IC_TAR_OFFSET 0x00000004u
#define I2C_IC_TAR_BITS 0x00000fffu
#define I2C_IC_TAR_RESET 0x00000055u
#define I2C_IC_TAR_SPECIAL_RESET 0x0u
#define I2C_IC_TAR_SPECIAL_BITS 0x00000800u
#define I2C_IC_TAR_SPECIAL_MSB 11u
#define I2C_IC_TAR_SPECIAL_LSB 11u
#define I2C_IC_TAR_SPECIAL_ACCESS "RW"
#define I2C_IC_TAR_SPECIAL_VALUE_DISABLED 0x0u
#define I2C_IC_TAR_SPECIAL_VALUE_ENABLED 0x1u
#define I2C_IC_TAR_GC_OR_START_RESET 0x0u
#define I2C_IC_TAR_GC_OR_START_BITS 0x00000400u
#define I2C_IC_TAR_GC_OR_START_MSB 10u
#define I2C_IC_TAR_GC_OR_START_LSB 10u
#define I2C_IC_TAR_GC_OR_START_ACCESS "RW"
#define I2C_IC_TAR_GC_OR_START_VALUE_GENERAL_CALL 0x0u
#define I2C_IC_TAR_GC_OR_START_VALUE_START_BYTE 0x1u
#define I2C_IC_TAR_IC_TAR_RESET 0x055u
#define I2C_IC_TAR_IC_TAR_BITS 0x000003ffu
#define I2C_IC_TAR_IC_TAR_MSB 9u
#define I2C_IC_TAR_IC_TAR_LSB 0u
#define I2C_IC_TAR_IC_TAR_ACCESS "RW"
#define I2C_IC_SAR_OFFSET 0x00000008u
#define I2C_IC_SAR_BITS 0x000003ffu
#define I2C_IC_SAR_RESET 0x00000055u
#define I2C_IC_SAR_IC_SAR_RESET 0x055u
#define I2C_IC_SAR_IC_SAR_BITS 0x000003ffu
#define I2C_IC_SAR_IC_SAR_MSB 9u
#define I2C_IC_SAR_IC_SAR_LSB 0u
#define I2C_IC_SAR_IC_SAR_ACCESS "RW"
#define I2C_IC_DATA_CMD_OFFSET 0x00000010u
#define I2C_IC_DATA_CMD_BITS 0x00000fffu
#define I2C_IC_DATA_CMD_RESET 0x00000000u
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_RESET 0x0u
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_BITS 0x00000800u
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_MSB 11u
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_LSB 11u
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_ACCESS "RO"
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_VALUE_INACTIVE 0x0u
#define I2C_IC_DATA_CMD_FIRST_DATA_BYTE_VALUE_ACTIVE 0x1u
#define I2C_IC_DATA_CMD_RESTART_RESET 0x0u
#define I2C_IC_DATA_CMD_RESTART_BITS 0x00000400u
#define I2C_IC_DATA_CMD_RESTART_MSB 10u
#define I2C_IC_DATA_CMD_RESTART_LSB 10u
#define I2C_IC_DATA_CMD_RESTART_ACCESS "SC"
#define I2C_IC_DATA_CMD_RESTART_VALUE_DISABLE 0x0u
#define I2C_IC_DATA_CMD_RESTART_VALUE_ENABLE 0x1u
#define I2C_IC_DATA_CMD_STOP_RESET 0x0u
#define I2C_IC_DATA_CMD_STOP_BITS 0x00000200u
#define I2C_IC_DATA_CMD_STOP_MSB 9u
#define I2C_IC_DATA_CMD_STOP_LSB 9u
#define I2C_IC_DATA_CMD_STOP_ACCESS "SC"
#define I2C_IC_DATA_CMD_STOP_VALUE_DISABLE 0x0u
#define I2C_IC_DATA_CMD_STOP_VALUE_ENABLE 0x1u
#define I2C_IC_DATA_CMD_CMD_RESET 0x0u
#define I2C_IC_DATA_CMD_CMD_BITS 0x00000100u
#define I2C_IC_DATA_CMD_CMD_MSB 8u
#define I2C_IC_DATA_CMD_CMD_LSB 8u
#define I2C_IC_DATA_CMD_CMD_ACCESS "SC"
#define I2C_IC_DATA_CMD_CMD_VALUE_WRITE 0x0u
#define I2C_IC_DATA_CMD_CMD_VALUE_READ 0x1u
#define I2C_IC_DATA_CMD_DAT_RESET 0x00u
#define I2C_IC_DATA_CMD_DAT_BITS 0x000000ffu
#define I2C_IC_DATA_CMD_DAT_MSB 7u
#define I2C_IC_DATA_CMD_DAT_LSB 0u
#define I2C_IC_DATA_CMD_DAT_ACCESS "RW"
#define I2C_IC_SS_SCL_HCNT_OFFSET 0x00000014u
#define I2C_IC_SS_SCL_HCNT_BITS 0x0000ffffu
#define I2C_IC_SS_SCL_HCNT_RESET 0x00000028u
#define I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_RESET 0x0028u
#define I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_BITS 0x0000ffffu
#define I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_MSB 15u
#define I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_LSB 0u
#define I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_ACCESS "RW"
#define I2C_IC_SS_SCL_LCNT_OFFSET 0x00000018u
#define I2C_IC_SS_SCL_LCNT_BITS 0x0000ffffu
#define I2C_IC_SS_SCL_LCNT_RESET 0x0000002fu
#define I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_RESET 0x002fu
#define I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_BITS 0x0000ffffu
#define I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_MSB 15u
#define I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_LSB 0u
#define I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_ACCESS "RW"
#define I2C_IC_FS_SCL_HCNT_OFFSET 0x0000001cu
#define I2C_IC_FS_SCL_HCNT_BITS 0x0000ffffu
#define I2C_IC_FS_SCL_HCNT_RESET 0x00000006u
#define I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_RESET 0x0006u
#define I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_BITS 0x0000ffffu
#define I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_MSB 15u
#define I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_LSB 0u
#define I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_ACCESS "RW"
#define I2C_IC_FS_SCL_LCNT_OFFSET 0x00000020u
#define I2C_IC_FS_SCL_LCNT_BITS 0x0000ffffu
#define I2C_IC_FS_SCL_LCNT_RESET 0x0000000du
#define I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_RESET 0x000du
#define I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_BITS 0x0000ffffu
#define I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_MSB 15u
#define I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_LSB 0u
#define I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_ACCESS "RW"
#define I2C_IC_INTR_STAT_OFFSET 0x0000002cu
#define I2C_IC_INTR_STAT_BITS 0x00001fffu
#define I2C_IC_INTR_STAT_RESET 0x00000000u
#define I2C_IC_INTR_STAT_R_RESTART_DET_RESET 0x0u
#define I2C_IC_INTR_STAT_R_RESTART_DET_BITS 0x00001000u
#define I2C_IC_INTR_STAT_R_RESTART_DET_MSB 12u
#define I2C_IC_INTR_STAT_R_RESTART_DET_LSB 12u
#define I2C_IC_INTR_STAT_R_RESTART_DET_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_RESTART_DET_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_RESTART_DET_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_GEN_CALL_RESET 0x0u
#define I2C_IC_INTR_STAT_R_GEN_CALL_BITS 0x00000800u
#define I2C_IC_INTR_STAT_R_GEN_CALL_MSB 11u
#define I2C_IC_INTR_STAT_R_GEN_CALL_LSB 11u
#define I2C_IC_INTR_STAT_R_GEN_CALL_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_GEN_CALL_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_GEN_CALL_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_START_DET_RESET 0x0u
#define I2C_IC_INTR_STAT_R_START_DET_BITS 0x00000400u
#define I2C_IC_INTR_STAT_R_START_DET_MSB 10u
#define I2C_IC_INTR_STAT_R_START_DET_LSB 10u
#define I2C_IC_INTR_STAT_R_START_DET_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_START_DET_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_START_DET_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_STOP_DET_RESET 0x0u
#define I2C_IC_INTR_STAT_R_STOP_DET_BITS 0x00000200u
#define I2C_IC_INTR_STAT_R_STOP_DET_MSB 9u
#define I2C_IC_INTR_STAT_R_STOP_DET_LSB 9u
#define I2C_IC_INTR_STAT_R_STOP_DET_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_STOP_DET_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_STOP_DET_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_ACTIVITY_RESET 0x0u
#define I2C_IC_INTR_STAT_R_ACTIVITY_BITS 0x00000100u
#define I2C_IC_INTR_STAT_R_ACTIVITY_MSB 8u
#define I2C_IC_INTR_STAT_R_ACTIVITY_LSB 8u
#define I2C_IC_INTR_STAT_R_ACTIVITY_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_ACTIVITY_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_ACTIVITY_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_RX_DONE_RESET 0x0u
#define I2C_IC_INTR_STAT_R_RX_DONE_BITS 0x00000080u
#define I2C_IC_INTR_STAT_R_RX_DONE_MSB 7u
#define I2C_IC_INTR_STAT_R_RX_DONE_LSB 7u
#define I2C_IC_INTR_STAT_R_RX_DONE_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_RX_DONE_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_RX_DONE_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_TX_ABRT_RESET 0x0u
#define I2C_IC_INTR_STAT_R_TX_ABRT_BITS 0x00000040u
#define I2C_IC_INTR_STAT_R_TX_ABRT_MSB 6u
#define I2C_IC_INTR_STAT_R_TX_ABRT_LSB 6u
#define I2C_IC_INTR_STAT_R_TX_ABRT_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_TX_ABRT_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_TX_ABRT_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_RD_REQ_RESET 0x0u
#define I2C_IC_INTR_STAT_R_RD_REQ_BITS 0x00000020u
#define I2C_IC_INTR_STAT_R_RD_REQ_MSB 5u
#define I2C_IC_INTR_STAT_R_RD_REQ_LSB 5u
#define I2C_IC_INTR_STAT_R_RD_REQ_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_RD_REQ_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_RD_REQ_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_TX_EMPTY_RESET 0x0u
#define I2C_IC_INTR_STAT_R_TX_EMPTY_BITS 0x00000010u
#define I2C_IC_INTR_STAT_R_TX_EMPTY_MSB 4u
#define I2C_IC_INTR_STAT_R_TX_EMPTY_LSB 4u
#define I2C_IC_INTR_STAT_R_TX_EMPTY_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_TX_EMPTY_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_TX_EMPTY_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_TX_OVER_RESET 0x0u
#define I2C_IC_INTR_STAT_R_TX_OVER_BITS 0x00000008u
#define I2C_IC_INTR_STAT_R_TX_OVER_MSB 3u
#define I2C_IC_INTR_STAT_R_TX_OVER_LSB 3u
#define I2C_IC_INTR_STAT_R_TX_OVER_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_TX_OVER_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_TX_OVER_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_RX_FULL_RESET 0x0u
#define I2C_IC_INTR_STAT_R_RX_FULL_BITS 0x00000004u
#define I2C_IC_INTR_STAT_R_RX_FULL_MSB 2u
#define I2C_IC_INTR_STAT_R_RX_FULL_LSB 2u
#define I2C_IC_INTR_STAT_R_RX_FULL_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_RX_FULL_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_RX_FULL_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_RX_OVER_RESET 0x0u
#define I2C_IC_INTR_STAT_R_RX_OVER_BITS 0x00000002u
#define I2C_IC_INTR_STAT_R_RX_OVER_MSB 1u
#define I2C_IC_INTR_STAT_R_RX_OVER_LSB 1u
#define I2C_IC_INTR_STAT_R_RX_OVER_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_RX_OVER_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_RX_OVER_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_STAT_R_RX_UNDER_RESET 0x0u
#define I2C_IC_INTR_STAT_R_RX_UNDER_BITS 0x00000001u
#define I2C_IC_INTR_STAT_R_RX_UNDER_MSB 0u
#define I2C_IC_INTR_STAT_R_RX_UNDER_LSB 0u
#define I2C_IC_INTR_STAT_R_RX_UNDER_ACCESS "RO"
#define I2C_IC_INTR_STAT_R_RX_UNDER_VALUE_INACTIVE 0x0u
#define I2C_IC_INTR_STAT_R_RX_UNDER_VALUE_ACTIVE 0x1u
#define I2C_IC_INTR_MASK_OFFSET 0x00000030u
#define I2C_IC_INTR_MASK_BITS 0x00001fffu
#define I2C_IC_INTR_MASK_RESET 0x000008ffu
#define I2C_IC_INTR_MASK_M_RESTART_DET_RESET 0x0u
#define I2C_IC_INTR_MASK_M_RESTART_DET_BITS 0x00001000u
#define I2C_IC_INTR_MASK_M_RESTART_DET_MSB 12u
#define I2C_IC_INTR_MASK_M_RESTART_DET_LSB 12u
#define I2C_IC_INTR_MASK_M_RESTART_DET_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_RESTART_DET_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_RESTART_DET_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_GEN_CALL_RESET 0x1u
#define I2C_IC_INTR_MASK_M_GEN_CALL_BITS 0x00000800u
#define I2C_IC_INTR_MASK_M_GEN_CALL_MSB 11u
#define I2C_IC_INTR_MASK_M_GEN_CALL_LSB 11u
#define I2C_IC_INTR_MASK_M_GEN_CALL_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_GEN_CALL_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_GEN_CALL_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_START_DET_RESET 0x0u
#define I2C_IC_INTR_MASK_M_START_DET_BITS 0x00000400u
#define I2C_IC_INTR_MASK_M_START_DET_MSB 10u
#define I2C_IC_INTR_MASK_M_START_DET_LSB 10u
#define I2C_IC_INTR_MASK_M_START_DET_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_START_DET_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_START_DET_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_STOP_DET_RESET 0x0u
#define I2C_IC_INTR_MASK_M_STOP_DET_BITS 0x00000200u
#define I2C_IC_INTR_MASK_M_STOP_DET_MSB 9u
#define I2C_IC_INTR_MASK_M_STOP_DET_LSB 9u
#define I2C_IC_INTR_MASK_M_STOP_DET_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_STOP_DET_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_STOP_DET_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_ACTIVITY_RESET 0x0u
#define I2C_IC_INTR_MASK_M_ACTIVITY_BITS 0x00000100u
#define I2C_IC_INTR_MASK_M_ACTIVITY_MSB 8u
#define I2C_IC_INTR_MASK_M_ACTIVITY_LSB 8u
#define I2C_IC_INTR_MASK_M_ACTIVITY_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_ACTIVITY_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_ACTIVITY_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_RX_DONE_RESET 0x1u
#define I2C_IC_INTR_MASK_M_RX_DONE_BITS 0x00000080u
#define I2C_IC_INTR_MASK_M_RX_DONE_MSB 7u
#define I2C_IC_INTR_MASK_M_RX_DONE_LSB 7u
#define I2C_IC_INTR_MASK_M_RX_DONE_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_RX_DONE_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_RX_DONE_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_TX_ABRT_RESET 0x1u
#define I2C_IC_INTR_MASK_M_TX_ABRT_BITS 0x00000040u
#define I2C_IC_INTR_MASK_M_TX_ABRT_MSB 6u
#define I2C_IC_INTR_MASK_M_TX_ABRT_LSB 6u
#define I2C_IC_INTR_MASK_M_TX_ABRT_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_TX_ABRT_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_TX_ABRT_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_RD_REQ_RESET 0x1u
#define I2C_IC_INTR_MASK_M_RD_REQ_BITS 0x00000020u
#define I2C_IC_INTR_MASK_M_RD_REQ_MSB 5u
#define I2C_IC_INTR_MASK_M_RD_REQ_LSB 5u
#define I2C_IC_INTR_MASK_M_RD_REQ_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_RD_REQ_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_RD_REQ_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_TX_EMPTY_RESET 0x1u
#define I2C_IC_INTR_MASK_M_TX_EMPTY_BITS 0x00000010u
#define I2C_IC_INTR_MASK_M_TX_EMPTY_MSB 4u
#define I2C_IC_INTR_MASK_M_TX_EMPTY_LSB 4u
#define I2C_IC_INTR_MASK_M_TX_EMPTY_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_TX_EMPTY_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_TX_EMPTY_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_TX_OVER_RESET 0x1u
#define I2C_IC_INTR_MASK_M_TX_OVER_BITS 0x00000008u
#define I2C_IC_INTR_MASK_M_TX_OVER_MSB 3u
#define I2C_IC_INTR_MASK_M_TX_OVER_LSB 3u
#define I2C_IC_INTR_MASK_M_TX_OVER_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_TX_OVER_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_TX_OVER_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_RX_FULL_RESET 0x1u
#define I2C_IC_INTR_MASK_M_RX_FULL_BITS 0x00000004u
#define I2C_IC_INTR_MASK_M_RX_FULL_MSB 2u
#define I2C_IC_INTR_MASK_M_RX_FULL_LSB 2u
#define I2C_IC_INTR_MASK_M_RX_FULL_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_RX_FULL_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_RX_FULL_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_RX_OVER_RESET 0x1u
#define I2C_IC_INTR_MASK_M_RX_OVER_BITS 0x00000002u
#define I2C_IC_INTR_MASK_M_RX_OVER_MSB 1u
#define I2C_IC_INTR_MASK_M_RX_OVER_LSB 1u
#define I2C_IC_INTR_MASK_M_RX_OVER_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_RX_OVER_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_RX_OVER_VALUE_DISABLED 0x1u
#define I2C_IC_INTR_MASK_M_RX_UNDER_RESET 0x1u
#define I2C_IC_INTR_MASK_M_RX_UNDER_BITS 0x00000001u
#define I2C_IC_INTR_MASK_M_RX_UNDER_MSB 0u
#define I2C_IC_INTR_MASK_M_RX_UNDER_LSB 0u
#define I2C_IC_INTR_MASK_M_RX_UNDER_ACCESS "RW"
#define I2C_IC_INTR_MASK_M_RX_UNDER_VALUE_ENABLED 0x0u
#define I2C_IC_INTR_MASK_M_RX_UNDER_VALUE_DISABLED 0x1u
#define I2C_IC_RAW_INTR_STAT_OFFSET 0x00000034u
#define I2C_IC_RAW_INTR_STAT_BITS 0x00001fffu
#define I2C_IC_RAW_INTR_STAT_RESET 0x00000000u
#define I2C_IC_RAW_INTR_STAT_RESTART_DET_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_RESTART_DET_BITS 0x00001000u
#define I2C_IC_RAW_INTR_STAT_RESTART_DET_MSB 12u
#define I2C_IC_RAW_INTR_STAT_RESTART_DET_LSB 12u
#define I2C_IC_RAW_INTR_STAT_RESTART_DET_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_RESTART_DET_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_RESTART_DET_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_GEN_CALL_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_GEN_CALL_BITS 0x00000800u
#define I2C_IC_RAW_INTR_STAT_GEN_CALL_MSB 11u
#define I2C_IC_RAW_INTR_STAT_GEN_CALL_LSB 11u
#define I2C_IC_RAW_INTR_STAT_GEN_CALL_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_GEN_CALL_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_GEN_CALL_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_START_DET_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_START_DET_BITS 0x00000400u
#define I2C_IC_RAW_INTR_STAT_START_DET_MSB 10u
#define I2C_IC_RAW_INTR_STAT_START_DET_LSB 10u
#define I2C_IC_RAW_INTR_STAT_START_DET_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_START_DET_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_START_DET_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_STOP_DET_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_STOP_DET_BITS 0x00000200u
#define I2C_IC_RAW_INTR_STAT_STOP_DET_MSB 9u
#define I2C_IC_RAW_INTR_STAT_STOP_DET_LSB 9u
#define I2C_IC_RAW_INTR_STAT_STOP_DET_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_STOP_DET_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_STOP_DET_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_ACTIVITY_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_ACTIVITY_BITS 0x00000100u
#define I2C_IC_RAW_INTR_STAT_ACTIVITY_MSB 8u
#define I2C_IC_RAW_INTR_STAT_ACTIVITY_LSB 8u
#define I2C_IC_RAW_INTR_STAT_ACTIVITY_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_ACTIVITY_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_ACTIVITY_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_RX_DONE_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_RX_DONE_BITS 0x00000080u
#define I2C_IC_RAW_INTR_STAT_RX_DONE_MSB 7u
#define I2C_IC_RAW_INTR_STAT_RX_DONE_LSB 7u
#define I2C_IC_RAW_INTR_STAT_RX_DONE_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_RX_DONE_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_RX_DONE_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_TX_ABRT_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_TX_ABRT_BITS 0x00000040u
#define I2C_IC_RAW_INTR_STAT_TX_ABRT_MSB 6u
#define I2C_IC_RAW_INTR_STAT_TX_ABRT_LSB 6u
#define I2C_IC_RAW_INTR_STAT_TX_ABRT_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_TX_ABRT_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_TX_ABRT_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_RD_REQ_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_RD_REQ_BITS 0x00000020u
#define I2C_IC_RAW_INTR_STAT_RD_REQ_MSB 5u
#define I2C_IC_RAW_INTR_STAT_RD_REQ_LSB 5u
#define I2C_IC_RAW_INTR_STAT_RD_REQ_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_RD_REQ_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_RD_REQ_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_TX_EMPTY_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_TX_EMPTY_BITS 0x00000010u
#define I2C_IC_RAW_INTR_STAT_TX_EMPTY_MSB 4u
#define I2C_IC_RAW_INTR_STAT_TX_EMPTY_LSB 4u
#define I2C_IC_RAW_INTR_STAT_TX_EMPTY_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_TX_EMPTY_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_TX_EMPTY_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_TX_OVER_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_TX_OVER_BITS 0x00000008u
#define I2C_IC_RAW_INTR_STAT_TX_OVER_MSB 3u
#define I2C_IC_RAW_INTR_STAT_TX_OVER_LSB 3u
#define I2C_IC_RAW_INTR_STAT_TX_OVER_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_TX_OVER_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_TX_OVER_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_RX_FULL_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_RX_FULL_BITS 0x00000004u
#define I2C_IC_RAW_INTR_STAT_RX_FULL_MSB 2u
#define I2C_IC_RAW_INTR_STAT_RX_FULL_LSB 2u
#define I2C_IC_RAW_INTR_STAT_RX_FULL_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_RX_FULL_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_RX_FULL_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_RX_OVER_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_RX_OVER_BITS 0x00000002u
#define I2C_IC_RAW_INTR_STAT_RX_OVER_MSB 1u
