gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define I2C_IC_COMP_PARAM_1_HAS_DMA_MSB 6u
#define I2C_IC_COMP_PARAM_1_HAS_DMA_LSB 6u
#define I2C_IC_COMP_PARAM_1_HAS_DMA_ACCESS "RO"
#define I2C_IC_COMP_PARAM_1_INTR_IO_RESET 0x0u
#define I2C_IC_COMP_PARAM_1_INTR_IO_BITS 0x00000020u
#define I2C_IC_COMP_PARAM_1_INTR_IO_MSB 5u
#define I2C_IC_COMP_PARAM_1_INTR_IO_LSB 5u
#define I2C_IC_COMP_PARAM_1_INTR_IO_ACCESS "RO"
#define I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_RESET 0x0u
#define I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_BITS 0x00000010u
#define I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_MSB 4u
#define I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_LSB 4u
#define I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_ACCESS "RO"
#define I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_RESET 0x0u
#define I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_BITS 0x0000000cu
#define I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_MSB 3u
#define I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_LSB 2u
#define I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_ACCESS "RO"
#define I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_RESET 0x0u
#define I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_BITS 0x00000003u
#define I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_MSB 1u
#define I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_LSB 0u
#define I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_ACCESS "RO"
#define I2C_IC_COMP_VERSION_OFFSET 0x000000f8u
#define I2C_IC_COMP_VERSION_BITS 0xffffffffu
#define I2C_IC_COMP_VERSION_RESET 0x3230312au
#define I2C_IC_COMP_VERSION_IC_COMP_VERSION_RESET 0x3230312au
#define I2C_IC_COMP_VERSION_IC_COMP_VERSION_BITS 0xffffffffu
#define I2C_IC_COMP_VERSION_IC_COMP_VERSION_MSB 31u
#define I2C_IC_COMP_VERSION_IC_COMP_VERSION_LSB 0u
#define I2C_IC_COMP_VERSION_IC_COMP_VERSION_ACCESS "RO"
#define I2C_IC_COMP_TYPE_OFFSET 0x000000fcu
#define I2C_IC_COMP_TYPE_BITS 0xffffffffu
#define I2C_IC_COMP_TYPE_RESET 0x44570140u
#define I2C_IC_COMP_TYPE_IC_COMP_TYPE_RESET 0x44570140u
#define I2C_IC_COMP_TYPE_IC_COMP_TYPE_BITS 0xffffffffu
#define I2C_IC_COMP_TYPE_IC_COMP_TYPE_MSB 31u
#define I2C_IC_COMP_TYPE_IC_COMP_TYPE_LSB 0u
#define I2C_IC_COMP_TYPE_IC_COMP_TYPE_ACCESS "RO"
typedef struct {
   
    io_rw_32 con;
   
    io_rw_32 tar;
   
    io_rw_32 sar;
    uint32_t _pad0;
   
    io_rw_32 data_cmd;
   
    io_rw_32 ss_scl_hcnt;
   
    io_rw_32 ss_scl_lcnt;
   
    io_rw_32 fs_scl_hcnt;
   
    io_rw_32 fs_scl_lcnt;
    uint32_t _pad1[2];
   
    io_ro_32 intr_stat;
   
    io_rw_32 intr_mask;
   
    io_ro_32 raw_intr_stat;
   
    io_rw_32 rx_tl;
   
    io_rw_32 tx_tl;
   
    io_ro_32 clr_intr;
   
    io_ro_32 clr_rx_under;
   
    io_ro_32 clr_rx_over;
   
    io_ro_32 clr_tx_over;
   
    io_ro_32 clr_rd_req;
   
    io_ro_32 clr_tx_abrt;
   
    io_ro_32 clr_rx_done;
   
    io_ro_32 clr_activity;
   
    io_ro_32 clr_stop_det;
   
    io_ro_32 clr_start_det;
   
    io_ro_32 clr_gen_call;
   
    io_rw_32 enable;
   
    io_ro_32 status;
   
    io_ro_32 txflr;
   
    io_ro_32 rxflr;
   
    io_rw_32 sda_hold;
   
    io_ro_32 tx_abrt_source;
   
    io_rw_32 slv_data_nack_only;
   
    io_rw_32 dma_cr;
   
    io_rw_32 dma_tdlr;
   
    io_rw_32 dma_rdlr;
   
    io_rw_32 sda_setup;
   
    io_rw_32 ack_general_call;
   
    io_ro_32 enable_status;
   
    io_rw_32 fs_spklen;
    uint32_t _pad2;
   
    io_ro_32 clr_restart_det;
    uint32_t _pad3[18];
   
    io_ro_32 comp_param_1;
   
    io_ro_32 comp_version;
   
    io_ro_32 comp_type;
} i2c_hw_t;
#define i2c0_hw ((i2c_hw_t *)I2C0_BASE)
#define i2c1_hw ((i2c_hw_t *)I2C1_BASE)
_Static_assert(sizeof (i2c_hw_t) == 0x0100, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_I2C 0
typedef struct i2c_inst i2c_inst_t;
extern i2c_inst_t i2c0_inst;
extern i2c_inst_t i2c1_inst;
#define i2c0 (&i2c0_inst)
#define i2c1 (&i2c1_inst)
#define PICO_DEFAULT_I2C_INSTANCE() (__CONCAT(i2c,PICO_DEFAULT_I2C))
#define i2c_default PICO_DEFAULT_I2C_INSTANCE()
uint i2c_init(i2c_inst_t *i2c, uint baudrate);
void i2c_deinit(i2c_inst_t *i2c);
uint i2c_set_baudrate(i2c_inst_t *i2c, uint baudrate);
void i2c_set_slave_mode(i2c_inst_t *i2c, _Bool slave, uint8_t addr);
struct i2c_inst {
    i2c_hw_t *hw;
    _Bool restart_on_next;
};
_Static_assert(2u == 2, "");
#define I2C_NUM(i2c) ((i2c) == i2c1)
_Static_assert(2u == 2, "");
#define I2C_INSTANCE(num) ((num) ? i2c1 : i2c0)
_Static_assert(DREQ_I2C0_RX == DREQ_I2C0_TX + 1, "");
_Static_assert(DREQ_I2C1_RX == DREQ_I2C1_TX + 1, "");
_Static_assert(DREQ_I2C1_TX == DREQ_I2C0_TX + 2, "");
#define I2C_DREQ_NUM(i2c,is_tx) (DREQ_I2C0_TX + I2C_NUM(i2c) * 2 + !(is_tx))
static inline uint i2c_get_index(i2c_inst_t *i2c) {
    ({if (((0 || 0) && !0)) ((!(i2c != (&i2c0_inst) && i2c != (&i2c1_inst))) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_i2c/include/hardware/i2c.h", 205, __func__, "!(i2c != (&i2c0_inst) && i2c != (&i2c1_inst))"));});
    return ((i2c) == (&i2c1_inst));
}
#define i2c_hw_index(i2c) i2c_get_index(i2c)
static inline i2c_hw_t *i2c_get_hw(i2c_inst_t *i2c) {
    i2c_get_index(i2c);
    return i2c->hw;
}
static inline i2c_inst_t *i2c_get_instance(uint num) {
    ({if (((0 || 0) && !0)) ((!(num >= 2u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_i2c/include/hardware/i2c.h", 230, __func__, "!(num >= 2u)"));});
    return ((num) ? (&i2c1_inst) : (&i2c0_inst));
}
int i2c_write_blocking_until(i2c_inst_t *i2c, uint8_t addr, const uint8_t *src, size_t len, _Bool nostop, absolute_time_t until);
int i2c_read_blocking_until(i2c_inst_t *i2c, uint8_t addr, uint8_t *dst, size_t len, _Bool nostop, absolute_time_t until);
static inline int i2c_write_timeout_us(i2c_inst_t *i2c, uint8_t addr, const uint8_t *src, size_t len, _Bool nostop, uint timeout_us) {
    absolute_time_t t = make_timeout_time_us(timeout_us);
    return i2c_write_blocking_until(i2c, addr, src, len, nostop, t);
}
int i2c_write_timeout_per_char_us(i2c_inst_t *i2c, uint8_t addr, const uint8_t *src, size_t len, _Bool nostop, uint timeout_per_char_us);
static inline int i2c_read_timeout_us(i2c_inst_t *i2c, uint8_t addr, uint8_t *dst, size_t len, _Bool nostop, uint timeout_us) {
    absolute_time_t t = make_timeout_time_us(timeout_us);
    return i2c_read_blocking_until(i2c, addr, dst, len, nostop, t);
}
int i2c_read_timeout_per_char_us(i2c_inst_t *i2c, uint8_t addr, uint8_t *dst, size_t len, _Bool nostop, uint timeout_per_char_us);
int i2c_write_blocking(i2c_inst_t *i2c, uint8_t addr, const uint8_t *src, size_t len, _Bool nostop);
int i2c_write_burst_blocking(i2c_inst_t *i2c, uint8_t addr, const uint8_t *src, size_t len);
int i2c_read_blocking(i2c_inst_t *i2c, uint8_t addr, uint8_t *dst, size_t len, _Bool nostop);
int i2c_read_burst_blocking(i2c_inst_t *i2c, uint8_t addr, uint8_t *dst, size_t len);
static inline size_t i2c_get_write_available(i2c_inst_t *i2c) {
    const size_t IC_TX_BUFFER_DEPTH = 16;
    return IC_TX_BUFFER_DEPTH - i2c_get_hw(i2c)->txflr;
}
static inline size_t i2c_get_read_available(i2c_inst_t *i2c) {
    return i2c_get_hw(i2c)->rxflr;
}
static inline void i2c_write_raw_blocking(i2c_inst_t *i2c, const uint8_t *src, size_t len) {
    for (size_t i = 0; i < len; ++i) {
        while (!i2c_get_write_available(i2c))
            tight_loop_contents();
        i2c_get_hw(i2c)->data_cmd = *src++;
    }
}
static inline void i2c_read_raw_blocking(i2c_inst_t *i2c, uint8_t *dst, size_t len) {
    for (size_t i = 0; i < len; ++i) {
        while (!i2c_get_read_available(i2c))
            tight_loop_contents();
        *dst++ = (uint8_t)i2c_get_hw(i2c)->data_cmd;
    }
}
static inline uint8_t i2c_read_byte_raw(i2c_inst_t *i2c) {
    i2c_hw_t *hw = i2c_get_hw(i2c);
    ((hw->status & 0x00000008u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_i2c/include/hardware/i2c.h", 433, __func__, "hw->status & I2C_IC_STATUS_RFNE_BITS"));
    return (uint8_t)hw->data_cmd;
}
static inline void i2c_write_byte_raw(i2c_inst_t *i2c, uint8_t value) {
    i2c_hw_t *hw = i2c_get_hw(i2c);
    ((hw->status & 0x00000002u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_i2c/include/hardware/i2c.h", 448, __func__, "hw->status & I2C_IC_STATUS_TFNF_BITS"));
    hw->data_cmd = value;
}
static inline uint i2c_get_dreq(i2c_inst_t *i2c, _Bool is_tx) {
    return (DREQ_I2C0_TX + ((i2c) == (&i2c1_inst)) * 2 + !(is_tx));
}
#define _HARDWARE_INTERP_H 
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_INTERP 0
#define interp0 interp0_hw
#define interp1 interp1_hw
typedef struct {
    uint32_t ctrl;
} interp_config;
