gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define PIO_SM3_EXECCTRL_BITS 0xffffffffu
#define PIO_SM3_EXECCTRL_RESET 0x0001f000u
#define PIO_SM3_EXECCTRL_EXEC_STALLED_RESET 0x0u
#define PIO_SM3_EXECCTRL_EXEC_STALLED_BITS 0x80000000u
#define PIO_SM3_EXECCTRL_EXEC_STALLED_MSB 31u
#define PIO_SM3_EXECCTRL_EXEC_STALLED_LSB 31u
#define PIO_SM3_EXECCTRL_EXEC_STALLED_ACCESS "RO"
#define PIO_SM3_EXECCTRL_SIDE_EN_RESET 0x0u
#define PIO_SM3_EXECCTRL_SIDE_EN_BITS 0x40000000u
#define PIO_SM3_EXECCTRL_SIDE_EN_MSB 30u
#define PIO_SM3_EXECCTRL_SIDE_EN_LSB 30u
#define PIO_SM3_EXECCTRL_SIDE_EN_ACCESS "RW"
#define PIO_SM3_EXECCTRL_SIDE_PINDIR_RESET 0x0u
#define PIO_SM3_EXECCTRL_SIDE_PINDIR_BITS 0x20000000u
#define PIO_SM3_EXECCTRL_SIDE_PINDIR_MSB 29u
#define PIO_SM3_EXECCTRL_SIDE_PINDIR_LSB 29u
#define PIO_SM3_EXECCTRL_SIDE_PINDIR_ACCESS "RW"
#define PIO_SM3_EXECCTRL_JMP_PIN_RESET 0x00u
#define PIO_SM3_EXECCTRL_JMP_PIN_BITS 0x1f000000u
#define PIO_SM3_EXECCTRL_JMP_PIN_MSB 28u
#define PIO_SM3_EXECCTRL_JMP_PIN_LSB 24u
#define PIO_SM3_EXECCTRL_JMP_PIN_ACCESS "RW"
#define PIO_SM3_EXECCTRL_OUT_EN_SEL_RESET 0x00u
#define PIO_SM3_EXECCTRL_OUT_EN_SEL_BITS 0x00f80000u
#define PIO_SM3_EXECCTRL_OUT_EN_SEL_MSB 23u
#define PIO_SM3_EXECCTRL_OUT_EN_SEL_LSB 19u
#define PIO_SM3_EXECCTRL_OUT_EN_SEL_ACCESS "RW"
#define PIO_SM3_EXECCTRL_INLINE_OUT_EN_RESET 0x0u
#define PIO_SM3_EXECCTRL_INLINE_OUT_EN_BITS 0x00040000u
#define PIO_SM3_EXECCTRL_INLINE_OUT_EN_MSB 18u
#define PIO_SM3_EXECCTRL_INLINE_OUT_EN_LSB 18u
#define PIO_SM3_EXECCTRL_INLINE_OUT_EN_ACCESS "RW"
#define PIO_SM3_EXECCTRL_OUT_STICKY_RESET 0x0u
#define PIO_SM3_EXECCTRL_OUT_STICKY_BITS 0x00020000u
#define PIO_SM3_EXECCTRL_OUT_STICKY_MSB 17u
#define PIO_SM3_EXECCTRL_OUT_STICKY_LSB 17u
#define PIO_SM3_EXECCTRL_OUT_STICKY_ACCESS "RW"
#define PIO_SM3_EXECCTRL_WRAP_TOP_RESET 0x1fu
#define PIO_SM3_EXECCTRL_WRAP_TOP_BITS 0x0001f000u
#define PIO_SM3_EXECCTRL_WRAP_TOP_MSB 16u
#define PIO_SM3_EXECCTRL_WRAP_TOP_LSB 12u
#define PIO_SM3_EXECCTRL_WRAP_TOP_ACCESS "RW"
#define PIO_SM3_EXECCTRL_WRAP_BOTTOM_RESET 0x00u
#define PIO_SM3_EXECCTRL_WRAP_BOTTOM_BITS 0x00000f80u
#define PIO_SM3_EXECCTRL_WRAP_BOTTOM_MSB 11u
#define PIO_SM3_EXECCTRL_WRAP_BOTTOM_LSB 7u
#define PIO_SM3_EXECCTRL_WRAP_BOTTOM_ACCESS "RW"
#define PIO_SM3_EXECCTRL_STATUS_SEL_RESET 0x0u
#define PIO_SM3_EXECCTRL_STATUS_SEL_BITS 0x00000060u
#define PIO_SM3_EXECCTRL_STATUS_SEL_MSB 6u
#define PIO_SM3_EXECCTRL_STATUS_SEL_LSB 5u
#define PIO_SM3_EXECCTRL_STATUS_SEL_ACCESS "RW"
#define PIO_SM3_EXECCTRL_STATUS_SEL_VALUE_TXLEVEL 0x0u
#define PIO_SM3_EXECCTRL_STATUS_SEL_VALUE_RXLEVEL 0x1u
#define PIO_SM3_EXECCTRL_STATUS_SEL_VALUE_IRQ 0x2u
#define PIO_SM3_EXECCTRL_STATUS_N_RESET 0x00u
#define PIO_SM3_EXECCTRL_STATUS_N_BITS 0x0000001fu
#define PIO_SM3_EXECCTRL_STATUS_N_MSB 4u
#define PIO_SM3_EXECCTRL_STATUS_N_LSB 0u
#define PIO_SM3_EXECCTRL_STATUS_N_ACCESS "RW"
#define PIO_SM3_EXECCTRL_STATUS_N_VALUE_IRQ 0x00u
#define PIO_SM3_EXECCTRL_STATUS_N_VALUE_IRQ_PREVPIO 0x08u
#define PIO_SM3_EXECCTRL_STATUS_N_VALUE_IRQ_NEXTPIO 0x10u
#define PIO_SM3_SHIFTCTRL_OFFSET 0x00000118u
#define PIO_SM3_SHIFTCTRL_BITS 0xffffc01fu
#define PIO_SM3_SHIFTCTRL_RESET 0x000c0000u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_RESET 0x0u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_BITS 0x80000000u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_MSB 31u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_LSB 31u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_FJOIN_TX_RESET 0x0u
#define PIO_SM3_SHIFTCTRL_FJOIN_TX_BITS 0x40000000u
#define PIO_SM3_SHIFTCTRL_FJOIN_TX_MSB 30u
#define PIO_SM3_SHIFTCTRL_FJOIN_TX_LSB 30u
#define PIO_SM3_SHIFTCTRL_FJOIN_TX_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_PULL_THRESH_RESET 0x00u
#define PIO_SM3_SHIFTCTRL_PULL_THRESH_BITS 0x3e000000u
#define PIO_SM3_SHIFTCTRL_PULL_THRESH_MSB 29u
#define PIO_SM3_SHIFTCTRL_PULL_THRESH_LSB 25u
#define PIO_SM3_SHIFTCTRL_PULL_THRESH_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_RESET 0x00u
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_BITS 0x01f00000u
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_MSB 24u
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_LSB 20u
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_RESET 0x1u
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_BITS 0x00080000u
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_MSB 19u
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_LSB 19u
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_RESET 0x1u
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_BITS 0x00040000u
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_MSB 18u
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_LSB 18u
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_AUTOPULL_RESET 0x0u
#define PIO_SM3_SHIFTCTRL_AUTOPULL_BITS 0x00020000u
#define PIO_SM3_SHIFTCTRL_AUTOPULL_MSB 17u
#define PIO_SM3_SHIFTCTRL_AUTOPULL_LSB 17u
#define PIO_SM3_SHIFTCTRL_AUTOPULL_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_RESET 0x0u
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_BITS 0x00010000u
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_MSB 16u
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_LSB 16u
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_RESET 0x0u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_BITS 0x00008000u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_MSB 15u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_LSB 15u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_RESET 0x0u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_BITS 0x00004000u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_MSB 14u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_LSB 14u
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_ACCESS "RW"
#define PIO_SM3_SHIFTCTRL_IN_COUNT_RESET 0x00u
#define PIO_SM3_SHIFTCTRL_IN_COUNT_BITS 0x0000001fu
#define PIO_SM3_SHIFTCTRL_IN_COUNT_MSB 4u
#define PIO_SM3_SHIFTCTRL_IN_COUNT_LSB 0u
#define PIO_SM3_SHIFTCTRL_IN_COUNT_ACCESS "RW"
#define PIO_SM3_ADDR_OFFSET 0x0000011cu
#define PIO_SM3_ADDR_BITS 0x0000001fu
#define PIO_SM3_ADDR_RESET 0x00000000u
#define PIO_SM3_ADDR_MSB 4u
#define PIO_SM3_ADDR_LSB 0u
#define PIO_SM3_ADDR_ACCESS "RO"
#define PIO_SM3_INSTR_OFFSET 0x00000120u
#define PIO_SM3_INSTR_BITS 0x0000ffffu
#define PIO_SM3_INSTR_RESET "-"
#define PIO_SM3_INSTR_MSB 15u
#define PIO_SM3_INSTR_LSB 0u
#define PIO_SM3_INSTR_ACCESS "RW"
#define PIO_SM3_PINCTRL_OFFSET 0x00000124u
#define PIO_SM3_PINCTRL_BITS 0xffffffffu
#define PIO_SM3_PINCTRL_RESET 0x14000000u
#define PIO_SM3_PINCTRL_SIDESET_COUNT_RESET 0x0u
#define PIO_SM3_PINCTRL_SIDESET_COUNT_BITS 0xe0000000u
#define PIO_SM3_PINCTRL_SIDESET_COUNT_MSB 31u
#define PIO_SM3_PINCTRL_SIDESET_COUNT_LSB 29u
#define PIO_SM3_PINCTRL_SIDESET_COUNT_ACCESS "RW"
#define PIO_SM3_PINCTRL_SET_COUNT_RESET 0x5u
#define PIO_SM3_PINCTRL_SET_COUNT_BITS 0x1c000000u
#define PIO_SM3_PINCTRL_SET_COUNT_MSB 28u
#define PIO_SM3_PINCTRL_SET_COUNT_LSB 26u
#define PIO_SM3_PINCTRL_SET_COUNT_ACCESS "RW"
#define PIO_SM3_PINCTRL_OUT_COUNT_RESET 0x00u
#define PIO_SM3_PINCTRL_OUT_COUNT_BITS 0x03f00000u
#define PIO_SM3_PINCTRL_OUT_COUNT_MSB 25u
#define PIO_SM3_PINCTRL_OUT_COUNT_LSB 20u
#define PIO_SM3_PINCTRL_OUT_COUNT_ACCESS "RW"
#define PIO_SM3_PINCTRL_IN_BASE_RESET 0x00u
#define PIO_SM3_PINCTRL_IN_BASE_BITS 0x000f8000u
#define PIO_SM3_PINCTRL_IN_BASE_MSB 19u
#define PIO_SM3_PINCTRL_IN_BASE_LSB 15u
#define PIO_SM3_PINCTRL_IN_BASE_ACCESS "RW"
#define PIO_SM3_PINCTRL_SIDESET_BASE_RESET 0x00u
#define PIO_SM3_PINCTRL_SIDESET_BASE_BITS 0x00007c00u
#define PIO_SM3_PINCTRL_SIDESET_BASE_MSB 14u
#define PIO_SM3_PINCTRL_SIDESET_BASE_LSB 10u
#define PIO_SM3_PINCTRL_SIDESET_BASE_ACCESS "RW"
#define PIO_SM3_PINCTRL_SET_BASE_RESET 0x00u
#define PIO_SM3_PINCTRL_SET_BASE_BITS 0x000003e0u
#define PIO_SM3_PINCTRL_SET_BASE_MSB 9u
#define PIO_SM3_PINCTRL_SET_BASE_LSB 5u
#define PIO_SM3_PINCTRL_SET_BASE_ACCESS "RW"
#define PIO_SM3_PINCTRL_OUT_BASE_RESET 0x00u
#define PIO_SM3_PINCTRL_OUT_BASE_BITS 0x0000001fu
#define PIO_SM3_PINCTRL_OUT_BASE_MSB 4u
#define PIO_SM3_PINCTRL_OUT_BASE_LSB 0u
#define PIO_SM3_PINCTRL_OUT_BASE_ACCESS "RW"
#define PIO_RXF0_PUTGET0_OFFSET 0x00000128u
#define PIO_RXF0_PUTGET0_BITS 0xffffffffu
#define PIO_RXF0_PUTGET0_RESET 0x00000000u
#define PIO_RXF0_PUTGET0_MSB 31u
#define PIO_RXF0_PUTGET0_LSB 0u
#define PIO_RXF0_PUTGET0_ACCESS "RW"
#define PIO_RXF0_PUTGET1_OFFSET 0x0000012cu
#define PIO_RXF0_PUTGET1_BITS 0xffffffffu
#define PIO_RXF0_PUTGET1_RESET 0x00000000u
#define PIO_RXF0_PUTGET1_MSB 31u
#define PIO_RXF0_PUTGET1_LSB 0u
#define PIO_RXF0_PUTGET1_ACCESS "RW"
#define PIO_RXF0_PUTGET2_OFFSET 0x00000130u
#define PIO_RXF0_PUTGET2_BITS 0xffffffffu
#define PIO_RXF0_PUTGET2_RESET 0x00000000u
#define PIO_RXF0_PUTGET2_MSB 31u
#define PIO_RXF0_PUTGET2_LSB 0u
#define PIO_RXF0_PUTGET2_ACCESS "RW"
#define PIO_RXF0_PUTGET3_OFFSET 0x00000134u
#define PIO_RXF0_PUTGET3_BITS 0xffffffffu
#define PIO_RXF0_PUTGET3_RESET 0x00000000u
#define PIO_RXF0_PUTGET3_MSB 31u
#define PIO_RXF0_PUTGET3_LSB 0u
#define PIO_RXF0_PUTGET3_ACCESS "RW"
#define PIO_RXF1_PUTGET0_OFFSET 0x00000138u
#define PIO_RXF1_PUTGET0_BITS 0xffffffffu
#define PIO_RXF1_PUTGET0_RESET 0x00000000u
#define PIO_RXF1_PUTGET0_MSB 31u
#define PIO_RXF1_PUTGET0_LSB 0u
#define PIO_RXF1_PUTGET0_ACCESS "RW"
#define PIO_RXF1_PUTGET1_OFFSET 0x0000013cu
#define PIO_RXF1_PUTGET1_BITS 0xffffffffu
#define PIO_RXF1_PUTGET1_RESET 0x00000000u
#define PIO_RXF1_PUTGET1_MSB 31u
#define PIO_RXF1_PUTGET1_LSB 0u
#define PIO_RXF1_PUTGET1_ACCESS "RW"
#define PIO_RXF1_PUTGET2_OFFSET 0x00000140u
#define PIO_RXF1_PUTGET2_BITS 0xffffffffu
#define PIO_RXF1_PUTGET2_RESET 0x00000000u
#define PIO_RXF1_PUTGET2_MSB 31u
#define PIO_RXF1_PUTGET2_LSB 0u
#define PIO_RXF1_PUTGET2_ACCESS "RW"
#define PIO_RXF1_PUTGET3_OFFSET 0x00000144u
#define PIO_RXF1_PUTGET3_BITS 0xffffffffu
#define PIO_RXF1_PUTGET3_RESET 0x00000000u
#define PIO_RXF1_PUTGET3_MSB 31u
#define PIO_RXF1_PUTGET3_LSB 0u
#define PIO_RXF1_PUTGET3_ACCESS "RW"
#define PIO_RXF2_PUTGET0_OFFSET 0x00000148u
#define PIO_RXF2_PUTGET0_BITS 0xffffffffu
#define PIO_RXF2_PUTGET0_RESET 0x00000000u
#define PIO_RXF2_PUTGET0_MSB 31u
#define PIO_RXF2_PUTGET0_LSB 0u
#define PIO_RXF2_PUTGET0_ACCESS "RW"
#define PIO_RXF2_PUTGET1_OFFSET 0x0000014cu
#define PIO_RXF2_PUTGET1_BITS 0xffffffffu
#define PIO_RXF2_PUTGET1_RESET 0x00000000u
#define PIO_RXF2_PUTGET1_MSB 31u
#define PIO_RXF2_PUTGET1_LSB 0u
#define PIO_RXF2_PUTGET1_ACCESS "RW"
#define PIO_RXF2_PUTGET2_OFFSET 0x00000150u
#define PIO_RXF2_PUTGET2_BITS 0xffffffffu
#define PIO_RXF2_PUTGET2_RESET 0x00000000u
#define PIO_RXF2_PUTGET2_MSB 31u
#define PIO_RXF2_PUTGET2_LSB 0u
#define PIO_RXF2_PUTGET2_ACCESS "RW"
#define PIO_RXF2_PUTGET3_OFFSET 0x00000154u
#define PIO_RXF2_PUTGET3_BITS 0xffffffffu
#define PIO_RXF2_PUTGET3_RESET 0x00000000u
#define PIO_RXF2_PUTGET3_MSB 31u
#define PIO_RXF2_PUTGET3_LSB 0u
#define PIO_RXF2_PUTGET3_ACCESS "RW"
#define PIO_RXF3_PUTGET0_OFFSET 0x00000158u
#define PIO_RXF3_PUTGET0_BITS 0xffffffffu
#define PIO_RXF3_PUTGET0_RESET 0x00000000u
#define PIO_RXF3_PUTGET0_MSB 31u
#define PIO_RXF3_PUTGET0_LSB 0u
#define PIO_RXF3_PUTGET0_ACCESS "RW"
#define PIO_RXF3_PUTGET1_OFFSET 0x0000015cu
#define PIO_RXF3_PUTGET1_BITS 0xffffffffu
#define PIO_RXF3_PUTGET1_RESET 0x00000000u
#define PIO_RXF3_PUTGET1_MSB 31u
#define PIO_RXF3_PUTGET1_LSB 0u
#define PIO_RXF3_PUTGET1_ACCESS "RW"
#define PIO_RXF3_PUTGET2_OFFSET 0x00000160u
#define PIO_RXF3_PUTGET2_BITS 0xffffffffu
#define PIO_RXF3_PUTGET2_RESET 0x00000000u
#define PIO_RXF3_PUTGET2_MSB 31u
#define PIO_RXF3_PUTGET2_LSB 0u
#define PIO_RXF3_PUTGET2_ACCESS "RW"
#define PIO_RXF3_PUTGET3_OFFSET 0x00000164u
#define PIO_RXF3_PUTGET3_BITS 0xffffffffu
#define PIO_RXF3_PUTGET3_RESET 0x00000000u
#define PIO_RXF3_PUTGET3_MSB 31u
#define PIO_RXF3_PUTGET3_LSB 0u
#define PIO_RXF3_PUTGET3_ACCESS "RW"
#define PIO_GPIOBASE_OFFSET 0x00000168u
#define PIO_GPIOBASE_BITS 0x00000010u
#define PIO_GPIOBASE_RESET 0x00000000u
#define PIO_GPIOBASE_MSB 4u
#define PIO_GPIOBASE_LSB 4u
#define PIO_GPIOBASE_ACCESS "RW"
#define PIO_INTR_OFFSET 0x0000016cu
#define PIO_INTR_BITS 0x0000ffffu
#define PIO_INTR_RESET 0x00000000u
#define PIO_INTR_SM7_RESET 0x0u
#define PIO_INTR_SM7_BITS 0x00008000u
#define PIO_INTR_SM7_MSB 15u
#define PIO_INTR_SM7_LSB 15u
#define PIO_INTR_SM7_ACCESS "RO"
#define PIO_INTR_SM6_RESET 0x0u
#define PIO_INTR_SM6_BITS 0x00004000u
#define PIO_INTR_SM6_MSB 14u
#define PIO_INTR_SM6_LSB 14u
#define PIO_INTR_SM6_ACCESS "RO"
#define PIO_INTR_SM5_RESET 0x0u
#define PIO_INTR_SM5_BITS 0x00002000u
#define PIO_INTR_SM5_MSB 13u
#define PIO_INTR_SM5_LSB 13u
#define PIO_INTR_SM5_ACCESS "RO"
#define PIO_INTR_SM4_RESET 0x0u
#define PIO_INTR_SM4_BITS 0x00001000u
#define PIO_INTR_SM4_MSB 12u
#define PIO_INTR_SM4_LSB 12u
#define PIO_INTR_SM4_ACCESS "RO"
#define PIO_INTR_SM3_RESET 0x0u
#define PIO_INTR_SM3_BITS 0x00000800u
#define PIO_INTR_SM3_MSB 11u
#define PIO_INTR_SM3_LSB 11u
#define PIO_INTR_SM3_ACCESS "RO"
#define PIO_INTR_SM2_RESET 0x0u
#define PIO_INTR_SM2_BITS 0x00000400u
#define PIO_INTR_SM2_MSB 10u
#define PIO_INTR_SM2_LSB 10u
#define PIO_INTR_SM2_ACCESS "RO"
#define PIO_INTR_SM1_RESET 0x0u
#define PIO_INTR_SM1_BITS 0x00000200u
#define PIO_INTR_SM1_MSB 9u
#define PIO_INTR_SM1_LSB 9u
#define PIO_INTR_SM1_ACCESS "RO"
#define PIO_INTR_SM0_RESET 0x0u
#define PIO_INTR_SM0_BITS 0x00000100u
#define PIO_INTR_SM0_MSB 8u
#define PIO_INTR_SM0_LSB 8u
#define PIO_INTR_SM0_ACCESS "RO"
#define PIO_INTR_SM3_TXNFULL_RESET 0x0u
#define PIO_INTR_SM3_TXNFULL_BITS 0x00000080u
#define PIO_INTR_SM3_TXNFULL_MSB 7u
#define PIO_INTR_SM3_TXNFULL_LSB 7u
#define PIO_INTR_SM3_TXNFULL_ACCESS "RO"
#define PIO_INTR_SM2_TXNFULL_RESET 0x0u
#define PIO_INTR_SM2_TXNFULL_BITS 0x00000040u
#define PIO_INTR_SM2_TXNFULL_MSB 6u
#define PIO_INTR_SM2_TXNFULL_LSB 6u
#define PIO_INTR_SM2_TXNFULL_ACCESS "RO"
#define PIO_INTR_SM1_TXNFULL_RESET 0x0u
#define PIO_INTR_SM1_TXNFULL_BITS 0x00000020u
#define PIO_INTR_SM1_TXNFULL_MSB 5u
#define PIO_INTR_SM1_TXNFULL_LSB 5u
#define PIO_INTR_SM1_TXNFULL_ACCESS "RO"
#define PIO_INTR_SM0_TXNFULL_RESET 0x0u
#define PIO_INTR_SM0_TXNFULL_BITS 0x00000010u
#define PIO_INTR_SM0_TXNFULL_MSB 4u
#define PIO_INTR_SM0_TXNFULL_LSB 4u
#define PIO_INTR_SM0_TXNFULL_ACCESS "RO"
#define PIO_INTR_SM3_RXNEMPTY_RESET 0x0u
#define PIO_INTR_SM3_RXNEMPTY_BITS 0x00000008u
#define PIO_INTR_SM3_RXNEMPTY_MSB 3u
#define PIO_INTR_SM3_RXNEMPTY_LSB 3u
#define PIO_INTR_SM3_RXNEMPTY_ACCESS "RO"
#define PIO_INTR_SM2_RXNEMPTY_RESET 0x0u
#define PIO_INTR_SM2_RXNEMPTY_BITS 0x00000004u
#define PIO_INTR_SM2_RXNEMPTY_MSB 2u
#define PIO_INTR_SM2_RXNEMPTY_LSB 2u
#define PIO_INTR_SM2_RXNEMPTY_ACCESS "RO"
#define PIO_INTR_SM1_RXNEMPTY_RESET 0x0u
#define PIO_INTR_SM1_RXNEMPTY_BITS 0x00000002u
#define PIO_INTR_SM1_RXNEMPTY_MSB 1u
#define PIO_INTR_SM1_RXNEMPTY_LSB 1u
#define PIO_INTR_SM1_RXNEMPTY_ACCESS "RO"
#define PIO_INTR_SM0_RXNEMPTY_RESET 0x0u
#define PIO_INTR_SM0_RXNEMPTY_BITS 0x00000001u
#define PIO_INTR_SM0_RXNEMPTY_MSB 0u
#define PIO_INTR_SM0_RXNEMPTY_LSB 0u
#define PIO_INTR_SM0_RXNEMPTY_ACCESS "RO"
#define PIO_IRQ0_INTE_OFFSET 0x00000170u
#define PIO_IRQ0_INTE_BITS 0x0000ffffu
#define PIO_IRQ0_INTE_RESET 0x00000000u
#define PIO_IRQ0_INTE_SM7_RESET 0x0u
#define PIO_IRQ0_INTE_SM7_BITS 0x00008000u
#define PIO_IRQ0_INTE_SM7_MSB 15u
#define PIO_IRQ0_INTE_SM7_LSB 15u
#define PIO_IRQ0_INTE_SM7_ACCESS "RW"
#define PIO_IRQ0_INTE_SM6_RESET 0x0u
#define PIO_IRQ0_INTE_SM6_BITS 0x00004000u
#define PIO_IRQ0_INTE_SM6_MSB 14u
#define PIO_IRQ0_INTE_SM6_LSB 14u
#define PIO_IRQ0_INTE_SM6_ACCESS "RW"
#define PIO_IRQ0_INTE_SM5_RESET 0x0u
#define PIO_IRQ0_INTE_SM5_BITS 0x00002000u
#define PIO_IRQ0_INTE_SM5_MSB 13u
#define PIO_IRQ0_INTE_SM5_LSB 13u
#define PIO_IRQ0_INTE_SM5_ACCESS "RW"
#define PIO_IRQ0_INTE_SM4_RESET 0x0u
#define PIO_IRQ0_INTE_SM4_BITS 0x00001000u
#define PIO_IRQ0_INTE_SM4_MSB 12u
#define PIO_IRQ0_INTE_SM4_LSB 12u
#define PIO_IRQ0_INTE_SM4_ACCESS "RW"
#define PIO_IRQ0_INTE_SM3_RESET 0x0u
#define PIO_IRQ0_INTE_SM3_BITS 0x00000800u
#define PIO_IRQ0_INTE_SM3_MSB 11u
#define PIO_IRQ0_INTE_SM3_LSB 11u
#define PIO_IRQ0_INTE_SM3_ACCESS "RW"
#define PIO_IRQ0_INTE_SM2_RESET 0x0u
#define PIO_IRQ0_INTE_SM2_BITS 0x00000400u
#define PIO_IRQ0_INTE_SM2_MSB 10u
#define PIO_IRQ0_INTE_SM2_LSB 10u
#define PIO_IRQ0_INTE_SM2_ACCESS "RW"
#define PIO_IRQ0_INTE_SM1_RESET 0x0u
#define PIO_IRQ0_INTE_SM1_BITS 0x00000200u
#define PIO_IRQ0_INTE_SM1_MSB 9u
#define PIO_IRQ0_INTE_SM1_LSB 9u
#define PIO_IRQ0_INTE_SM1_ACCESS "RW"
#define PIO_IRQ0_INTE_SM0_RESET 0x0u
#define PIO_IRQ0_INTE_SM0_BITS 0x00000100u
#define PIO_IRQ0_INTE_SM0_MSB 8u
#define PIO_IRQ0_INTE_SM0_LSB 8u
#define PIO_IRQ0_INTE_SM0_ACCESS "RW"
#define PIO_IRQ0_INTE_SM3_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTE_SM3_TXNFULL_BITS 0x00000080u
#define PIO_IRQ0_INTE_SM3_TXNFULL_MSB 7u
#define PIO_IRQ0_INTE_SM3_TXNFULL_LSB 7u
#define PIO_IRQ0_INTE_SM3_TXNFULL_ACCESS "RW"
#define PIO_IRQ0_INTE_SM2_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTE_SM2_TXNFULL_BITS 0x00000040u
#define PIO_IRQ0_INTE_SM2_TXNFULL_MSB 6u
#define PIO_IRQ0_INTE_SM2_TXNFULL_LSB 6u
#define PIO_IRQ0_INTE_SM2_TXNFULL_ACCESS "RW"
#define PIO_IRQ0_INTE_SM1_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTE_SM1_TXNFULL_BITS 0x00000020u
#define PIO_IRQ0_INTE_SM1_TXNFULL_MSB 5u
#define PIO_IRQ0_INTE_SM1_TXNFULL_LSB 5u
#define PIO_IRQ0_INTE_SM1_TXNFULL_ACCESS "RW"
#define PIO_IRQ0_INTE_SM0_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTE_SM0_TXNFULL_BITS 0x00000010u
#define PIO_IRQ0_INTE_SM0_TXNFULL_MSB 4u
#define PIO_IRQ0_INTE_SM0_TXNFULL_LSB 4u
#define PIO_IRQ0_INTE_SM0_TXNFULL_ACCESS "RW"
#define PIO_IRQ0_INTE_SM3_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTE_SM3_RXNEMPTY_BITS 0x00000008u
#define PIO_IRQ0_INTE_SM3_RXNEMPTY_MSB 3u
#define PIO_IRQ0_INTE_SM3_RXNEMPTY_LSB 3u
#define PIO_IRQ0_INTE_SM3_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ0_INTE_SM2_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTE_SM2_RXNEMPTY_BITS 0x00000004u
#define PIO_IRQ0_INTE_SM2_RXNEMPTY_MSB 2u
#define PIO_IRQ0_INTE_SM2_RXNEMPTY_LSB 2u
#define PIO_IRQ0_INTE_SM2_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ0_INTE_SM1_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS 0x00000002u
#define PIO_IRQ0_INTE_SM1_RXNEMPTY_MSB 1u
#define PIO_IRQ0_INTE_SM1_RXNEMPTY_LSB 1u
#define PIO_IRQ0_INTE_SM1_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ0_INTE_SM0_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTE_SM0_RXNEMPTY_BITS 0x00000001u
#define PIO_IRQ0_INTE_SM0_RXNEMPTY_MSB 0u
#define PIO_IRQ0_INTE_SM0_RXNEMPTY_LSB 0u
#define PIO_IRQ0_INTE_SM0_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ0_INTF_OFFSET 0x00000174u
#define PIO_IRQ0_INTF_BITS 0x0000ffffu
#define PIO_IRQ0_INTF_RESET 0x00000000u
#define PIO_IRQ0_INTF_SM7_RESET 0x0u
#define PIO_IRQ0_INTF_SM7_BITS 0x00008000u
#define PIO_IRQ0_INTF_SM7_MSB 15u
#define PIO_IRQ0_INTF_SM7_LSB 15u
#define PIO_IRQ0_INTF_SM7_ACCESS "RW"
#define PIO_IRQ0_INTF_SM6_RESET 0x0u
#define PIO_IRQ0_INTF_SM6_BITS 0x00004000u
#define PIO_IRQ0_INTF_SM6_MSB 14u
#define PIO_IRQ0_INTF_SM6_LSB 14u
#define PIO_IRQ0_INTF_SM6_ACCESS "RW"
#define PIO_IRQ0_INTF_SM5_RESET 0x0u
#define PIO_IRQ0_INTF_SM5_BITS 0x00002000u
#define PIO_IRQ0_INTF_SM5_MSB 13u
#define PIO_IRQ0_INTF_SM5_LSB 13u
#define PIO_IRQ0_INTF_SM5_ACCESS "RW"
#define PIO_IRQ0_INTF_SM4_RESET 0x0u
#define PIO_IRQ0_INTF_SM4_BITS 0x00001000u
#define PIO_IRQ0_INTF_SM4_MSB 12u
#define PIO_IRQ0_INTF_SM4_LSB 12u
#define PIO_IRQ0_INTF_SM4_ACCESS "RW"
#define PIO_IRQ0_INTF_SM3_RESET 0x0u
#define PIO_IRQ0_INTF_SM3_BITS 0x00000800u
#define PIO_IRQ0_INTF_SM3_MSB 11u
#define PIO_IRQ0_INTF_SM3_LSB 11u
#define PIO_IRQ0_INTF_SM3_ACCESS "RW"
#define PIO_IRQ0_INTF_SM2_RESET 0x0u
#define PIO_IRQ0_INTF_SM2_BITS 0x00000400u
#define PIO_IRQ0_INTF_SM2_MSB 10u
#define PIO_IRQ0_INTF_SM2_LSB 10u
#define PIO_IRQ0_INTF_SM2_ACCESS "RW"
#define PIO_IRQ0_INTF_SM1_RESET 0x0u
#define PIO_IRQ0_INTF_SM1_BITS 0x00000200u
#define PIO_IRQ0_INTF_SM1_MSB 9u
#define PIO_IRQ0_INTF_SM1_LSB 9u
#define PIO_IRQ0_INTF_SM1_ACCESS "RW"
#define PIO_IRQ0_INTF_SM0_RESET 0x0u
#define PIO_IRQ0_INTF_SM0_BITS 0x00000100u
#define PIO_IRQ0_INTF_SM0_MSB 8u
#define PIO_IRQ0_INTF_SM0_LSB 8u
#define PIO_IRQ0_INTF_SM0_ACCESS "RW"
#define PIO_IRQ0_INTF_SM3_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTF_SM3_TXNFULL_BITS 0x00000080u
#define PIO_IRQ0_INTF_SM3_TXNFULL_MSB 7u
#define PIO_IRQ0_INTF_SM3_TXNFULL_LSB 7u
#define PIO_IRQ0_INTF_SM3_TXNFULL_ACCESS "RW"
#define PIO_IRQ0_INTF_SM2_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTF_SM2_TXNFULL_BITS 0x00000040u
#define PIO_IRQ0_INTF_SM2_TXNFULL_MSB 6u
#define PIO_IRQ0_INTF_SM2_TXNFULL_LSB 6u
#define PIO_IRQ0_INTF_SM2_TXNFULL_ACCESS "RW"
#define PIO_IRQ0_INTF_SM1_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTF_SM1_TXNFULL_BITS 0x00000020u
#define PIO_IRQ0_INTF_SM1_TXNFULL_MSB 5u
#define PIO_IRQ0_INTF_SM1_TXNFULL_LSB 5u
#define PIO_IRQ0_INTF_SM1_TXNFULL_ACCESS "RW"
#define PIO_IRQ0_INTF_SM0_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTF_SM0_TXNFULL_BITS 0x00000010u
#define PIO_IRQ0_INTF_SM0_TXNFULL_MSB 4u
#define PIO_IRQ0_INTF_SM0_TXNFULL_LSB 4u
#define PIO_IRQ0_INTF_SM0_TXNFULL_ACCESS "RW"
#define PIO_IRQ0_INTF_SM3_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTF_SM3_RXNEMPTY_BITS 0x00000008u
#define PIO_IRQ0_INTF_SM3_RXNEMPTY_MSB 3u
#define PIO_IRQ0_INTF_SM3_RXNEMPTY_LSB 3u
#define PIO_IRQ0_INTF_SM3_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ0_INTF_SM2_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTF_SM2_RXNEMPTY_BITS 0x00000004u
#define PIO_IRQ0_INTF_SM2_RXNEMPTY_MSB 2u
#define PIO_IRQ0_INTF_SM2_RXNEMPTY_LSB 2u
#define PIO_IRQ0_INTF_SM2_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ0_INTF_SM1_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTF_SM1_RXNEMPTY_BITS 0x00000002u
#define PIO_IRQ0_INTF_SM1_RXNEMPTY_MSB 1u
#define PIO_IRQ0_INTF_SM1_RXNEMPTY_LSB 1u
#define PIO_IRQ0_INTF_SM1_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ0_INTF_SM0_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTF_SM0_RXNEMPTY_BITS 0x00000001u
#define PIO_IRQ0_INTF_SM0_RXNEMPTY_MSB 0u
#define PIO_IRQ0_INTF_SM0_RXNEMPTY_LSB 0u
#define PIO_IRQ0_INTF_SM0_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ0_INTS_OFFSET 0x00000178u
#define PIO_IRQ0_INTS_BITS 0x0000ffffu
#define PIO_IRQ0_INTS_RESET 0x00000000u
#define PIO_IRQ0_INTS_SM7_RESET 0x0u
#define PIO_IRQ0_INTS_SM7_BITS 0x00008000u
#define PIO_IRQ0_INTS_SM7_MSB 15u
#define PIO_IRQ0_INTS_SM7_LSB 15u
#define PIO_IRQ0_INTS_SM7_ACCESS "RO"
#define PIO_IRQ0_INTS_SM6_RESET 0x0u
#define PIO_IRQ0_INTS_SM6_BITS 0x00004000u
#define PIO_IRQ0_INTS_SM6_MSB 14u
#define PIO_IRQ0_INTS_SM6_LSB 14u
#define PIO_IRQ0_INTS_SM6_ACCESS "RO"
#define PIO_IRQ0_INTS_SM5_RESET 0x0u
#define PIO_IRQ0_INTS_SM5_BITS 0x00002000u
#define PIO_IRQ0_INTS_SM5_MSB 13u
#define PIO_IRQ0_INTS_SM5_LSB 13u
#define PIO_IRQ0_INTS_SM5_ACCESS "RO"
#define PIO_IRQ0_INTS_SM4_RESET 0x0u
#define PIO_IRQ0_INTS_SM4_BITS 0x00001000u
#define PIO_IRQ0_INTS_SM4_MSB 12u
#define PIO_IRQ0_INTS_SM4_LSB 12u
#define PIO_IRQ0_INTS_SM4_ACCESS "RO"
#define PIO_IRQ0_INTS_SM3_RESET 0x0u
#define PIO_IRQ0_INTS_SM3_BITS 0x00000800u
#define PIO_IRQ0_INTS_SM3_MSB 11u
#define PIO_IRQ0_INTS_SM3_LSB 11u
#define PIO_IRQ0_INTS_SM3_ACCESS "RO"
#define PIO_IRQ0_INTS_SM2_RESET 0x0u
#define PIO_IRQ0_INTS_SM2_BITS 0x00000400u
#define PIO_IRQ0_INTS_SM2_MSB 10u
#define PIO_IRQ0_INTS_SM2_LSB 10u
#define PIO_IRQ0_INTS_SM2_ACCESS "RO"
#define PIO_IRQ0_INTS_SM1_RESET 0x0u
#define PIO_IRQ0_INTS_SM1_BITS 0x00000200u
#define PIO_IRQ0_INTS_SM1_MSB 9u
#define PIO_IRQ0_INTS_SM1_LSB 9u
#define PIO_IRQ0_INTS_SM1_ACCESS "RO"
#define PIO_IRQ0_INTS_SM0_RESET 0x0u
#define PIO_IRQ0_INTS_SM0_BITS 0x00000100u
#define PIO_IRQ0_INTS_SM0_MSB 8u
#define PIO_IRQ0_INTS_SM0_LSB 8u
#define PIO_IRQ0_INTS_SM0_ACCESS "RO"
#define PIO_IRQ0_INTS_SM3_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTS_SM3_TXNFULL_BITS 0x00000080u
#define PIO_IRQ0_INTS_SM3_TXNFULL_MSB 7u
#define PIO_IRQ0_INTS_SM3_TXNFULL_LSB 7u
#define PIO_IRQ0_INTS_SM3_TXNFULL_ACCESS "RO"
#define PIO_IRQ0_INTS_SM2_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTS_SM2_TXNFULL_BITS 0x00000040u
#define PIO_IRQ0_INTS_SM2_TXNFULL_MSB 6u
#define PIO_IRQ0_INTS_SM2_TXNFULL_LSB 6u
#define PIO_IRQ0_INTS_SM2_TXNFULL_ACCESS "RO"
#define PIO_IRQ0_INTS_SM1_TXNFULL_RESET 0x0u
#define PIO_IRQ0_INTS_SM1_TXNFULL_BITS 0x00000020u
#define PIO_IRQ0_INTS_SM1_TXNFULL_MSB 5u
#define PIO_IRQ0_INTS_SM1_TXNFULL_LSB 5u
#define PIO_IRQ0_INTS_SM1_TXNFULL_ACCESS "RO"
#define PIO_IRQ0_INTS_SM0_TXNFULL_RESET 0x0u
