gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
    io_rw_32 clkdiv;
   
    io_rw_32 execctrl;
   
    io_rw_32 shiftctrl;
   
    io_ro_32 addr;
   
    io_rw_32 instr;
   
    io_rw_32 pinctrl;
} pio_sm_hw_t;
typedef struct {
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
} pio_irq_ctrl_hw_t;
typedef struct {
   
    io_rw_32 ctrl;
   
    io_ro_32 fstat;
   
    io_rw_32 fdebug;
   
    io_ro_32 flevel;
   
    io_wo_32 txf[4];
   
    io_ro_32 rxf[4];
   
    io_rw_32 irq;
   
    io_wo_32 irq_force;
   
    io_rw_32 input_sync_bypass;
   
    io_ro_32 dbg_padout;
   
    io_ro_32 dbg_padoe;
   
    io_ro_32 dbg_cfginfo;
   
    io_wo_32 instr_mem[32];
    pio_sm_hw_t sm[4];
   
    io_rw_32 rxf_putget[4][4];
   
    io_rw_32 gpiobase;
   
    io_ro_32 intr;
    union {
        struct {
           
            io_rw_32 inte0;
           
            io_rw_32 intf0;
           
            io_ro_32 ints0;
           
            io_rw_32 inte1;
           
            io_rw_32 intf1;
           
            io_ro_32 ints1;
        };
        pio_irq_ctrl_hw_t irq_ctrl[2];
    };
} pio_hw_t;
#define pio0_hw ((pio_hw_t *)PIO0_BASE)
#define pio1_hw ((pio_hw_t *)PIO1_BASE)
#define pio2_hw ((pio_hw_t *)PIO2_BASE)
_Static_assert(sizeof (pio_hw_t) == 0x0188, "");
#define _HARDWARE_PIO_INSTRUCTIONS_H 
#define PARAM_ASSERTIONS_ENABLED_PIO_INSTRUCTIONS 0
enum pio_instr_bits {
    pio_instr_bits_jmp = 0x0000,
    pio_instr_bits_wait = 0x2000,
    pio_instr_bits_in = 0x4000,
    pio_instr_bits_out = 0x6000,
    pio_instr_bits_push = 0x8000,
    pio_instr_bits_pull = 0x8080,
    pio_instr_bits_mov = 0xa000,
    pio_instr_bits_irq = 0xc000,
    pio_instr_bits_set = 0xe000,
};
#define _PIO_INVALID_IN_SRC 0x08u
#define _PIO_INVALID_OUT_DEST 0x10u
#define _PIO_INVALID_SET_DEST 0x20u
#define _PIO_INVALID_MOV_SRC 0x40u
#define _PIO_INVALID_MOV_DEST 0x80u
enum pio_src_dest {
    pio_pins = 0u,
    pio_x = 1u,
    pio_y = 2u,
    pio_null = 3u | 0x20u | 0x80u,
    pio_pindirs = 4u | 0x08u | 0x40u | 0x80u,
    pio_exec_mov = 4u | 0x08u | 0x10u | 0x20u | 0x40u,
    pio_status = 5u | 0x08u | 0x10u | 0x20u | 0x80u,
    pio_pc = 5u | 0x08u | 0x20u | 0x40u,
    pio_isr = 6u | 0x20u,
    pio_osr = 7u | 0x10u | 0x20u,
    pio_exec_out = 7u | 0x08u | 0x20u | 0x40u | 0x80u,
};
static inline uint _pio_major_instr_bits(uint instr) {
    return instr & 0xe000u;
}
static inline uint _pio_arg1(uint instr) {
    return (instr >> 5) & 0x7u;
}
static inline uint _pio_encode_instr_and_args(enum pio_instr_bits instr_bits, uint arg1, uint arg2) {
    ({if (((0 || 0) && !0)) ((arg1 <= 0x7) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 87, __func__, "arg1 <= 0x7"));});
    return instr_bits | (arg1 << 5u) | (arg2 & 0x1fu);
}
static inline uint _pio_encode_instr_and_src_dest(enum pio_instr_bits instr_bits, enum pio_src_dest dest, uint value) {
    return _pio_encode_instr_and_args(instr_bits, dest & 7u, value);
}
static inline uint pio_encode_delay(uint cycles) {
    ({if (((0 || 0) && !0)) ((cycles <= 0x1f) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 116, __func__, "cycles <= 0x1f"));});
    return cycles << 8u;
}
static inline uint pio_encode_sideset(uint sideset_bit_count, uint value) {
    ({if (((0 || 0) && !0)) ((sideset_bit_count >= 1 && sideset_bit_count <= 5) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 133, __func__, "sideset_bit_count >= 1 && sideset_bit_count <= 5"));});
    ({if (((0 || 0) && !0)) ((value <= ((1u << sideset_bit_count) - 1)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 134, __func__, "value <= ((1u << sideset_bit_count) - 1)"));});
    return value << (13u - sideset_bit_count);
}
static inline uint pio_encode_sideset_opt(uint sideset_bit_count, uint value) {
    ({if (((0 || 0) && !0)) ((sideset_bit_count >= 0 && sideset_bit_count <= 4) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 151, __func__, "sideset_bit_count >= 0 && sideset_bit_count <= 4"));});
    ({if (((0 || 0) && !0)) ((value <= ((1u << sideset_bit_count) - 1)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 152, __func__, "value <= ((1u << sideset_bit_count) - 1)"));});
    return 0x1000u | value << (12u - sideset_bit_count);
}
static inline uint pio_encode_jmp(uint addr) {
    return _pio_encode_instr_and_args(pio_instr_bits_jmp, 0, addr);
}
static inline uint pio_encode_jmp_not_x(uint addr) {
    return _pio_encode_instr_and_args(pio_instr_bits_jmp, 1, addr);
}
static inline uint pio_encode_jmp_x_dec(uint addr) {
    return _pio_encode_instr_and_args(pio_instr_bits_jmp, 2, addr);
}
static inline uint pio_encode_jmp_not_y(uint addr) {
    return _pio_encode_instr_and_args(pio_instr_bits_jmp, 3, addr);
}
static inline uint pio_encode_jmp_y_dec(uint addr) {
    return _pio_encode_instr_and_args(pio_instr_bits_jmp, 4, addr);
}
static inline uint pio_encode_jmp_x_ne_y(uint addr) {
    return _pio_encode_instr_and_args(pio_instr_bits_jmp, 5, addr);
}
static inline uint pio_encode_jmp_pin(uint addr) {
    return _pio_encode_instr_and_args(pio_instr_bits_jmp, 6, addr);
}
static inline uint pio_encode_jmp_not_osre(uint addr) {
    return _pio_encode_instr_and_args(pio_instr_bits_jmp, 7, addr);
}
static inline uint _pio_encode_irq(_Bool relative, uint irq) {
    ({if (((0 || 0) && !0)) ((irq <= 7) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 261, __func__, "irq <= 7"));});
    return (relative ? 0x10u : 0x0u) | irq;
}
static inline uint pio_encode_wait_gpio(_Bool polarity, uint gpio) {
    return _pio_encode_instr_and_args(pio_instr_bits_wait, 0u | (polarity ? 4u : 0u), gpio);
}
static inline uint pio_encode_wait_pin(_Bool polarity, uint pin) {
    return _pio_encode_instr_and_args(pio_instr_bits_wait, 1u | (polarity ? 4u : 0u), pin);
}
static inline uint pio_encode_wait_irq(_Bool polarity, _Bool relative, uint irq) {
    ({if (((0 || 0) && !0)) ((irq <= 7) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 309, __func__, "irq <= 7"));});
    return _pio_encode_instr_and_args(pio_instr_bits_wait, 2u | (polarity ? 4u : 0u), _pio_encode_irq(relative, irq));
}
static inline uint pio_encode_in(enum pio_src_dest src, uint count) {
    ({if (((0 || 0) && !0)) ((!(src & 0x08u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 324, __func__, "!(src & 0x08u)"));});
    return _pio_encode_instr_and_src_dest(pio_instr_bits_in, src, count);
}
static inline uint pio_encode_out(enum pio_src_dest dest, uint count) {
    ({if (((0 || 0) && !0)) ((!(dest & 0x10u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 339, __func__, "!(dest & 0x10u)"));});
    return _pio_encode_instr_and_src_dest(pio_instr_bits_out, dest, count);
}
static inline uint pio_encode_push(_Bool if_full, _Bool block) {
    return _pio_encode_instr_and_args(pio_instr_bits_push, (if_full ? 2u : 0u) | (block ? 1u : 0u), 0);
}
static inline uint pio_encode_pull(_Bool if_empty, _Bool block) {
    return _pio_encode_instr_and_args(pio_instr_bits_pull, (if_empty ? 2u : 0u) | (block ? 1u : 0u), 0);
}
static inline uint pio_encode_mov(enum pio_src_dest dest, enum pio_src_dest src) {
    ({if (((0 || 0) && !0)) ((!(dest & 0x80u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 382, __func__, "!(dest & 0x80u)"));});
    ({if (((0 || 0) && !0)) ((!(src & 0x40u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 383, __func__, "!(src & 0x40u)"));});
    return _pio_encode_instr_and_src_dest(pio_instr_bits_mov, dest, src & 7u);
}
static inline uint pio_encode_mov_not(enum pio_src_dest dest, enum pio_src_dest src) {
    ({if (((0 || 0) && !0)) ((!(dest & 0x80u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 398, __func__, "!(dest & 0x80u)"));});
    ({if (((0 || 0) && !0)) ((!(src & 0x40u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 399, __func__, "!(src & 0x40u)"));});
    return _pio_encode_instr_and_src_dest(pio_instr_bits_mov, dest, (1u << 3u) | (src & 7u));
}
static inline uint pio_encode_mov_reverse(enum pio_src_dest dest, enum pio_src_dest src) {
    ({if (((0 || 0) && !0)) ((!(dest & 0x80u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 414, __func__, "!(dest & 0x80u)"));});
    ({if (((0 || 0) && !0)) ((!(src & 0x40u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 415, __func__, "!(src & 0x40u)"));});
    return _pio_encode_instr_and_src_dest(pio_instr_bits_mov, dest, (2u << 3u) | (src & 7u));
}
static inline uint pio_encode_irq_set(_Bool relative, uint irq) {
    return _pio_encode_instr_and_args(pio_instr_bits_irq, 0, _pio_encode_irq(relative, irq));
}
static inline uint pio_encode_irq_wait(_Bool relative, uint irq) {
    return _pio_encode_instr_and_args(pio_instr_bits_irq, 1, _pio_encode_irq(relative, irq));
}
static inline uint pio_encode_irq_clear(_Bool relative, uint irq) {
    return _pio_encode_instr_and_args(pio_instr_bits_irq, 2, _pio_encode_irq(relative, irq));
}
static inline uint pio_encode_set(enum pio_src_dest dest, uint value) {
    ({if (((0 || 0) && !0)) ((!(dest & 0x20u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio_instructions.h", 472, __func__, "!(dest & 0x20u)"));});
    return _pio_encode_instr_and_src_dest(pio_instr_bits_set, dest, value);
}
static inline uint pio_encode_nop(void) {
    return pio_encode_mov(pio_y, pio_y);
}
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_PIO 0
#define PICO_PIO_VERSION 1
#define PICO_PIO_CLKDIV_ROUND_NEAREST PICO_CLKDIV_ROUND_NEAREST
_Static_assert(31u == 30u + 1, "");
enum pio_fifo_join {
    PIO_FIFO_JOIN_NONE = 0,
    PIO_FIFO_JOIN_TX = 1,
    PIO_FIFO_JOIN_RX = 2,
    PIO_FIFO_JOIN_TXGET = 4,
    PIO_FIFO_JOIN_TXPUT = 8,
    PIO_FIFO_JOIN_PUTGET = 12,
};
enum pio_mov_status_type {
    STATUS_TX_LESSTHAN = 0,
    STATUS_RX_LESSTHAN = 1,
    STATUS_IRQ_SET = 2
};
typedef pio_hw_t *PIO;
#define pio0 pio0_hw
#define pio1 pio1_hw
#define pio2 pio2_hw
#define PICO_PIO_USE_GPIO_BASE ((NUM_BANK0_GPIOS) > 32)
_Static_assert(0x50300000u - 0x50200000u == (1u << 20), "hardware layout mismatch");
_Static_assert(0x50400000u - 0x50200000u == (2u << 20), "hardware layout mismatch");
#define PIO_NUM(pio) (((uintptr_t)(pio) - PIO0_BASE) >> 20)
_Static_assert(0x50300000u - 0x50200000u == (1u << 20), "hardware layout mismatch");
_Static_assert(0x50400000u - 0x50200000u == (2u << 20), "hardware layout mismatch");
#define PIO_INSTANCE(instance) ((pio_hw_t *)(PIO0_BASE + (instance) * (1u << 20)))
#define PIO_FUNCSEL_NUM(pio,gpio) ((gpio_function_t) (GPIO_FUNC_PIO0 + PIO_NUM(pio)))
_Static_assert(DREQ_PIO0_TX1 == DREQ_PIO0_TX0 + 1, "");
_Static_assert(DREQ_PIO0_TX2 == DREQ_PIO0_TX0 + 2, "");
_Static_assert(DREQ_PIO0_TX3 == DREQ_PIO0_TX0 + 3, "");
_Static_assert(DREQ_PIO0_RX0 == DREQ_PIO0_TX0 + 4u, "");
_Static_assert(DREQ_PIO1_TX0 == DREQ_PIO0_RX0 + 4u, "");
_Static_assert(DREQ_PIO1_RX0 == DREQ_PIO1_TX0 + 4u, "");
_Static_assert(DREQ_PIO2_TX0 == DREQ_PIO1_RX0 + 4u, "");
_Static_assert(DREQ_PIO2_RX0 == DREQ_PIO2_TX0 + 4u, "");
#define PIO_DREQ_NUM(pio,sm,is_tx) (DREQ_PIO0_TX0 + (sm) + (((is_tx) ? 0 : NUM_PIO_STATE_MACHINES) + PIO_NUM(pio) * (DREQ_PIO1_TX0 - DREQ_PIO0_TX0)))
#define PIO_IRQ_NUM(pio,irqn) (PIO0_IRQ_0 + NUM_PIO_IRQS * PIO_NUM(pio) + (irqn))
typedef struct {
    uint32_t clkdiv;
    uint32_t execctrl;
    uint32_t shiftctrl;
    uint32_t pinctrl;
#define PINHI_ALL_PINCTRL_LSBS ((1u << PIO_SM0_PINCTRL_IN_BASE_LSB) | (1u << PIO_SM0_PINCTRL_OUT_BASE_LSB) | (1u << PIO_SM0_PINCTRL_SET_BASE_LSB) | (1u << PIO_SM0_PINCTRL_SIDESET_BASE_LSB))
#define PINHI_EXECCTRL_LSB 20
_Static_assert( (1u << 20) > (((1u << 15u) | (1u << 0u) | (1u << 5u) | (1u << 10u)) * 0x1f), "");
#define PINHI_ALL_PIN_LSBS ((1u << PINHI_EXECCTRL_LSB) |(1u << PIO_SM0_PINCTRL_IN_BASE_LSB) | (1u << PIO_SM0_PINCTRL_OUT_BASE_LSB) | (1u << PIO_SM0_PINCTRL_SET_BASE_LSB) | (1u << PIO_SM0_PINCTRL_SIDESET_BASE_LSB))
    uint32_t pinhi;
} pio_sm_config;
