gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
static inline void check_sm_param(__attribute__((__unused__)) uint sm) {
    ({if (((0 || 0) && !0)) ((sm < 4u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 313, __func__, "sm < 4u"));});
}
static inline void check_sm_mask(__attribute__((__unused__)) uint mask) {
    ({if (((0 || 0) && !0)) ((mask < (1u << 4u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 317, __func__, "mask < (1u << 4u)"));});
}
static inline void check_pio_param(__attribute__((__unused__)) PIO pio) {
    ({if (((0 || 0) && !0)) ((pio == ((pio_hw_t *)0x50200000u) || pio == ((pio_hw_t *)0x50300000u) || pio == ((pio_hw_t *)0x50400000u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 324, __func__, "pio == ((pio_hw_t *)0x50200000u) || pio == ((pio_hw_t *)0x50300000u) || pio == ((pio_hw_t *)0x50400000u)"));});
}
static inline void check_pio_pin_param(__attribute__((__unused__)) uint pin) {
    ({if (((0 || 0) && !0)) ((!(pin >= ((48u + 15u)&~15u))) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 333, __func__, "!(pin >= ((48u + 15u)&~15u))"));});
}
static inline void sm_config_set_out_pin_base(pio_sm_config *c, uint out_base) {
    check_pio_pin_param(out_base);
    c->pinctrl = (c->pinctrl & ~0x0000001fu) |
                 ((out_base & 31) << 0u);
    c->pinhi = (c->pinhi & ~(31u << 0u)) |
                    ((out_base >> 4) << 0u);
}
static inline void sm_config_set_out_pin_count(pio_sm_config *c, uint out_count) {
    ({if (((0 || 0) && !0)) ((out_count <= 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 364, __func__, "out_count <= 32"));});
    c->pinctrl = (c->pinctrl & ~0x03f00000u) |
                 (out_count << 20u);
}
static inline void sm_config_set_out_pins(pio_sm_config *c, uint out_base, uint out_count) {
    sm_config_set_out_pin_base(c, out_base);
    sm_config_set_out_pin_count(c, out_count);
}
static inline void sm_config_set_set_pin_base(pio_sm_config *c, uint set_base) {
    check_pio_pin_param(set_base);
    c->pinctrl = (c->pinctrl & ~0x000003e0u) |
                 ((set_base & 31) << 5u);
    c->pinhi = (c->pinhi & ~(31u << 5u)) |
                    ((set_base >> 4) << 5u);
}
static inline void sm_config_set_set_pin_count(pio_sm_config *c, uint set_count) {
    ({if (((0 || 0) && !0)) ((set_count <= 5) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 410, __func__, "set_count <= 5"));});
    c->pinctrl = (c->pinctrl & ~0x1c000000u) |
                 (set_count << 26u);
}
static inline void sm_config_set_set_pins(pio_sm_config *c, uint set_base, uint set_count) {
    sm_config_set_set_pin_base(c, set_base);
    sm_config_set_set_pin_count(c, set_count);
}
static inline void sm_config_set_in_pin_base(pio_sm_config *c, uint in_base) {
    check_pio_pin_param(in_base);
    c->pinctrl = (c->pinctrl & ~0x000f8000u) |
                 ((in_base & 31) << 15u);
    c->pinhi = (c->pinhi & ~(31u << 15u)) |
                    ((in_base >> 4) << 15u);
}
static inline void sm_config_set_in_pins(pio_sm_config *c, uint in_base) {
    sm_config_set_in_pin_base(c, in_base);
}
static inline void sm_config_set_in_pin_count(pio_sm_config *c, uint in_count) {
    ({if (((0 || 0) && !0)) ((in_count && in_count <= 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 478, __func__, "in_count && in_count <= 32"));});
    c->shiftctrl = (c->shiftctrl & ~0x0000001fu) |
                   ((in_count & 0x1fu) << 0u);
}
static inline void sm_config_set_sideset_pin_base(pio_sm_config *c, uint sideset_base) {
    check_pio_pin_param(sideset_base);
    c->pinctrl = (c->pinctrl & ~0x00007c00u) |
                 ((sideset_base & 31) << 10u);
    c->pinhi = (c->pinhi & ~(31u << 10u)) |
                    ((sideset_base >> 4) << 10u);
}
static inline void sm_config_set_sideset_pins(pio_sm_config *c, uint sideset_base) {
    sm_config_set_sideset_pin_base(c, sideset_base);
}
static inline void sm_config_set_sideset(pio_sm_config *c, uint bit_count, _Bool optional, _Bool pindirs) {
    ({if (((0 || 0) && !0)) ((bit_count <= 5) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 526, __func__, "bit_count <= 5"));});
    ({if (((0 || 0) && !0)) ((!optional || bit_count >= 1) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 527, __func__, "!optional || bit_count >= 1"));});
    c->pinctrl = (c->pinctrl & ~0xe0000000u) |
                 (bit_count << 29u);
    c->execctrl = (c->execctrl & ~(0x40000000u | 0x20000000u)) |
                  (((uint)!!(optional)) << 30u) |
                  (((uint)!!(pindirs)) << 29u);
}
static inline void sm_config_set_clkdiv_int_frac8(pio_sm_config *c, uint32_t div_int, uint8_t div_frac8) {
    _Static_assert((31u + 1 - 16u) == 16, "");
    ({if (((0 || 0) && !0)) ((!(div_int >> 16)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 550, __func__, "!(div_int >> 16)"));});
    ({if (((0 || 0) && !0)) ((!(div_int == 0 && div_frac8 != 0)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 551, __func__, "!(div_int == 0 && div_frac8 != 0)"));});
    _Static_assert((15u + 1 - 8u) == 8, "");
    c->clkdiv =
            (((uint)div_frac8) << 8u) |
            (((uint)div_int) << 16u);
}
static inline void sm_config_set_clkdiv_int_frac(pio_sm_config *c, uint16_t div_int, uint8_t div_frac8) {
    sm_config_set_clkdiv_int_frac8(c, div_int, div_frac8);
}
static inline void pio_calculate_clkdiv8_from_float(float div, uint32_t *div_int, uint8_t *div_frac8) {
    ({if (((0 || 0) && !0)) ((div >= 1 && div <= 65536) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 564, __func__, "div >= 1 && div <= 65536"));});
    const int frac_bit_count = (15u + 1 - 8u);
    div += 0.5f / (1 << frac_bit_count);
    *div_int = (uint16_t)div;
    _Static_assert((15u + 1 - 8u) == 8, "");
    if (*div_int == 0) {
        *div_frac8 = 0;
    } else {
        *div_frac8 = (uint8_t)((div - (float)*div_int) * (1u << frac_bit_count));
    }
}
static inline void pio_calculate_clkdiv_from_float(float div, uint16_t *div_int16, uint8_t *div_frac8) {
    uint32_t div_int;
    pio_calculate_clkdiv8_from_float(div, &div_int, div_frac8);
    *div_int16 = (uint16_t) div_int;
}
static inline void sm_config_set_clkdiv(pio_sm_config *c, float div) {
    uint32_t div_int;
    uint8_t div_frac8;
    pio_calculate_clkdiv8_from_float(div, &div_int, &div_frac8);
    sm_config_set_clkdiv_int_frac8(c, div_int, div_frac8);
}
static inline void sm_config_set_wrap(pio_sm_config *c, uint wrap_target, uint wrap) {
    ({if (((0 || 0) && !0)) ((wrap < 32u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 618, __func__, "wrap < 32u"));});
    ({if (((0 || 0) && !0)) ((wrap_target < 32u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 619, __func__, "wrap_target < 32u"));});
    c->execctrl = (c->execctrl & ~(0x0001f000u | 0x00000f80u)) |
                  (wrap_target << 7u) |
                  (wrap << 12u);
}
static inline void sm_config_set_jmp_pin(pio_sm_config *c, uint pin) {
    check_pio_pin_param(pin);
    c->execctrl = (c->execctrl & ~0x1f000000u) |
                  ((pin & 31) << 24u);
    c->pinhi = (c->pinhi & ~(31u << 20)) |
               ((pin >> 4) << 20);
}
static inline void sm_config_set_in_shift(pio_sm_config *c, _Bool shift_right, _Bool autopush, uint push_threshold) {
    ({if (((0 || 0) && !0)) ((push_threshold <= 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 650, __func__, "push_threshold <= 32"));});
    c->shiftctrl = (c->shiftctrl &
                    ~(0x00040000u |
                      0x00010000u |
                      0x01f00000u)) |
                   (((uint)!!(shift_right)) << 18u) |
                   (((uint)!!(autopush)) << 16u) |
                   ((push_threshold & 0x1fu) << 20u);
}
static inline void sm_config_set_out_shift(pio_sm_config *c, _Bool shift_right, _Bool autopull, uint pull_threshold) {
    ({if (((0 || 0) && !0)) ((pull_threshold <= 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 669, __func__, "pull_threshold <= 32"));});
    c->shiftctrl = (c->shiftctrl &
                    ~(0x00080000u |
                      0x00020000u |
                      0x3e000000u)) |
                   (((uint)!!(shift_right)) << 19u) |
                   (((uint)!!(autopull)) << 17u) |
                   ((pull_threshold & 0x1fu) << 25u);
}
static inline void sm_config_set_fifo_join(pio_sm_config *c, enum pio_fifo_join join) {
    ({if (((0 || 0) && !0)) ((join == PIO_FIFO_JOIN_NONE || join == PIO_FIFO_JOIN_TX || join == PIO_FIFO_JOIN_RX || join == PIO_FIFO_JOIN_TXPUT || join == PIO_FIFO_JOIN_TXGET || join == PIO_FIFO_JOIN_PUTGET) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 686, __func__, "join == PIO_FIFO_JOIN_NONE || join == PIO_FIFO_JOIN_TX || join == PIO_FIFO_JOIN_RX || join == PIO_FIFO_JOIN_TXPUT || join == PIO_FIFO_JOIN_TXGET || join == PIO_FIFO_JOIN_PUTGET"));});
    c->shiftctrl = (c->shiftctrl & (uint)~(0x40000000u | 0x80000000u |
                                           0x00008000u | 0x00004000u)) |
                   (((uint)(join & 3)) << 30u) |
                   (((uint)(join >> 2)) << 14u);
}
static inline void sm_config_set_out_special(pio_sm_config *c, _Bool sticky, _Bool has_enable_pin, uint enable_bit_index) {
    c->execctrl = (c->execctrl &
                   (uint)~(0x00020000u | 0x00040000u |
                     0x00f80000u)) |
                  (((uint)!!(sticky)) << 17u) |
                  (((uint)!!(has_enable_pin)) << 18u) |
                  ((enable_bit_index << 19u) & 0x00f80000u);
}
static inline void sm_config_set_mov_status(pio_sm_config *c, enum pio_mov_status_type status_sel, uint status_n) {
    ({if (((0 || 0) && !0)) ((status_sel == STATUS_TX_LESSTHAN || status_sel == STATUS_RX_LESSTHAN || status_sel == STATUS_IRQ_SET) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 727, __func__, "status_sel == STATUS_TX_LESSTHAN || status_sel == STATUS_RX_LESSTHAN || status_sel == STATUS_IRQ_SET"));});
    c->execctrl = (c->execctrl
                  & ~(0x00000060u | 0x0000001fu))
                  | ((((uint)status_sel) << 5u) & 0x00000060u)
                  | ((status_n << 0u) & 0x0000001fu);
}
static inline pio_sm_config pio_get_default_sm_config(void) {
    pio_sm_config c = {};
    c.pinhi = -1;
    sm_config_set_clkdiv_int_frac8(&c, 1, 0);
    sm_config_set_wrap(&c, 0, 31);
    sm_config_set_in_shift(&c, 1, 0, 32);
    sm_config_set_out_shift(&c, 1, 0, 32);
    return c;
}
static inline uint pio_get_gpio_base(PIO pio) {
    return pio->gpiobase;
}
static inline void check_pio_pin_mask64(__attribute__((__unused__)) PIO pio, __attribute__((__unused__)) uint sm, __attribute__((__unused__)) uint64_t pinmask) {
    ({if (((0 || 0) && !0)) (((pinmask & ~(0xffffffffull << pio_get_gpio_base(pio))) == 0) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 792, __func__, "(pinmask & ~(0xffffffffull << pio_get_gpio_base(pio))) == 0"));});
}
static inline int pio_sm_set_config(PIO pio, uint sm, const pio_sm_config *config) {
    check_pio_param(pio);
    check_sm_param(sm);
    pio->sm[sm].clkdiv = config->clkdiv;
    pio->sm[sm].shiftctrl = config->shiftctrl;
    uint used = (~config->pinhi >> 4) & ((1u << 20) |(1u << 15u) | (1u << 0u) | (1u << 5u) | (1u << 10u));
    uint gpio_under_16 = (~config->pinhi) & (~config->pinhi >> 1) & used;
    uint gpio_over_32 = (config->pinhi >> 1) & used;
    uint gpio_base = pio_get_gpio_base(pio);
    ({ if (gpio_under_16 && gpio_base) return PICO_ERROR_BAD_ALIGNMENT; });
    ({ if (gpio_over_32 && !gpio_base) return PICO_ERROR_BAD_ALIGNMENT; });
    _Static_assert(20 == 20, "");
    pio->sm[sm].execctrl = config->execctrl ^ (gpio_base ? ((used >> 20) << (24u + 4)) : 0);
    pio->sm[sm].pinctrl = config->pinctrl ^ (gpio_base ? ((used << 12) >> 8) : 0);
    return PICO_OK;
}
static inline uint pio_get_index(PIO pio) {
    check_pio_param(pio);
    return (((uintptr_t)(pio) - 0x50200000u) >> 20);
}
static inline uint pio_get_funcsel(PIO pio) {
    check_pio_param(pio);
    return ((gpio_function_t) (GPIO_FUNC_PIO0 + (((uintptr_t)(pio) - 0x50200000u) >> 20)));
}
static inline PIO pio_get_instance(uint instance) {
    ({if (((0 || 0) && !0)) ((!(instance >= 3u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 866, __func__, "!(instance >= 3u)"));});
    return ((pio_hw_t *)(0x50200000u + (instance) * (1u << 20)));
}
static inline void pio_gpio_init(PIO pio, uint pin) {
    check_pio_param(pio);
    ({if (((0 || 0) && !0)) ((pin < 48u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 900, __func__, "pin < 48u"));});
    gpio_set_function(pin, ((gpio_function_t) (GPIO_FUNC_PIO0 + (((uintptr_t)(pio) - 0x50200000u) >> 20))));
}
static inline uint pio_get_dreq(PIO pio, uint sm, _Bool is_tx) {
    check_pio_param(pio);
    check_sm_param(sm);
    return (DREQ_PIO0_TX0 + (sm) + (((is_tx) ? 0 : 4u) + (((uintptr_t)(pio) - 0x50200000u) >> 20) * (DREQ_PIO1_TX0 - DREQ_PIO0_TX0)));
}
typedef struct pio_program {
    const uint16_t *instructions;
    uint8_t length;
    int8_t origin;
    uint8_t pio_version;
    uint8_t used_gpio_ranges;
} pio_program_t;
int pio_set_gpio_base(PIO pio, uint gpio_base);
_Bool pio_can_add_program(PIO pio, const pio_program_t *program);
_Bool pio_can_add_program_at_offset(PIO pio, const pio_program_t *program, uint offset);
int pio_add_program(PIO pio, const pio_program_t *program);
int pio_add_program_at_offset(PIO pio, const pio_program_t *program, uint offset);
void pio_remove_program(PIO pio, const pio_program_t *program, uint loaded_offset);
void pio_clear_instruction_memory(PIO pio);
int pio_sm_init(PIO pio, uint sm, uint initial_pc, const pio_sm_config *config);
static inline void pio_sm_set_enabled(PIO pio, uint sm, _Bool enabled) {
    check_pio_param(pio);
    check_sm_param(sm);
    pio->ctrl = (pio->ctrl & ~(1u << sm)) | (((uint)!!(enabled)) << sm);
}
static inline void pio_set_sm_mask_enabled(PIO pio, uint32_t mask, _Bool enabled) {
    check_pio_param(pio);
    check_sm_mask(mask);
    pio->ctrl = (pio->ctrl & ~mask) | (enabled ? mask : 0u);
}
static inline void pio_set_sm_multi_mask_enabled(PIO pio, uint32_t mask_prev, uint32_t mask, uint32_t mask_next, _Bool enabled) {
    check_pio_param(pio);
    check_sm_mask(mask);
    pio->ctrl = (pio->ctrl & ~(mask << 0u)) |
                (enabled ? ((mask << 0u) & 0x0000000fu) : 0) |
                (enabled ? 0x01000000u : 0x02000000u) |
                ((mask_prev << 16u) & 0x000f0000u) |
                ((mask_next << 20u) & 0x00f00000u);
}
static inline void pio_sm_restart(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    hw_set_bits(&pio->ctrl, 1u << (4u + sm));
}
static inline void pio_restart_sm_mask(PIO pio, uint32_t mask) {
    check_pio_param(pio);
    check_sm_mask(mask);
    hw_set_bits(&pio->ctrl, (mask << 4u) & 0x000000f0u);
}
static inline void pio_sm_clkdiv_restart(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    hw_set_bits(&pio->ctrl, 1u << (8u + sm));
}
static inline void pio_clkdiv_restart_sm_mask(PIO pio, uint32_t mask) {
    check_pio_param(pio);
    check_sm_mask(mask);
    hw_set_bits(&pio->ctrl, (mask << 8u) & 0x00000f00u);
}
static inline void pio_clkdiv_restart_sm_multi_mask(PIO pio, uint32_t mask_prev, uint32_t mask, uint32_t mask_next) {
    check_pio_param(pio);
    check_sm_mask(mask);
    hw_set_bits(&pio->ctrl, ((mask << 8u) & 0x00000f00u) |
                            0x04000000u |
                            ((mask_prev << 16u) & 0x000f0000u) |
                            ((mask_next << 20u) & 0x00f00000u));
}
static inline void pio_enable_sm_mask_in_sync(PIO pio, uint32_t mask) {
    check_pio_param(pio);
    check_sm_mask(mask);
    hw_set_bits(&pio->ctrl,
        ((mask << 8u) & 0x00000f00u) |
        ((mask << 0u) & 0x0000000fu));
}
static inline void pio_enable_sm_multi_mask_in_sync(PIO pio, uint32_t mask_prev, uint32_t mask, uint32_t mask_next) {
    check_pio_param(pio);
    check_sm_mask(mask);
    check_pio_param(pio);
    check_sm_mask(mask);
    hw_set_bits(&pio->ctrl, ((mask << 8u) & 0x00000f00u) |
                            ((mask << 0u) & 0x0000000fu) |
                            0x04000000u | 0x01000000u |
                            ((mask_prev << 16u) & 0x000f0000u) |
                            ((mask_next << 20u) & 0x00f00000u));
}
typedef enum pio_interrupt_source {
    pis_interrupt0 = 8u,
    pis_interrupt1 = 9u,
    pis_interrupt2 = 10u,
    pis_interrupt3 = 11u,
    pis_interrupt4 = 12u,
    pis_interrupt5 = 13u,
    pis_interrupt6 = 14u,
    pis_interrupt7 = 15u,
    pis_sm0_tx_fifo_not_full = 4u,
    pis_sm1_tx_fifo_not_full = 5u,
    pis_sm2_tx_fifo_not_full = 6u,
    pis_sm3_tx_fifo_not_full = 7u,
    pis_sm0_rx_fifo_not_empty = 0u,
    pis_sm1_rx_fifo_not_empty = 1u,
    pis_sm2_rx_fifo_not_empty = 2u,
    pis_sm3_rx_fifo_not_empty = 3u,
} pio_interrupt_source_t;
