gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
static inline void pio_set_irq0_source_enabled(PIO pio, pio_interrupt_source_t source, _Bool enabled) {
    check_pio_param(pio);
    ({if (((0 || 0) && !0)) ((!(source >= 32u || (1u << source) > 0x0000ffffu)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1302, __func__, "!(source >= 32u || (1u << source) > 0x0000ffffu)"));});
    if (enabled)
        hw_set_bits(&pio->inte0, 1u << source);
    else
        hw_clear_bits(&pio->inte0, 1u << source);
}
static inline void pio_set_irq1_source_enabled(PIO pio, pio_interrupt_source_t source, _Bool enabled) {
    check_pio_param(pio);
    ({if (((0 || 0) && !0)) ((!(source >= 32 || (1u << source) > 0x0000ffffu)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1318, __func__, "!(source >= 32 || (1u << source) > 0x0000ffffu)"));});
    if (enabled)
        hw_set_bits(&pio->inte1, 1u << source);
    else
        hw_clear_bits(&pio->inte1, 1u << source);
}
static inline void pio_set_irq0_source_mask_enabled(PIO pio, uint32_t source_mask, _Bool enabled) {
    check_pio_param(pio);
    ({if (((0 || 0) && !0)) ((!(source_mask > 0x0000ffffu)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1334, __func__, "!(source_mask > 0x0000ffffu)"));});
    if (enabled) {
        hw_set_bits(&pio->inte0, source_mask);
    } else {
        hw_clear_bits(&pio->inte0, source_mask);
    }
}
static inline void pio_set_irq1_source_mask_enabled(PIO pio, uint32_t source_mask, _Bool enabled) {
    check_pio_param(pio);
    ({if (((0 || 0) && !0)) ((!(source_mask > 0x0000ffffu)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1351, __func__, "!(source_mask > 0x0000ffffu)"));});
    if (enabled) {
        hw_set_bits(&pio->inte1, source_mask);
    } else {
        hw_clear_bits(&pio->inte1, source_mask);
    }
}
static inline void pio_set_irqn_source_enabled(PIO pio, uint irq_index, pio_interrupt_source_t source, _Bool enabled) {
    ({if (((0 || 0) && !0)) ((!(irq_index > 2u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1368, __func__, "!(irq_index > 2u)"));});
    ({if (((0 || 0) && !0)) ((!(source >= 32 || (1u << source) > 0x0000ffffu)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1369, __func__, "!(source >= 32 || (1u << source) > 0x0000ffffu)"));});
    if (enabled)
        hw_set_bits(&pio->irq_ctrl[irq_index].inte, 1u << source);
    else
        hw_clear_bits(&pio->irq_ctrl[irq_index].inte, 1u << source);
}
static inline void pio_set_irqn_source_mask_enabled(PIO pio, uint irq_index, uint32_t source_mask, _Bool enabled) {
    ({if (((0 || 0) && !0)) ((!(irq_index > 2u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1385, __func__, "!(irq_index > 2u)"));});
    _Static_assert(2u == 2, "");
    ({if (((0 || 0) && !0)) ((!(source_mask > 0x0000ffffu)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1387, __func__, "!(source_mask > 0x0000ffffu)"));});
    if (enabled) {
        hw_set_bits(&pio->irq_ctrl[irq_index].inte, source_mask);
    } else {
        hw_clear_bits(&pio->irq_ctrl[irq_index].inte, source_mask);
    }
}
static inline _Bool pio_interrupt_get(PIO pio, uint pio_interrupt_num) {
    check_pio_param(pio);
    ({if (((0 || 0) && !0)) ((!(pio_interrupt_num >= 8)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1404, __func__, "!(pio_interrupt_num >= 8)"));});
    return pio->irq & (1u << pio_interrupt_num);
}
static inline void pio_interrupt_clear(PIO pio, uint pio_interrupt_num) {
    check_pio_param(pio);
    ({if (((0 || 0) && !0)) ((!(pio_interrupt_num >= 8)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1416, __func__, "!(pio_interrupt_num >= 8)"));});
    pio->irq = (1u << pio_interrupt_num);
}
static inline uint8_t pio_sm_get_pc(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    return (uint8_t) pio->sm[sm].addr;
}
inline static void pio_sm_exec(PIO pio, uint sm, uint instr) {
    check_pio_param(pio);
    check_sm_param(sm);
    pio->sm[sm].instr = instr;
}
static inline _Bool pio_sm_is_exec_stalled(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    return pio->sm[sm].execctrl & 0x80000000u;
}
static inline void pio_sm_exec_wait_blocking(PIO pio, uint sm, uint instr) {
    check_pio_param(pio);
    check_sm_param(sm);
    pio_sm_exec(pio, sm, instr);
    while (pio_sm_is_exec_stalled(pio, sm)) tight_loop_contents();
}
static inline void pio_sm_set_wrap(PIO pio, uint sm, uint wrap_target, uint wrap) {
    check_pio_param(pio);
    check_sm_param(sm);
    ({if (((0 || 0) && !0)) ((wrap < 32u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1495, __func__, "wrap < 32u"));});
    ({if (((0 || 0) && !0)) ((wrap_target < 32u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1496, __func__, "wrap_target < 32u"));});
    pio->sm[sm].execctrl =
            (pio->sm[sm].execctrl & ~(0x0001f000u | 0x00000f80u)) |
            (wrap_target << 7u) |
            (wrap << 12u);
}
static inline void pio_sm_set_out_pins(PIO pio, uint sm, uint out_base, uint out_count) {
    check_pio_param(pio);
    check_sm_param(sm);
    out_base -= pio_get_gpio_base(pio);
    ({if (((0 || 0) && !0)) ((out_base < 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1519, __func__, "out_base < 32"));});
    ({if (((0 || 0) && !0)) ((out_count <= 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1520, __func__, "out_count <= 32"));});
    pio->sm[sm].pinctrl = (pio->sm[sm].pinctrl & ~(0x0000001fu | 0x03f00000u)) |
                 (out_base << 0u) |
                 (out_count << 20u);
}
static inline void pio_sm_set_set_pins(PIO pio, uint sm, uint set_base, uint set_count) {
    check_pio_param(pio);
    check_sm_param(sm);
    set_base -= pio_get_gpio_base(pio);
    ({if (((0 || 0) && !0)) ((set_base < 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1543, __func__, "set_base < 32"));});
    ({if (((0 || 0) && !0)) ((set_count <= 5) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1544, __func__, "set_count <= 5"));});
    pio->sm[sm].pinctrl = (pio->sm[sm].pinctrl & ~(0x000003e0u | 0x1c000000u)) |
                 (set_base << 5u) |
                 (set_count << 26u);
}
static inline void pio_sm_set_in_pins(PIO pio, uint sm, uint in_base) {
    check_pio_param(pio);
    check_sm_param(sm);
    in_base -= pio_get_gpio_base(pio);
    ({if (((0 || 0) && !0)) ((in_base < 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1565, __func__, "in_base < 32"));});
    pio->sm[sm].pinctrl = (pio->sm[sm].pinctrl & ~0x000f8000u) |
                 (in_base << 15u);
}
static inline void pio_sm_set_sideset_pins(PIO pio, uint sm, uint sideset_base) {
    check_pio_param(pio);
    check_sm_param(sm);
    sideset_base -= pio_get_gpio_base(pio);
    ({if (((0 || 0) && !0)) ((sideset_base < 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1585, __func__, "sideset_base < 32"));});
    pio->sm[sm].pinctrl = (pio->sm[sm].pinctrl & ~0x00007c00u) |
                 (sideset_base << 10u);
}
static inline void pio_sm_set_jmp_pin(PIO pio, uint sm, uint pin) {
    check_pio_param(pio);
    check_sm_param(sm);
    pin -= pio_get_gpio_base(pio);
    ({if (((0 || 0) && !0)) ((pin < 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1604, __func__, "pin < 32"));});
    pio->sm[sm].execctrl =
        (pio->sm[sm].execctrl & ~0x1f000000u)
        | (pin << 24u);
}
static inline void pio_sm_put(PIO pio, uint sm, uint32_t data) {
    check_pio_param(pio);
    check_sm_param(sm);
    pio->txf[sm] = data;
}
static inline uint32_t pio_sm_get(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    return pio->rxf[sm];
}
static inline _Bool pio_sm_is_rx_fifo_full(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    return (pio->fstat & (1u << (0u + sm))) != 0;
}
static inline _Bool pio_sm_is_rx_fifo_empty(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    return (pio->fstat & (1u << (8u + sm))) != 0;
}
static inline uint pio_sm_get_rx_fifo_level(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    uint bitoffs = 4u + sm * (12u - 4u);
    const uint32_t mask = 0x000000f0u >> 4u;
    return (pio->flevel >> bitoffs) & mask;
}
static inline _Bool pio_sm_is_tx_fifo_full(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    return (pio->fstat & (1u << (16u + sm))) != 0;
}
static inline _Bool pio_sm_is_tx_fifo_empty(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    return (pio->fstat & (1u << (24u + sm))) != 0;
}
static inline uint pio_sm_get_tx_fifo_level(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    unsigned int bitoffs = 0u + sm * (8u - 0u);
    const uint32_t mask = 0x0000000fu >> 0u;
    return (pio->flevel >> bitoffs) & mask;
}
static inline void pio_sm_put_blocking(PIO pio, uint sm, uint32_t data) {
    check_pio_param(pio);
    check_sm_param(sm);
    while (pio_sm_is_tx_fifo_full(pio, sm)) tight_loop_contents();
    pio_sm_put(pio, sm, data);
}
static inline uint32_t pio_sm_get_blocking(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    while (pio_sm_is_rx_fifo_empty(pio, sm)) tight_loop_contents();
    return pio_sm_get(pio, sm);
}
void pio_sm_drain_tx_fifo(PIO pio, uint sm);
static inline void pio_sm_set_clkdiv_int_frac8(PIO pio, uint sm, uint32_t div_int, uint8_t div_frac8) {
    check_pio_param(pio);
    check_sm_param(sm);
    _Static_assert((31u + 1 - 16u) == 16, "");
    ({if (((0 || 0) && !0)) ((!(div_int >> 16)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1787, __func__, "!(div_int >> 16)"));});
    ({if (((0 || 0) && !0)) ((!(div_int == 0 && div_frac8 != 0)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 1788, __func__, "!(div_int == 0 && div_frac8 != 0)"));});
    _Static_assert((15u + 1 - 8u) == 8, "");
    pio->sm[sm].clkdiv =
            (((uint)div_frac8) << 8u) |
            (((uint)div_int) << 16u);
}
static inline void pio_sm_set_clkdiv_int_frac(PIO pio, uint sm, uint16_t div_int, uint8_t div_frac8) {
    pio_sm_set_clkdiv_int_frac8(pio, sm, div_int, div_frac8);
}
static inline void pio_sm_set_clkdiv(PIO pio, uint sm, float div) {
    check_pio_param(pio);
    check_sm_param(sm);
    uint32_t div_int;
    uint8_t div_frac8;
    pio_calculate_clkdiv8_from_float(div, &div_int, &div_frac8);
    pio_sm_set_clkdiv_int_frac8(pio, sm, div_int, div_frac8);
}
static inline void pio_sm_clear_fifos(PIO pio, uint sm) {
    check_pio_param(pio);
    check_sm_param(sm);
    hw_xor_bits(&pio->sm[sm].shiftctrl, 0x80000000u);
    hw_xor_bits(&pio->sm[sm].shiftctrl, 0x80000000u);
}
void pio_sm_set_pins(PIO pio, uint sm, uint32_t pin_values);
void pio_sm_set_pins64(PIO pio, uint sm, uint64_t pin_values);
void pio_sm_set_pins_with_mask(PIO pio, uint sm, uint32_t pin_values, uint32_t pin_mask);
void pio_sm_set_pins_with_mask64(PIO pio, uint sm, uint64_t pin_values, uint64_t pin_mask);
void pio_sm_set_pindirs_with_mask(PIO pio, uint sm, uint32_t pin_dirs, uint32_t pin_mask);
void pio_sm_set_pindirs_with_mask64(PIO pio, uint sm, uint64_t pin_dirs, uint64_t pin_mask);
int pio_sm_set_consecutive_pindirs(PIO pio, uint sm, uint pins_base, uint pin_count, _Bool is_out);
void pio_sm_claim(PIO pio, uint sm);
void pio_claim_sm_mask(PIO pio, uint sm_mask);
void pio_sm_unclaim(PIO pio, uint sm);
int pio_claim_unused_sm(PIO pio, _Bool required);
_Bool pio_sm_is_claimed(PIO pio, uint sm);
_Bool pio_claim_free_sm_and_add_program(const pio_program_t *program, PIO *pio, uint *sm, uint *offset);
_Bool pio_claim_free_sm_and_add_program_for_gpio_range(const pio_program_t *program, PIO *pio, uint *sm, uint *offset, uint gpio_base, uint gpio_count, _Bool set_gpio_base);
void pio_remove_program_and_unclaim_sm(const pio_program_t *program, PIO pio, uint sm, uint offset);
static inline int pio_get_irq_num(PIO pio, uint irqn) {
    check_pio_param(pio);
    ({if (((0 || 0) && !0)) ((irqn < 2u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pio/include/hardware/pio.h", 2049, __func__, "irqn < 2u"));});
    return (PIO0_IRQ_0 + 2u * (((uintptr_t)(pio) - 0x50200000u) >> 20) + (irqn));
}
static inline pio_interrupt_source_t pio_get_tx_fifo_not_full_interrupt_source(uint sm) {
    check_sm_param(sm);
    return ((pio_interrupt_source_t)(pis_sm0_tx_fifo_not_full + sm));
}
static inline pio_interrupt_source_t pio_get_rx_fifo_not_empty_interrupt_source(uint sm) {
    check_sm_param(sm);
    return ((pio_interrupt_source_t)(pis_sm0_rx_fifo_not_empty + sm));
}
#define _HARDWARE_PLL_H 
#define _HARDWARE_STRUCTS_PLL_H 
#define _HARDWARE_REGS_PLL_H 
#define PLL_CS_OFFSET 0x00000000u
#define PLL_CS_BITS 0xc000013fu
#define PLL_CS_RESET 0x00000001u
#define PLL_CS_LOCK_RESET 0x0u
#define PLL_CS_LOCK_BITS 0x80000000u
#define PLL_CS_LOCK_MSB 31u
#define PLL_CS_LOCK_LSB 31u
#define PLL_CS_LOCK_ACCESS "RO"
#define PLL_CS_LOCK_N_RESET 0x0u
#define PLL_CS_LOCK_N_BITS 0x40000000u
#define PLL_CS_LOCK_N_MSB 30u
#define PLL_CS_LOCK_N_LSB 30u
#define PLL_CS_LOCK_N_ACCESS "WC"
#define PLL_CS_BYPASS_RESET 0x0u
#define PLL_CS_BYPASS_BITS 0x00000100u
#define PLL_CS_BYPASS_MSB 8u
#define PLL_CS_BYPASS_LSB 8u
#define PLL_CS_BYPASS_ACCESS "RW"
#define PLL_CS_REFDIV_RESET 0x01u
#define PLL_CS_REFDIV_BITS 0x0000003fu
#define PLL_CS_REFDIV_MSB 5u
#define PLL_CS_REFDIV_LSB 0u
#define PLL_CS_REFDIV_ACCESS "RW"
#define PLL_PWR_OFFSET 0x00000004u
#define PLL_PWR_BITS 0x0000002du
#define PLL_PWR_RESET 0x0000002du
#define PLL_PWR_VCOPD_RESET 0x1u
#define PLL_PWR_VCOPD_BITS 0x00000020u
#define PLL_PWR_VCOPD_MSB 5u
#define PLL_PWR_VCOPD_LSB 5u
#define PLL_PWR_VCOPD_ACCESS "RW"
#define PLL_PWR_POSTDIVPD_RESET 0x1u
#define PLL_PWR_POSTDIVPD_BITS 0x00000008u
#define PLL_PWR_POSTDIVPD_MSB 3u
#define PLL_PWR_POSTDIVPD_LSB 3u
#define PLL_PWR_POSTDIVPD_ACCESS "RW"
#define PLL_PWR_DSMPD_RESET 0x1u
#define PLL_PWR_DSMPD_BITS 0x00000004u
#define PLL_PWR_DSMPD_MSB 2u
#define PLL_PWR_DSMPD_LSB 2u
#define PLL_PWR_DSMPD_ACCESS "RW"
#define PLL_PWR_PD_RESET 0x1u
#define PLL_PWR_PD_BITS 0x00000001u
#define PLL_PWR_PD_MSB 0u
#define PLL_PWR_PD_LSB 0u
#define PLL_PWR_PD_ACCESS "RW"
#define PLL_FBDIV_INT_OFFSET 0x00000008u
#define PLL_FBDIV_INT_BITS 0x00000fffu
#define PLL_FBDIV_INT_RESET 0x00000000u
#define PLL_FBDIV_INT_MSB 11u
#define PLL_FBDIV_INT_LSB 0u
#define PLL_FBDIV_INT_ACCESS "RW"
#define PLL_PRIM_OFFSET 0x0000000cu
#define PLL_PRIM_BITS 0x00077000u
#define PLL_PRIM_RESET 0x00077000u
#define PLL_PRIM_POSTDIV1_RESET 0x7u
#define PLL_PRIM_POSTDIV1_BITS 0x00070000u
#define PLL_PRIM_POSTDIV1_MSB 18u
#define PLL_PRIM_POSTDIV1_LSB 16u
#define PLL_PRIM_POSTDIV1_ACCESS "RW"
#define PLL_PRIM_POSTDIV2_RESET 0x7u
#define PLL_PRIM_POSTDIV2_BITS 0x00007000u
#define PLL_PRIM_POSTDIV2_MSB 14u
#define PLL_PRIM_POSTDIV2_LSB 12u
#define PLL_PRIM_POSTDIV2_ACCESS "RW"
#define PLL_INTR_OFFSET 0x00000010u
#define PLL_INTR_BITS 0x00000001u
#define PLL_INTR_RESET 0x00000000u
#define PLL_INTR_LOCK_N_STICKY_RESET 0x0u
#define PLL_INTR_LOCK_N_STICKY_BITS 0x00000001u
#define PLL_INTR_LOCK_N_STICKY_MSB 0u
#define PLL_INTR_LOCK_N_STICKY_LSB 0u
#define PLL_INTR_LOCK_N_STICKY_ACCESS "WC"
#define PLL_INTE_OFFSET 0x00000014u
#define PLL_INTE_BITS 0x00000001u
#define PLL_INTE_RESET 0x00000000u
#define PLL_INTE_LOCK_N_STICKY_RESET 0x0u
#define PLL_INTE_LOCK_N_STICKY_BITS 0x00000001u
#define PLL_INTE_LOCK_N_STICKY_MSB 0u
#define PLL_INTE_LOCK_N_STICKY_LSB 0u
#define PLL_INTE_LOCK_N_STICKY_ACCESS "RW"
#define PLL_INTF_OFFSET 0x00000018u
#define PLL_INTF_BITS 0x00000001u
#define PLL_INTF_RESET 0x00000000u
#define PLL_INTF_LOCK_N_STICKY_RESET 0x0u
#define PLL_INTF_LOCK_N_STICKY_BITS 0x00000001u
#define PLL_INTF_LOCK_N_STICKY_MSB 0u
#define PLL_INTF_LOCK_N_STICKY_LSB 0u
#define PLL_INTF_LOCK_N_STICKY_ACCESS "RW"
#define PLL_INTS_OFFSET 0x0000001cu
#define PLL_INTS_BITS 0x00000001u
#define PLL_INTS_RESET 0x00000000u
#define PLL_INTS_LOCK_N_STICKY_RESET 0x0u
#define PLL_INTS_LOCK_N_STICKY_BITS 0x00000001u
#define PLL_INTS_LOCK_N_STICKY_MSB 0u
#define PLL_INTS_LOCK_N_STICKY_LSB 0u
#define PLL_INTS_LOCK_N_STICKY_ACCESS "RO"
typedef struct {
   
    io_rw_32 cs;
   
