gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
    io_rw_32 ctr;
   
    io_rw_32 cc;
   
    io_rw_32 top;
} pwm_slice_hw_t;
typedef struct {
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
} pwm_irq_ctrl_hw_t;
typedef struct {
    pwm_slice_hw_t slice[12];
   
    io_rw_32 en;
   
    io_rw_32 intr;
    union {
        struct {
           
            io_rw_32 inte;
           
            io_rw_32 intf;
           
            io_rw_32 ints;
           
            io_rw_32 inte1;
           
            io_rw_32 intf1;
           
            io_rw_32 ints1;
        };
        pwm_irq_ctrl_hw_t irq_ctrl[2];
    };
} pwm_hw_t;
#define pwm_hw ((pwm_hw_t *)PWM_BASE)
_Static_assert(sizeof (pwm_hw_t) == 0x0110, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_PWM 0
enum pwm_clkdiv_mode
{
    PWM_DIV_FREE_RUNNING = 0,
    PWM_DIV_B_HIGH = 1,
    PWM_DIV_B_RISING = 2,
    PWM_DIV_B_FALLING = 3
};
enum pwm_chan
{
    PWM_CHAN_A = 0,
    PWM_CHAN_B = 1
};
typedef struct {
    uint32_t csr;
    uint32_t div;
    uint32_t top;
} pwm_config;
_Static_assert(DREQ_PWM_WRAP1 == DREQ_PWM_WRAP0 + 1, "");
_Static_assert(DREQ_PWM_WRAP7 == DREQ_PWM_WRAP0 + 7, "");
#define PWM_DREQ_NUM(slice_num) (DREQ_PWM_WRAP0 + (slice_num))
#define PWM_GPIO_SLICE_NUM(gpio) ({ uint slice_num; if ((gpio) < 32) { slice_num = ((gpio) >> 1u) & 7u; } else { slice_num = 8u + (((gpio) >> 1u) & 3u); } slice_num; })
#define PICO_PWM_CLKDIV_ROUND_NEAREST PICO_CLKDIV_ROUND_NEAREST
static inline void check_slice_num_param(__attribute__((__unused__)) uint slice_num) {
    ({if (((0 || 0) && !0)) ((slice_num < 12u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 112, __func__, "slice_num < 12u"));});
}
static inline uint pwm_gpio_to_slice_num(uint gpio) {
    ({if (((0 || 0) && !0)) ((gpio < 48u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 121, __func__, "gpio < 48u"));});
    return ({ uint slice_num; if ((gpio) < 32) { slice_num = ((gpio) >> 1u) & 7u; } else { slice_num = 8u + (((gpio) >> 1u) & 3u); } slice_num; });
}
static inline uint pwm_gpio_to_channel(uint gpio) {
    ({if (((0 || 0) && !0)) ((gpio < 48u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 133, __func__, "gpio < 48u"));});
    return gpio & 1u;
}
static inline void pwm_config_set_phase_correct(pwm_config *c, _Bool phase_correct) {
    c->csr = (c->csr & ~0x00000002u)
        | (((uint)!!(phase_correct)) << 1u);
}
static inline void pwm_config_set_clkdiv(pwm_config *c, float div) {
    ({if (((0 || 0) && !0)) ((div >= 1.f && div < 256.f) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 162, __func__, "div >= 1.f && div < 256.f"));});
    const int frac_bit_count = (3u + 1 - 0u);
    div += 0.5f / (1 << frac_bit_count);
    c->div = (uint32_t)(div * (float)(1u << frac_bit_count));
}
static inline void pwm_config_set_clkdiv_int_frac4(pwm_config *c, uint32_t div_int, uint8_t div_frac4) {
    _Static_assert((11u + 1 - 4u) == 8, "");
    ({if (((0 || 0) && !0)) ((div_int >= 1 && div_int < 256) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 183, __func__, "div_int >= 1 && div_int < 256"));});
    _Static_assert((3u + 1 - 0u) == 4, "");
    ({if (((0 || 0) && !0)) ((div_frac4 < 16) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 185, __func__, "div_frac4 < 16"));});
    c->div = (((uint)div_int) << 4u) | (((uint)div_frac4) << 0u);
}
static inline void pwm_config_set_clkdiv_int_frac(pwm_config *c, uint8_t div_int, uint8_t div_frac4) {
    pwm_config_set_clkdiv_int_frac4(c, div_int, div_frac4);
}
static inline void pwm_config_set_clkdiv_int(pwm_config *c, uint32_t div_int) {
    pwm_config_set_clkdiv_int_frac4(c, div_int, 0);
}
static inline void pwm_config_set_clkdiv_mode(pwm_config *c, enum pwm_clkdiv_mode mode) {
    ({if (((0 || 0) && !0)) ((mode == PWM_DIV_FREE_RUNNING || mode == PWM_DIV_B_RISING || mode == PWM_DIV_B_HIGH || mode == PWM_DIV_B_FALLING) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 219, __func__, "mode == PWM_DIV_FREE_RUNNING || mode == PWM_DIV_B_RISING || mode == PWM_DIV_B_HIGH || mode == PWM_DIV_B_FALLING"));});
    c->csr = (c->csr & ~0x00000030u)
        | (((uint)mode) << 4u);
}
static inline void pwm_config_set_output_polarity(pwm_config *c, _Bool a, _Bool b) {
    c->csr = (c->csr & ~(0x00000004u | 0x00000008u))
        | ((((uint)!!(a)) << 2u) | (((uint)!!(b)) << 3u));
}
static inline void pwm_config_set_wrap(pwm_config *c, uint16_t wrap) {
    c->top = wrap;
}
static inline void pwm_init(uint slice_num, pwm_config *c, _Bool start) {
    check_slice_num_param(slice_num);
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr = 0;
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].ctr = 0x00000000u;
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].cc = 0x00000000u;
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].top = c->top;
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].div = c->div;
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr = c->csr | (((uint)!!(start)) << 0u);
}
static inline pwm_config pwm_get_default_config(void) {
    pwm_config c = {0, 0, 0};
    pwm_config_set_phase_correct(&c, 0);
    pwm_config_set_clkdiv_int(&c, 1);
    pwm_config_set_clkdiv_mode(&c, PWM_DIV_FREE_RUNNING);
    pwm_config_set_output_polarity(&c, 0, 0);
    pwm_config_set_wrap(&c, 0xffffu);
    return c;
}
static inline void pwm_set_wrap(uint slice_num, uint16_t wrap) {
    check_slice_num_param(slice_num);
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].top = wrap;
}
static inline void pwm_set_chan_level(uint slice_num, uint chan, uint16_t level) {
    check_slice_num_param(slice_num);
    hw_write_masked(
        &((pwm_hw_t *)0x400a8000u)->slice[slice_num].cc,
        ((uint)level) << (chan ? 16u : 0u),
        chan ? 0xffff0000u : 0x0000ffffu
    );
}
static inline void pwm_set_both_levels(uint slice_num, uint16_t level_a, uint16_t level_b) {
    check_slice_num_param(slice_num);
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].cc = (((uint)level_b) << 16u) | (((uint)level_a) << 0u);
}
static inline void pwm_set_gpio_level(uint gpio, uint16_t level) {
    ({if (((0 || 0) && !0)) ((gpio < 48u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 374, __func__, "gpio < 48u"));});
    pwm_set_chan_level(pwm_gpio_to_slice_num(gpio), pwm_gpio_to_channel(gpio), level);
}
static inline uint16_t pwm_get_counter(uint slice_num) {
    check_slice_num_param(slice_num);
    return (uint16_t)(((pwm_hw_t *)0x400a8000u)->slice[slice_num].ctr);
}
static inline void pwm_set_counter(uint slice_num, uint16_t c) {
    check_slice_num_param(slice_num);
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].ctr = c;
}
static inline void pwm_advance_count(uint slice_num) {
    check_slice_num_param(slice_num);
    hw_set_bits(&((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr, 0x00000080u);
    while (((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr & 0x00000080u) {
        tight_loop_contents();
    }
}
static inline void pwm_retard_count(uint slice_num) {
    check_slice_num_param(slice_num);
    hw_set_bits(&((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr, 0x00000040u);
    while (((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr & 0x00000040u) {
        tight_loop_contents();
    }
}
static inline void pwm_set_clkdiv_int_frac4(uint slice_num, uint8_t div_int, uint8_t div_frac4) {
    check_slice_num_param(slice_num);
    ({if (((0 || 0) && !0)) ((div_int >= 1) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 450, __func__, "div_int >= 1"));});
    _Static_assert((3u + 1 - 0u) == 4, "");
    ({if (((0 || 0) && !0)) ((div_frac4 < 16) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 452, __func__, "div_frac4 < 16"));});
    ((pwm_hw_t *)0x400a8000u)->slice[slice_num].div = (((uint)div_int) << 4u) | (((uint)div_frac4) << 0u);
}
static inline void pwm_set_clkdiv_int_frac(uint slice_num, uint8_t div_int, uint8_t div_frac4) {
    pwm_set_clkdiv_int_frac4(slice_num, div_int, div_frac4);
}
static inline void pwm_set_clkdiv(uint slice_num, float divider) {
    check_slice_num_param(slice_num);
    ({if (((0 || 0) && !0)) ((divider >= 1.f && divider < 256.f) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 471, __func__, "divider >= 1.f && divider < 256.f"));});
    uint8_t i = (uint8_t)divider;
    uint8_t f = (uint8_t)((divider - i) * (0x01 << 4));
    pwm_set_clkdiv_int_frac4(slice_num, i, f);
}
static inline void pwm_set_output_polarity(uint slice_num, _Bool a, _Bool b) {
    check_slice_num_param(slice_num);
    hw_write_masked(&((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr, ((uint)!!(a)) << 2u | ((uint)!!(b)) << 3u,
                     0x00000004u | 0x00000008u);
}
static inline void pwm_set_clkdiv_mode(uint slice_num, enum pwm_clkdiv_mode mode) {
    check_slice_num_param(slice_num);
    ({if (((0 || 0) && !0)) ((mode == PWM_DIV_FREE_RUNNING || mode == PWM_DIV_B_RISING || mode == PWM_DIV_B_HIGH || mode == PWM_DIV_B_FALLING) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 499, __func__, "mode == PWM_DIV_FREE_RUNNING || mode == PWM_DIV_B_RISING || mode == PWM_DIV_B_HIGH || mode == PWM_DIV_B_FALLING"));});
    hw_write_masked(&((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr, ((uint)mode) << 4u, 0x00000030u);
}
static inline void pwm_set_phase_correct(uint slice_num, _Bool phase_correct) {
    check_slice_num_param(slice_num);
    hw_write_masked(&((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr, ((uint)!!(phase_correct)) << 1u, 0x00000002u);
}
static inline void pwm_set_enabled(uint slice_num, _Bool enabled) {
    check_slice_num_param(slice_num);
    hw_write_masked(&((pwm_hw_t *)0x400a8000u)->slice[slice_num].csr, ((uint)!!(enabled)) << 0u, 0x00000001u);
}
static inline void pwm_set_mask_enabled(uint32_t mask) {
    ((pwm_hw_t *)0x400a8000u)->en = mask;
}
#define PWM_DEFAULT_IRQ_NUM() PWM_IRQ_WRAP_0
#define PWM_IRQ_WRAP PWM_IRQ_WRAP_0
#define isr_pwm_wrap isr_pwm_wrap_0
static inline void pwm_set_irq_enabled(uint slice_num, _Bool enabled) {
    check_slice_num_param(slice_num);
    if (enabled) {
        hw_set_bits(&((pwm_hw_t *)0x400a8000u)->inte, 1u << slice_num);
    } else {
        hw_clear_bits(&((pwm_hw_t *)0x400a8000u)->inte, 1u << slice_num);
    }
}
static inline void pwm_set_irq0_enabled(uint slice_num, _Bool enabled) {
    pwm_set_irq_enabled(slice_num, enabled);
}
static inline void pwm_set_irq1_enabled(uint slice_num, _Bool enabled) {
    check_slice_num_param(slice_num);
    if (enabled) {
        hw_set_bits(&((pwm_hw_t *)0x400a8000u)->inte1, 1u << slice_num);
    } else {
        hw_clear_bits(&((pwm_hw_t *)0x400a8000u)->inte1, 1u << slice_num);
    }
}
static inline void pwm_irqn_set_slice_enabled(uint irq_index, uint slice_num, _Bool enabled) {
    check_slice_num_param(slice_num);
    ({if (((0 || 0) && !0)) ((!(irq_index >= 2u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 651, __func__, "!(irq_index >= 2u)"));});
    check_slice_num_param(slice_num);
    if (enabled) {
        hw_set_bits(&((pwm_hw_t *)0x400a8000u)->irq_ctrl[irq_index].inte, 1u << slice_num);
    } else {
        hw_clear_bits(&((pwm_hw_t *)0x400a8000u)->irq_ctrl[irq_index].inte, 1u << slice_num);
    }
}
static inline void pwm_set_irq_mask_enabled(uint32_t slice_mask, _Bool enabled) {
    ({if (((0 || 0) && !0)) ((slice_mask < 256) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 671, __func__, "slice_mask < 256"));});
    _Static_assert(PWM_IRQ_WRAP_1 == PWM_IRQ_WRAP_0 + 1, "");
    uint irq_index = PWM_IRQ_WRAP_0 - PWM_IRQ_WRAP_0;
    if (enabled) {
        hw_set_bits(&((pwm_hw_t *)0x400a8000u)->irq_ctrl[irq_index].inte, slice_mask);
    } else {
        hw_clear_bits(&((pwm_hw_t *)0x400a8000u)->irq_ctrl[irq_index].inte, slice_mask);
    }
}
static inline void pwm_set_irq0_mask_enabled(uint32_t slice_mask, _Bool enabled) {
    pwm_set_irq_mask_enabled(slice_mask, enabled);
}
static inline void pwm_set_irq1_mask_enabled(uint32_t slice_mask, _Bool enabled) {
    if (enabled) {
        hw_set_bits(&((pwm_hw_t *)0x400a8000u)->inte1, slice_mask);
    } else {
        hw_clear_bits(&((pwm_hw_t *)0x400a8000u)->inte1, slice_mask);
    }
}
static inline void pwm_irqn_set_slice_mask_enabled(uint irq_index, uint slice_mask, _Bool enabled) {
    ({if (((0 || 0) && !0)) ((!(irq_index >= 2u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 732, __func__, "!(irq_index >= 2u)"));});
    if (enabled) {
        hw_set_bits(&((pwm_hw_t *)0x400a8000u)->irq_ctrl[irq_index].inte, slice_mask);
    } else {
        hw_clear_bits(&((pwm_hw_t *)0x400a8000u)->irq_ctrl[irq_index].inte, slice_mask);
    }
}
static inline void pwm_clear_irq(uint slice_num) {
    ((pwm_hw_t *)0x400a8000u)->intr = 1u << slice_num;
}
static inline uint32_t pwm_get_irq_status_mask(void) {
    return ((pwm_hw_t *)0x400a8000u)->ints;
}
static inline uint32_t pwm_get_irq0_status_mask(void) {
    return pwm_get_irq_status_mask();
}
static inline uint32_t pwm_get_irq1_status_mask(void) {
    return ((pwm_hw_t *)0x400a8000u)->ints1;
}
static inline uint32_t pwm_irqn_get_status_mask(uint irq_index) {
    ({if (((0 || 0) && !0)) ((!(irq_index >= 2u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 785, __func__, "!(irq_index >= 2u)"));});
    return ((pwm_hw_t *)0x400a8000u)->irq_ctrl[irq_index].ints;
}
static inline void pwm_force_irq(uint slice_num) {
    ((pwm_hw_t *)0x400a8000u)->intf = 1u << slice_num;
}
static inline void pwm_force_irq0(uint slice_num) {
    pwm_force_irq(slice_num);
}
static inline void pwm_force_irq1(uint slice_num) {
    ((pwm_hw_t *)0x400a8000u)->intf1 = 1u << slice_num;
}
static inline void pwm_irqn_force(uint irq_index, uint slice_num) {
    ({if (((0 || 0) && !0)) ((!(irq_index >= 2u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_pwm/include/hardware/pwm.h", 825, __func__, "!(irq_index >= 2u)"));});
    ((pwm_hw_t *)0x400a8000u)->irq_ctrl[irq_index].intf = 1u << slice_num;
}
static inline uint pwm_get_dreq(uint slice_num) {
    check_slice_num_param(slice_num);
    return (DREQ_PWM_WRAP0 + (slice_num));
}
#define _PICO_RCP_H 
#define rcp_is_true(x) ((x) == RCP_MASK_TRUE)
#define RCP_MASK_TRUE 0xa500a500u
#define RCP_MASK_FALSE 0x00c300c3u
#define RCP_MASK_INTXOR 0x96009600u
#define __rcpinline __force_inline
#define rcp_asm pico_default_asm_volatile
static __inline__ __attribute__((__always_inline__)) void rcp_salt_core0(uint64_t salt) {
    __asm volatile (".syntax unified\n" "mcrr p7, #8, %0, %1, c0\n" : : "r" (salt & 0xffffffffu), "r" (salt >> 32));
}
static __inline__ __attribute__((__always_inline__)) void rcp_salt_core0_nodelay(uint64_t salt) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #8, %0, %1, c0\n" : : "r" (salt & 0xffffffffu), "r" (salt >> 32));
}
static __inline__ __attribute__((__always_inline__)) void rcp_salt_core1(uint64_t salt) {
    __asm volatile (".syntax unified\n" "mcrr p7, #8, %0, %1, c1\n" : : "r" (salt & 0xffffffffu), "r" (salt >> 32));
}
static __inline__ __attribute__((__always_inline__)) void rcp_salt_core1_nodelay(uint64_t salt) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #8, %0, %1, c1\n" : : "r" (salt & 0xffffffffu), "r" (salt >> 32));
}
#define rcp_canary_get(tag) ({ static_assert(!((tag) & ~0xffu), "Tag out of range"); uint32_t __canary_u32; rcp_asm ( "mrc p7, #0, %0, c%c1, c%c2, #1\n" : "=r" (__canary_u32) : "i" ((tag >> 4) & 0xf), "i" (tag & 0xf) ); __canary_u32; })
#define rcp_canary_get_nodelay(tag) ({ static_assert(!((tag) & ~0xffu), "Tag out of range"); uint32_t __canary_u32; rcp_asm ( "mrc2 p7, #0, %0, c%c1, c%c2, #1\n" : "=r" (__canary_u32) : "i" (((tag) >> 4) & 0xf), "i" ((tag) & 0xf) ); __canary_u32; })
#define rcp_canary_check(tag,canary) ({ static_assert(!((tag) & ~0xffu), "Tag out of range"); rcp_asm ( "mcr p7, #0, %0, c%c1, c%c2, #1\n" : : "r" (canary), "i" (((tag) >> 4) & 0xf), "i" ((tag) & 0xf) ); })
#define rcp_canary_check_nodelay(tag,canary) ({ static_assert(!((tag) & ~0xffu), "Tag out of range"); rcp_asm ( "mcr2 p7, #0, %0, c%c1, c%c2, #1\n" : : "r" (canary), "i" (((tag) >> 4) & 0xf), "i" ((tag) & 0xf) ); })
static __inline__ __attribute__((__always_inline__)) uint32_t rcp_canary_status(void) {
    uint32_t ret;
    __asm volatile (".syntax unified\n" "mrc p7, #1, %0, c0, c0, #0\n" : "=r" (ret));
    return ret;
}
static __inline__ __attribute__((__always_inline__)) uint32_t rcp_canary_status_nodelay(void) {
    uint32_t ret;
    __asm volatile (".syntax unified\n" "mrc2 p7, #1, %0, c0, c0, #0\n" : "=r" (ret));
    return ret;
}
static __inline__ __attribute__((__always_inline__)) void rcp_bvalid(uint32_t b) {
    __asm volatile (".syntax unified\n" "mcr p7, #1, %0, c0, c0, #0\n" : : "r" (b));
}
static __inline__ __attribute__((__always_inline__)) void rcp_bvalid_nodelay(uint32_t b) {
    __asm volatile (".syntax unified\n" "mcr2 p7, #1, %0, c0, c0, #0\n" : : "r" (b));
}
static __inline__ __attribute__((__always_inline__)) void rcp_btrue(uint32_t b) {
    __asm volatile (".syntax unified\n" "mcr p7, #2, %0, c0, c0, #0\n" : : "r" (b));
}
static __inline__ __attribute__((__always_inline__)) void rcp_btrue_nodelay(uint32_t b) {
    __asm volatile (".syntax unified\n" "mcr2 p7, #2, %0, c0, c0, #0\n" : : "r" (b));
}
static __inline__ __attribute__((__always_inline__)) void rcp_bfalse(uint32_t b) {
    __asm volatile (".syntax unified\n" "mcr p7, #3, %0, c0, c0, #1\n" : : "r" (b));
}
static __inline__ __attribute__((__always_inline__)) void rcp_bfalse_nodelay(uint32_t b) {
    __asm volatile (".syntax unified\n" "mcr2 p7, #3, %0, c0, c0, #1\n" : : "r" (b));
}
static __inline__ __attribute__((__always_inline__)) void rcp_b2valid(uint32_t b0, uint32_t b1) {
    __asm volatile (".syntax unified\n" "mcrr p7, #0, %0, %1, c8\n" : : "r" (b0), "r" (b1));
}
static __inline__ __attribute__((__always_inline__)) void rcp_b2valid_nodelay(uint32_t b0, uint32_t b1) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #0, %0, %1, c8\n" : : "r" (b0), "r" (b1));
}
static __inline__ __attribute__((__always_inline__)) void rcp_b2and(uint32_t b0, uint32_t b1) {
    __asm volatile (".syntax unified\n" "mcrr p7, #1, %0, %1, c0\n" : : "r" (b0), "r" (b1));
}
static __inline__ __attribute__((__always_inline__)) void rcp_b2and_nodelay(uint32_t b0, uint32_t b1) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #1, %0, %1, c0\n" : : "r" (b0), "r" (b1));
}
static __inline__ __attribute__((__always_inline__)) void rcp_b2or(uint32_t b0, uint32_t b1) {
    __asm volatile (".syntax unified\n" "mcrr p7, #2, %0, %1, c0\n" : : "r" (b0), "r" (b1));
}
static __inline__ __attribute__((__always_inline__)) void rcp_b2or_nodelay(uint32_t b0, uint32_t b1) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #2, %0, %1, c0\n" : : "r" (b0), "r" (b1));
}
static __inline__ __attribute__((__always_inline__)) void rcp_bxorvalid(uint32_t b, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr p7, #3, %0, %1, c8\n" : : "r" (b), "r" (mask));
}
static __inline__ __attribute__((__always_inline__)) void rcp_bxorvalid_nodelay(uint32_t b, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #3, %0, %1, c8\n" : : "r" (b), "r" (mask));
}
static __inline__ __attribute__((__always_inline__)) void rcp_bxortrue(uint32_t b, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr p7, #4, %0, %1, c0\n" : : "r" (b), "r" (mask));
}
static __inline__ __attribute__((__always_inline__)) void rcp_bxortrue_nodelay(uint32_t b, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #4, %0, %1, c0\n" : : "r" (b), "r" (mask));
}
static __inline__ __attribute__((__always_inline__)) void rcp_bxorfalse(uint32_t b, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr p7, #5, %0, %1, c8\n" : : "r" (b), "r" (mask));
}
static __inline__ __attribute__((__always_inline__)) void rcp_bxorfalse_nodelay(uint32_t b, uint32_t mask) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #5, %0, %1, c8\n" : : "r" (b), "r" (mask));
}
static __inline__ __attribute__((__always_inline__)) void rcp_ivalid(uint32_t x, uint32_t parity) {
    __asm volatile (".syntax unified\n" "mcrr p7, #6, %0, %1, c8\n" : : "r" (x), "r" (parity));
}
static __inline__ __attribute__((__always_inline__)) void rcp_ivalid_nodelay(uint32_t x, uint32_t parity) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #6, %0, %1, c8\n" : : "r" (x), "r" (parity));
}
static __inline__ __attribute__((__always_inline__)) void rcp_iequal(uint32_t x, uint32_t y) {
    __asm volatile (".syntax unified\n" "mcrr p7, #7, %0, %1, c0\n" : : "r" (x), "r" (y));
}
static __inline__ __attribute__((__always_inline__)) void rcp_iequal_nodelay(uint32_t x, uint32_t y) {
    __asm volatile (".syntax unified\n" "mcrr2 p7, #7, %0, %1, c0\n" : : "r" (x), "r" (y));
}
static __inline__ __attribute__((__always_inline__)) uint8_t rcp_random_byte(void) {
    uint8_t ret;
    __asm volatile (".syntax unified\n" "mrc2 p7, #2, %0, c0, c0, #0\n" : "=r" (ret));
    return ret;
}
static __inline__ __attribute__((__always_inline__)) uint8_t rcp_random_byte_nodelay(void) {
    uint8_t ret;
    __asm volatile (".syntax unified\n" "mrc2 p7, #2, %0, c0, c0, #0\n" : "=r" (ret));
    return ret;
}
#define rcp_count_set(cnt) rcp_asm ( "mcr p7, #4, r0, c%c0, c%c1, #0\n" : : "i"(((cnt) >> 4) & 0xf), "i"((cnt) & 0xf) );
#define rcp_count_set_nodelay(cnt) rcp_asm ( "mcr2 p7, #4, r0, c%c0, c%c1, #0\n" : : "i"(((cnt) >> 4) & 0xf), "i"((cnt) & 0xf) );
#define rcp_count_check(cnt) rcp_asm ( "mcr p7, #5, r0, c%c0, c%c1, #1\n" : : "i"(((cnt) >> 4) & 0xf), "i"((cnt) & 0xf) );
#define rcp_count_check_nodelay(cnt) rcp_asm ( "mcr2 p7, #5, r0, c%c0, c%c1, #1\n" : : "i"(((cnt) >> 4) & 0xf), "i"((cnt) & 0xf) );
static __inline__ __attribute__((__always_inline__)) __attribute__((noreturn)) void rcp_panic(void) {
    __asm volatile (".syntax unified\n" "cdp p7, #0, c0, c0, c0, #1");
    __builtin_unreachable();
}
#define _HARDWARE_RESETS_H 
#define _HARDWARE_STRUCTS_RESETS_H 
#define _HARDWARE_REGS_RESETS_H 
#define RESETS_RESET_OFFSET 0x00000000u
#define RESETS_RESET_BITS 0x1fffffffu
#define RESETS_RESET_RESET 0x1fffffffu
#define RESETS_RESET_USBCTRL_RESET 0x1u
#define RESETS_RESET_USBCTRL_BITS 0x10000000u
#define RESETS_RESET_USBCTRL_MSB 28u
#define RESETS_RESET_USBCTRL_LSB 28u
#define RESETS_RESET_USBCTRL_ACCESS "RW"
#define RESETS_RESET_UART1_RESET 0x1u
#define RESETS_RESET_UART1_BITS 0x08000000u
#define RESETS_RESET_UART1_MSB 27u
#define RESETS_RESET_UART1_LSB 27u
#define RESETS_RESET_UART1_ACCESS "RW"
#define RESETS_RESET_UART0_RESET 0x1u
#define RESETS_RESET_UART0_BITS 0x04000000u
#define RESETS_RESET_UART0_MSB 26u
#define RESETS_RESET_UART0_LSB 26u
#define RESETS_RESET_UART0_ACCESS "RW"
#define RESETS_RESET_TRNG_RESET 0x1u
#define RESETS_RESET_TRNG_BITS 0x02000000u
#define RESETS_RESET_TRNG_MSB 25u
#define RESETS_RESET_TRNG_LSB 25u
#define RESETS_RESET_TRNG_ACCESS "RW"
#define RESETS_RESET_TIMER1_RESET 0x1u
#define RESETS_RESET_TIMER1_BITS 0x01000000u
#define RESETS_RESET_TIMER1_MSB 24u
#define RESETS_RESET_TIMER1_LSB 24u
#define RESETS_RESET_TIMER1_ACCESS "RW"
#define RESETS_RESET_TIMER0_RESET 0x1u
#define RESETS_RESET_TIMER0_BITS 0x00800000u
