gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
typedef struct {
   
    io_rw_32 reset;
   
    io_rw_32 wdsel;
   
    io_ro_32 reset_done;
} resets_hw_t;
#define resets_hw ((resets_hw_t *)RESETS_BASE)
_Static_assert(sizeof (resets_hw_t) == 0x000c, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_RESETS 0
static __inline__ __attribute__((__always_inline__)) void reset_block_reg_mask(io_rw_32 *reset, uint32_t mask) {
    hw_set_bits(reset, mask);
}
static __inline__ __attribute__((__always_inline__)) void unreset_block_reg_mask(io_rw_32 *reset, uint32_t mask) {
    hw_clear_bits(reset, mask);
}
static __inline__ __attribute__((__always_inline__)) void unreset_block_reg_mask_wait_blocking(io_rw_32 *reset, io_ro_32 *reset_done, uint32_t mask) {
    hw_clear_bits(reset, mask);
    while (~*reset_done & mask)
        tight_loop_contents();
}
static __inline__ __attribute__((__always_inline__)) void reset_block_mask(uint32_t bits) {
    reset_block_reg_mask(&((resets_hw_t *)0x40020000u)->reset, bits);
}
static __inline__ __attribute__((__always_inline__)) void unreset_block_mask(uint32_t bits) {
    unreset_block_reg_mask(&((resets_hw_t *)0x40020000u)->reset, bits);
}
static __inline__ __attribute__((__always_inline__)) void unreset_block_mask_wait_blocking(uint32_t bits) {
    unreset_block_reg_mask_wait_blocking(&((resets_hw_t *)0x40020000u)->reset, &((resets_hw_t *)0x40020000u)->reset_done, bits);
}
#define HARDWARE_RESETS_ENABLE_SDK1XX_COMPATIBILITY 1
static __inline__ __attribute__((__always_inline__)) void reset_block(uint32_t bits) {
    reset_block_mask(bits);
}
static __inline__ __attribute__((__always_inline__)) void unreset_block(uint32_t bits) {
    unreset_block_mask(bits);
}
static __inline__ __attribute__((__always_inline__)) void unreset_block_wait(uint32_t bits) {
    return unreset_block_mask_wait_blocking(bits);
}
static inline void reset_block_num(uint32_t block_num) {
    reset_block_reg_mask(&((resets_hw_t *)0x40020000u)->reset, 1u << block_num);
}
static inline void unreset_block_num(uint block_num) {
    ({if (((0 || 0) && !0)) ((!(block_num > 28u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_resets/include/hardware/resets.h", 187, __func__, "!(block_num > 28u)"));});
    unreset_block_reg_mask(&((resets_hw_t *)0x40020000u)->reset, 1u << block_num);
}
static inline void unreset_block_num_wait_blocking(uint block_num) {
    ({if (((0 || 0) && !0)) ((!(block_num > 28u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_resets/include/hardware/resets.h", 197, __func__, "!(block_num > 28u)"));});
    unreset_block_reg_mask_wait_blocking(&((resets_hw_t *)0x40020000u)->reset, &((resets_hw_t *)0x40020000u)->reset_done, 1u << block_num);
}
static inline void reset_unreset_block_num_wait_blocking(uint block_num) {
    ({if (((0 || 0) && !0)) ((!(block_num > 28u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_resets/include/hardware/resets.h", 207, __func__, "!(block_num > 28u)"));});
    reset_block_reg_mask(&((resets_hw_t *)0x40020000u)->reset, 1u << block_num);
    unreset_block_reg_mask_wait_blocking(&((resets_hw_t *)0x40020000u)->reset, &((resets_hw_t *)0x40020000u)->reset_done, 1u << block_num);
}
#define _HARDWARE_SHA256_H 
#define _HARDWARE_STRUCTS_SHA256_H 
#define _HARDWARE_REGS_SHA256_H 
#define SHA256_CSR_OFFSET 0x00000000u
#define SHA256_CSR_BITS 0x00001317u
#define SHA256_CSR_RESET 0x00001206u
#define SHA256_CSR_BSWAP_RESET 0x1u
#define SHA256_CSR_BSWAP_BITS 0x00001000u
#define SHA256_CSR_BSWAP_MSB 12u
#define SHA256_CSR_BSWAP_LSB 12u
#define SHA256_CSR_BSWAP_ACCESS "RW"
#define SHA256_CSR_DMA_SIZE_RESET 0x2u
#define SHA256_CSR_DMA_SIZE_BITS 0x00000300u
#define SHA256_CSR_DMA_SIZE_MSB 9u
#define SHA256_CSR_DMA_SIZE_LSB 8u
#define SHA256_CSR_DMA_SIZE_ACCESS "RW"
#define SHA256_CSR_DMA_SIZE_VALUE_8BIT 0x0u
#define SHA256_CSR_DMA_SIZE_VALUE_16BIT 0x1u
#define SHA256_CSR_DMA_SIZE_VALUE_32BIT 0x2u
#define SHA256_CSR_ERR_WDATA_NOT_RDY_RESET 0x0u
#define SHA256_CSR_ERR_WDATA_NOT_RDY_BITS 0x00000010u
#define SHA256_CSR_ERR_WDATA_NOT_RDY_MSB 4u
#define SHA256_CSR_ERR_WDATA_NOT_RDY_LSB 4u
#define SHA256_CSR_ERR_WDATA_NOT_RDY_ACCESS "WC"
#define SHA256_CSR_SUM_VLD_RESET 0x1u
#define SHA256_CSR_SUM_VLD_BITS 0x00000004u
#define SHA256_CSR_SUM_VLD_MSB 2u
#define SHA256_CSR_SUM_VLD_LSB 2u
#define SHA256_CSR_SUM_VLD_ACCESS "RO"
#define SHA256_CSR_WDATA_RDY_RESET 0x1u
#define SHA256_CSR_WDATA_RDY_BITS 0x00000002u
#define SHA256_CSR_WDATA_RDY_MSB 1u
#define SHA256_CSR_WDATA_RDY_LSB 1u
#define SHA256_CSR_WDATA_RDY_ACCESS "RO"
#define SHA256_CSR_START_RESET 0x0u
#define SHA256_CSR_START_BITS 0x00000001u
#define SHA256_CSR_START_MSB 0u
#define SHA256_CSR_START_LSB 0u
#define SHA256_CSR_START_ACCESS "SC"
#define SHA256_WDATA_OFFSET 0x00000004u
#define SHA256_WDATA_BITS 0xffffffffu
#define SHA256_WDATA_RESET 0x00000000u
#define SHA256_WDATA_MSB 31u
#define SHA256_WDATA_LSB 0u
#define SHA256_WDATA_ACCESS "WF"
#define SHA256_SUM0_OFFSET 0x00000008u
#define SHA256_SUM0_BITS 0xffffffffu
#define SHA256_SUM0_RESET 0x00000000u
#define SHA256_SUM0_MSB 31u
#define SHA256_SUM0_LSB 0u
#define SHA256_SUM0_ACCESS "RO"
#define SHA256_SUM1_OFFSET 0x0000000cu
#define SHA256_SUM1_BITS 0xffffffffu
#define SHA256_SUM1_RESET 0x00000000u
#define SHA256_SUM1_MSB 31u
#define SHA256_SUM1_LSB 0u
#define SHA256_SUM1_ACCESS "RO"
#define SHA256_SUM2_OFFSET 0x00000010u
#define SHA256_SUM2_BITS 0xffffffffu
#define SHA256_SUM2_RESET 0x00000000u
#define SHA256_SUM2_MSB 31u
#define SHA256_SUM2_LSB 0u
#define SHA256_SUM2_ACCESS "RO"
#define SHA256_SUM3_OFFSET 0x00000014u
#define SHA256_SUM3_BITS 0xffffffffu
#define SHA256_SUM3_RESET 0x00000000u
#define SHA256_SUM3_MSB 31u
#define SHA256_SUM3_LSB 0u
#define SHA256_SUM3_ACCESS "RO"
#define SHA256_SUM4_OFFSET 0x00000018u
#define SHA256_SUM4_BITS 0xffffffffu
#define SHA256_SUM4_RESET 0x00000000u
#define SHA256_SUM4_MSB 31u
#define SHA256_SUM4_LSB 0u
#define SHA256_SUM4_ACCESS "RO"
#define SHA256_SUM5_OFFSET 0x0000001cu
#define SHA256_SUM5_BITS 0xffffffffu
#define SHA256_SUM5_RESET 0x00000000u
#define SHA256_SUM5_MSB 31u
#define SHA256_SUM5_LSB 0u
#define SHA256_SUM5_ACCESS "RO"
#define SHA256_SUM6_OFFSET 0x00000020u
#define SHA256_SUM6_BITS 0xffffffffu
#define SHA256_SUM6_RESET 0x00000000u
#define SHA256_SUM6_MSB 31u
#define SHA256_SUM6_LSB 0u
#define SHA256_SUM6_ACCESS "RO"
#define SHA256_SUM7_OFFSET 0x00000024u
#define SHA256_SUM7_BITS 0xffffffffu
#define SHA256_SUM7_RESET 0x00000000u
#define SHA256_SUM7_MSB 31u
#define SHA256_SUM7_LSB 0u
#define SHA256_SUM7_ACCESS "RO"
typedef struct {
   
    io_rw_32 csr;
   
    io_wo_32 wdata;
   
    io_ro_32 sum[8];
} sha256_hw_t;
#define sha256_hw ((sha256_hw_t *)SHA256_BASE)
_Static_assert(sizeof (sha256_hw_t) == 0x0028, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_SHA256 0
#define SHA256_RESULT_BYTES 32
enum sha256_endianness {
    SHA256_LITTLE_ENDIAN,
    SHA256_BIG_ENDIAN,
};
