gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
    io_rw_32 ilpr;
   
    io_rw_32 ibrd;
   
    io_rw_32 fbrd;
   
    io_rw_32 lcr_h;
   
    io_rw_32 cr;
   
    io_rw_32 ifls;
   
    io_rw_32 imsc;
   
    io_ro_32 ris;
   
    io_ro_32 mis;
   
    io_rw_32 icr;
   
    io_rw_32 dmacr;
} uart_hw_t;
#define uart0_hw ((uart_hw_t *)UART0_BASE)
#define uart1_hw ((uart_hw_t *)UART1_BASE)
_Static_assert(sizeof (uart_hw_t) == 0x004c, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_UART 0
#define PICO_UART_ENABLE_CRLF_SUPPORT 1
#define PICO_UART_DEFAULT_CRLF 0
#define PICO_DEFAULT_UART_BAUD_RATE 115200
typedef struct uart_inst uart_inst_t;
#define uart0 ((uart_inst_t *)uart0_hw)
#define uart1 ((uart_inst_t *)uart1_hw)
#define PICO_DEFAULT_UART_INSTANCE() (__CONCAT(uart,PICO_DEFAULT_UART))
#define uart_default PICO_DEFAULT_UART_INSTANCE()
_Static_assert(2u == 2, "");
#define UART_NUM(uart) ((uart) == uart1)
_Static_assert(2u == 2, "");
#define UART_INSTANCE(num) ((num) ? uart1 : uart0)
_Static_assert(DREQ_UART0_RX == DREQ_UART0_TX + 1, "");
_Static_assert(DREQ_UART1_RX == DREQ_UART1_TX + 1, "");
_Static_assert(DREQ_UART1_TX == DREQ_UART0_TX + 2, "");
#define UART_DREQ_NUM(uart,is_tx) ({ DREQ_UART0_TX + UART_NUM(uart) * 2 + !(is_tx); })
#define UART_CLOCK_NUM(uart) clk_peri
#define UART_FUNCSEL_NUM(uart,gpio) ((gpio) & 0x2 ? GPIO_FUNC_UART_AUX : GPIO_FUNC_UART)
_Static_assert(UART1_IRQ == UART0_IRQ + 1, "");
#define UART_IRQ_NUM(uart) (UART0_IRQ + UART_NUM(uart))
#define UART_RESET_NUM(uart) (uart_get_index(uart) ? RESET_UART1 : RESET_UART0)
static inline uint uart_get_index(uart_inst_t *uart) {
    ({if (((0 || 0) && !0)) ((!(uart != ((uart_inst_t *)((uart_hw_t *)0x40070000u)) && uart != ((uart_inst_t *)((uart_hw_t *)0x40078000u)))) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_uart/include/hardware/uart.h", 219, __func__, "!(uart != ((uart_inst_t *)((uart_hw_t *)0x40070000u)) && uart != ((uart_inst_t *)((uart_hw_t *)0x40078000u)))"));});
    return ((uart) == ((uart_inst_t *)((uart_hw_t *)0x40078000u)));
}
static inline uart_inst_t *uart_get_instance(uint num) {
    ({if (((0 || 0) && !0)) ((!(num >= 2u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_uart/include/hardware/uart.h", 230, __func__, "!(num >= 2u)"));});
    return ((num) ? ((uart_inst_t *)((uart_hw_t *)0x40078000u)) : ((uart_inst_t *)((uart_hw_t *)0x40070000u)));
}
static inline uart_hw_t *uart_get_hw(uart_inst_t *uart) {
    uart_get_index(uart);
    return (uart_hw_t *)uart;
}
typedef enum {
    UART_PARITY_NONE,
    UART_PARITY_EVEN,
    UART_PARITY_ODD
} uart_parity_t;
uint uart_init(uart_inst_t *uart, uint baudrate);
void uart_deinit(uart_inst_t *uart);
uint uart_set_baudrate(uart_inst_t *uart, uint baudrate);
static inline void uart_set_hw_flow(uart_inst_t *uart, _Bool cts, _Bool rts) {
    hw_write_masked(&uart_get_hw(uart)->cr,
                   (((uint)!!(cts)) << 15u) | (((uint)!!(rts)) << 14u),
                   0x00004000u | 0x00008000u);
}
void uart_set_format(uart_inst_t *uart, uint data_bits, uint stop_bits, uart_parity_t parity);
static inline void uart_set_irqs_enabled(uart_inst_t *uart, _Bool rx_has_data, _Bool tx_needs_data) {
    uart_get_hw(uart)->imsc = (((uint)!!(tx_needs_data)) << 5u) |
                              (((uint)!!(rx_has_data)) << 4u) |
                              (((uint)!!(rx_has_data)) << 6u);
    if (rx_has_data) {
        hw_write_masked(&uart_get_hw(uart)->ifls, 0 << 3u,
                        0x00000038u);
    }
    if (tx_needs_data) {
        hw_write_masked(&uart_get_hw(uart)->ifls, 0 << 0u,
                        0x00000007u);
    }
}
static inline void uart_set_irq_enables(uart_inst_t *uart, _Bool rx_has_data, _Bool tx_needs_data) {
    uart_set_irqs_enabled(uart, rx_has_data, tx_needs_data);
}
static inline _Bool uart_is_enabled(uart_inst_t *uart) {
    return uart_get_hw(uart)->cr & 0x00000001u;
}
void uart_set_fifo_enabled(uart_inst_t *uart, _Bool enabled);
static inline _Bool uart_is_writable(uart_inst_t *uart) {
    return !(uart_get_hw(uart)->fr & 0x00000020u);
}
static inline void uart_tx_wait_blocking(uart_inst_t *uart) {
    while (uart_get_hw(uart)->fr & 0x00000008u) tight_loop_contents();
}
static inline _Bool uart_is_readable(uart_inst_t *uart) {
    return !(uart_get_hw(uart)->fr & 0x00000010u);
}
static inline void uart_write_blocking(uart_inst_t *uart, const uint8_t *src, size_t len) {
    for (size_t i = 0; i < len; ++i) {
        while (!uart_is_writable(uart))
            tight_loop_contents();
        uart_get_hw(uart)->dr = *src++;
    }
}
static inline void uart_read_blocking(uart_inst_t *uart, uint8_t *dst, size_t len) {
    for (size_t i = 0; i < len; ++i) {
        while (!uart_is_readable(uart))
            tight_loop_contents();
        *dst++ = (uint8_t) uart_get_hw(uart)->dr;
    }
}
static inline void uart_putc_raw(uart_inst_t *uart, char c) {
    uart_write_blocking(uart, (const uint8_t *) &c, 1);
}
static inline void uart_putc(uart_inst_t *uart, char c) {
    extern short uart_char_to_line_feed[2u];
    if (uart_char_to_line_feed[uart_get_index(uart)] == c)
        uart_putc_raw(uart, '\r');
    uart_putc_raw(uart, c);
}
static inline void uart_puts(uart_inst_t *uart, const char *s) {
    _Bool last_was_cr = 0;
    while (*s) {
        if (last_was_cr)
            uart_putc_raw(uart, *s);
        else
            uart_putc(uart, *s);
        last_was_cr = *s++ == '\r';
    }
}
static inline char uart_getc(uart_inst_t *uart) {
    char c;
    uart_read_blocking(uart, (uint8_t *) &c, 1);
    return c;
}
void uart_set_break(uart_inst_t *uart, _Bool en);
void uart_set_translate_crlf(uart_inst_t *uart, _Bool translate);
static inline void uart_default_tx_wait_blocking(void) {
    uart_tx_wait_blocking((((uart_inst_t *)((uart_hw_t *)0x40070000u))));
}
_Bool uart_is_readable_within_us(uart_inst_t *uart, uint32_t us);
static inline uint uart_get_dreq_num(uart_inst_t *uart, _Bool is_tx) {
    return ({ DREQ_UART0_TX + ((uart) == ((uart_inst_t *)((uart_hw_t *)0x40078000u))) * 2 + !(is_tx); });
}
static inline uint uart_get_reset_num(uart_inst_t *uart) {
    return (uart_get_index(uart) ? RESET_UART1 : RESET_UART0);
}
static inline uint uart_get_dreq(uart_inst_t *uart, _Bool is_tx) {
    return uart_get_dreq_num(uart, is_tx);
}
#define _HARDWARE_VREG_H 
enum vreg_voltage {
    VREG_VOLTAGE_0_55 = 0b00000,
    VREG_VOLTAGE_0_60 = 0b00001,
    VREG_VOLTAGE_0_65 = 0b00010,
    VREG_VOLTAGE_0_70 = 0b00011,
    VREG_VOLTAGE_0_75 = 0b00100,
    VREG_VOLTAGE_0_80 = 0b00101,
    VREG_VOLTAGE_0_85 = 0b00110,
    VREG_VOLTAGE_0_90 = 0b00111,
    VREG_VOLTAGE_0_95 = 0b01000,
    VREG_VOLTAGE_1_00 = 0b01001,
    VREG_VOLTAGE_1_05 = 0b01010,
    VREG_VOLTAGE_1_10 = 0b01011,
    VREG_VOLTAGE_1_15 = 0b01100,
    VREG_VOLTAGE_1_20 = 0b01101,
    VREG_VOLTAGE_1_25 = 0b01110,
    VREG_VOLTAGE_1_30 = 0b01111,
    VREG_VOLTAGE_1_35 = 0b10000,
    VREG_VOLTAGE_1_40 = 0b10001,
    VREG_VOLTAGE_1_50 = 0b10010,
    VREG_VOLTAGE_1_60 = 0b10011,
    VREG_VOLTAGE_1_65 = 0b10100,
    VREG_VOLTAGE_1_70 = 0b10101,
    VREG_VOLTAGE_1_80 = 0b10110,
    VREG_VOLTAGE_1_90 = 0b10111,
    VREG_VOLTAGE_2_00 = 0b11000,
    VREG_VOLTAGE_2_35 = 0b11001,
    VREG_VOLTAGE_2_50 = 0b11010,
    VREG_VOLTAGE_2_65 = 0b11011,
    VREG_VOLTAGE_2_80 = 0b11100,
    VREG_VOLTAGE_3_00 = 0b11101,
    VREG_VOLTAGE_3_15 = 0b11110,
    VREG_VOLTAGE_3_30 = 0b11111,
    VREG_VOLTAGE_MIN = VREG_VOLTAGE_0_85,
    VREG_VOLTAGE_DEFAULT = VREG_VOLTAGE_1_10,
    VREG_VOLTAGE_MAX = VREG_VOLTAGE_1_30,
};
void vreg_set_voltage(enum vreg_voltage voltage);
enum vreg_voltage vreg_get_voltage(void);
void vreg_disable_voltage_limit(void);
#define _HARDWARE_WATCHDOG_H 
#define _HARDWARE_STRUCTS_WATCHDOG_H 
#define _HARDWARE_REGS_WATCHDOG_H 
#define WATCHDOG_CTRL_OFFSET 0x00000000u
#define WATCHDOG_CTRL_BITS 0xc7ffffffu
#define WATCHDOG_CTRL_RESET 0x07000000u
#define WATCHDOG_CTRL_TRIGGER_RESET 0x0u
#define WATCHDOG_CTRL_TRIGGER_BITS 0x80000000u
#define WATCHDOG_CTRL_TRIGGER_MSB 31u
#define WATCHDOG_CTRL_TRIGGER_LSB 31u
#define WATCHDOG_CTRL_TRIGGER_ACCESS "SC"
#define WATCHDOG_CTRL_ENABLE_RESET 0x0u
#define WATCHDOG_CTRL_ENABLE_BITS 0x40000000u
#define WATCHDOG_CTRL_ENABLE_MSB 30u
#define WATCHDOG_CTRL_ENABLE_LSB 30u
#define WATCHDOG_CTRL_ENABLE_ACCESS "RW"
#define WATCHDOG_CTRL_PAUSE_DBG1_RESET 0x1u
#define WATCHDOG_CTRL_PAUSE_DBG1_BITS 0x04000000u
#define WATCHDOG_CTRL_PAUSE_DBG1_MSB 26u
#define WATCHDOG_CTRL_PAUSE_DBG1_LSB 26u
#define WATCHDOG_CTRL_PAUSE_DBG1_ACCESS "RW"
#define WATCHDOG_CTRL_PAUSE_DBG0_RESET 0x1u
#define WATCHDOG_CTRL_PAUSE_DBG0_BITS 0x02000000u
#define WATCHDOG_CTRL_PAUSE_DBG0_MSB 25u
#define WATCHDOG_CTRL_PAUSE_DBG0_LSB 25u
#define WATCHDOG_CTRL_PAUSE_DBG0_ACCESS "RW"
#define WATCHDOG_CTRL_PAUSE_JTAG_RESET 0x1u
#define WATCHDOG_CTRL_PAUSE_JTAG_BITS 0x01000000u
#define WATCHDOG_CTRL_PAUSE_JTAG_MSB 24u
#define WATCHDOG_CTRL_PAUSE_JTAG_LSB 24u
#define WATCHDOG_CTRL_PAUSE_JTAG_ACCESS "RW"
#define WATCHDOG_CTRL_TIME_RESET 0x000000u
#define WATCHDOG_CTRL_TIME_BITS 0x00ffffffu
#define WATCHDOG_CTRL_TIME_MSB 23u
#define WATCHDOG_CTRL_TIME_LSB 0u
#define WATCHDOG_CTRL_TIME_ACCESS "RO"
#define WATCHDOG_LOAD_OFFSET 0x00000004u
#define WATCHDOG_LOAD_BITS 0x00ffffffu
#define WATCHDOG_LOAD_RESET 0x00000000u
#define WATCHDOG_LOAD_MSB 23u
#define WATCHDOG_LOAD_LSB 0u
#define WATCHDOG_LOAD_ACCESS "WF"
#define WATCHDOG_REASON_OFFSET 0x00000008u
#define WATCHDOG_REASON_BITS 0x00000003u
#define WATCHDOG_REASON_RESET 0x00000000u
#define WATCHDOG_REASON_FORCE_RESET 0x0u
#define WATCHDOG_REASON_FORCE_BITS 0x00000002u
#define WATCHDOG_REASON_FORCE_MSB 1u
#define WATCHDOG_REASON_FORCE_LSB 1u
#define WATCHDOG_REASON_FORCE_ACCESS "RO"
#define WATCHDOG_REASON_TIMER_RESET 0x0u
#define WATCHDOG_REASON_TIMER_BITS 0x00000001u
#define WATCHDOG_REASON_TIMER_MSB 0u
#define WATCHDOG_REASON_TIMER_LSB 0u
#define WATCHDOG_REASON_TIMER_ACCESS "RO"
#define WATCHDOG_SCRATCH0_OFFSET 0x0000000cu
#define WATCHDOG_SCRATCH0_BITS 0xffffffffu
#define WATCHDOG_SCRATCH0_RESET 0x00000000u
#define WATCHDOG_SCRATCH0_MSB 31u
#define WATCHDOG_SCRATCH0_LSB 0u
#define WATCHDOG_SCRATCH0_ACCESS "RW"
#define WATCHDOG_SCRATCH1_OFFSET 0x00000010u
#define WATCHDOG_SCRATCH1_BITS 0xffffffffu
#define WATCHDOG_SCRATCH1_RESET 0x00000000u
#define WATCHDOG_SCRATCH1_MSB 31u
#define WATCHDOG_SCRATCH1_LSB 0u
#define WATCHDOG_SCRATCH1_ACCESS "RW"
#define WATCHDOG_SCRATCH2_OFFSET 0x00000014u
#define WATCHDOG_SCRATCH2_BITS 0xffffffffu
#define WATCHDOG_SCRATCH2_RESET 0x00000000u
#define WATCHDOG_SCRATCH2_MSB 31u
#define WATCHDOG_SCRATCH2_LSB 0u
#define WATCHDOG_SCRATCH2_ACCESS "RW"
#define WATCHDOG_SCRATCH3_OFFSET 0x00000018u
#define WATCHDOG_SCRATCH3_BITS 0xffffffffu
#define WATCHDOG_SCRATCH3_RESET 0x00000000u
#define WATCHDOG_SCRATCH3_MSB 31u
#define WATCHDOG_SCRATCH3_LSB 0u
#define WATCHDOG_SCRATCH3_ACCESS "RW"
#define WATCHDOG_SCRATCH4_OFFSET 0x0000001cu
#define WATCHDOG_SCRATCH4_BITS 0xffffffffu
#define WATCHDOG_SCRATCH4_RESET 0x00000000u
#define WATCHDOG_SCRATCH4_MSB 31u
#define WATCHDOG_SCRATCH4_LSB 0u
#define WATCHDOG_SCRATCH4_ACCESS "RW"
#define WATCHDOG_SCRATCH5_OFFSET 0x00000020u
#define WATCHDOG_SCRATCH5_BITS 0xffffffffu
#define WATCHDOG_SCRATCH5_RESET 0x00000000u
#define WATCHDOG_SCRATCH5_MSB 31u
#define WATCHDOG_SCRATCH5_LSB 0u
#define WATCHDOG_SCRATCH5_ACCESS "RW"
#define WATCHDOG_SCRATCH6_OFFSET 0x00000024u
#define WATCHDOG_SCRATCH6_BITS 0xffffffffu
#define WATCHDOG_SCRATCH6_RESET 0x00000000u
#define WATCHDOG_SCRATCH6_MSB 31u
#define WATCHDOG_SCRATCH6_LSB 0u
#define WATCHDOG_SCRATCH6_ACCESS "RW"
#define WATCHDOG_SCRATCH7_OFFSET 0x00000028u
#define WATCHDOG_SCRATCH7_BITS 0xffffffffu
#define WATCHDOG_SCRATCH7_RESET 0x00000000u
#define WATCHDOG_SCRATCH7_MSB 31u
#define WATCHDOG_SCRATCH7_LSB 0u
#define WATCHDOG_SCRATCH7_ACCESS "RW"
typedef struct {
   
