gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
    io_rw_32 ctrl;
   
    io_wo_32 load;
   
    io_ro_32 reason;
   
    io_rw_32 scratch[8];
} watchdog_hw_t;
#define watchdog_hw ((watchdog_hw_t *)WATCHDOG_BASE)
_Static_assert(sizeof (watchdog_hw_t) == 0x002c, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_WATCHDOG 0
void watchdog_reboot(uint32_t pc, uint32_t sp, uint32_t delay_ms);
void watchdog_start_tick(uint cycles);
void watchdog_update(void);
void watchdog_enable(uint32_t delay_ms, _Bool pause_on_debug);
void watchdog_disable(void);
_Bool watchdog_caused_reboot(void);
_Bool watchdog_enable_caused_reboot(void);
uint32_t watchdog_get_time_remaining_us(void);
uint32_t watchdog_get_time_remaining_ms(void);
static inline uint32_t watchdog_get_count(void) {
    return watchdog_get_time_remaining_us();
}
#define _HARDWARE_XIP_CACHE_H 
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_XIP_CACHE 0
#define XIP_CACHE_LINE_SIZE 8u
#define XIP_CACHE_SIZE (16u * 1024u)
#define XIP_CACHE_ADDRESS_SPACE_SIZE (XIP_END - XIP_BASE)
#define XIP_CACHE_IS_READ_ONLY 0
void xip_cache_invalidate_all(void);
void xip_cache_invalidate_range(uintptr_t start_offset, uintptr_t size_bytes);
void xip_cache_clean_all(void);
void xip_cache_clean_range(uintptr_t start_offset, uintptr_t size_bytes);
void xip_cache_pin_range(uintptr_t start_offset, uintptr_t size_bytes);
#define _HARDWARE_XOSC_H 
#define _HARDWARE_STRUCTS_XOSC_H 
#define _HARDWARE_REGS_XOSC_H 
#define XOSC_CTRL_OFFSET 0x00000000u
#define XOSC_CTRL_BITS 0x00ffffffu
#define XOSC_CTRL_RESET 0x00000000u
#define XOSC_CTRL_ENABLE_RESET "-"
#define XOSC_CTRL_ENABLE_BITS 0x00fff000u
#define XOSC_CTRL_ENABLE_MSB 23u
#define XOSC_CTRL_ENABLE_LSB 12u
#define XOSC_CTRL_ENABLE_ACCESS "RW"
#define XOSC_CTRL_ENABLE_VALUE_DISABLE 0xd1eu
#define XOSC_CTRL_ENABLE_VALUE_ENABLE 0xfabu
#define XOSC_CTRL_FREQ_RANGE_RESET "-"
#define XOSC_CTRL_FREQ_RANGE_BITS 0x00000fffu
#define XOSC_CTRL_FREQ_RANGE_MSB 11u
#define XOSC_CTRL_FREQ_RANGE_LSB 0u
#define XOSC_CTRL_FREQ_RANGE_ACCESS "RW"
#define XOSC_CTRL_FREQ_RANGE_VALUE_1_15MHZ 0xaa0u
#define XOSC_CTRL_FREQ_RANGE_VALUE_10_30MHZ 0xaa1u
#define XOSC_CTRL_FREQ_RANGE_VALUE_25_60MHZ 0xaa2u
#define XOSC_CTRL_FREQ_RANGE_VALUE_40_100MHZ 0xaa3u
#define XOSC_STATUS_OFFSET 0x00000004u
#define XOSC_STATUS_BITS 0x81001003u
#define XOSC_STATUS_RESET 0x00000000u
#define XOSC_STATUS_STABLE_RESET 0x0u
#define XOSC_STATUS_STABLE_BITS 0x80000000u
#define XOSC_STATUS_STABLE_MSB 31u
#define XOSC_STATUS_STABLE_LSB 31u
#define XOSC_STATUS_STABLE_ACCESS "RO"
#define XOSC_STATUS_BADWRITE_RESET 0x0u
#define XOSC_STATUS_BADWRITE_BITS 0x01000000u
#define XOSC_STATUS_BADWRITE_MSB 24u
#define XOSC_STATUS_BADWRITE_LSB 24u
#define XOSC_STATUS_BADWRITE_ACCESS "WC"
#define XOSC_STATUS_ENABLED_RESET "-"
#define XOSC_STATUS_ENABLED_BITS 0x00001000u
#define XOSC_STATUS_ENABLED_MSB 12u
#define XOSC_STATUS_ENABLED_LSB 12u
#define XOSC_STATUS_ENABLED_ACCESS "RO"
#define XOSC_STATUS_FREQ_RANGE_RESET "-"
#define XOSC_STATUS_FREQ_RANGE_BITS 0x00000003u
#define XOSC_STATUS_FREQ_RANGE_MSB 1u
#define XOSC_STATUS_FREQ_RANGE_LSB 0u
#define XOSC_STATUS_FREQ_RANGE_ACCESS "RO"
#define XOSC_STATUS_FREQ_RANGE_VALUE_1_15MHZ 0x0u
#define XOSC_STATUS_FREQ_RANGE_VALUE_10_30MHZ 0x1u
#define XOSC_STATUS_FREQ_RANGE_VALUE_25_60MHZ 0x2u
#define XOSC_STATUS_FREQ_RANGE_VALUE_40_100MHZ 0x3u
#define XOSC_DORMANT_OFFSET 0x00000008u
#define XOSC_DORMANT_BITS 0xffffffffu
#define XOSC_DORMANT_RESET "-"
#define XOSC_DORMANT_MSB 31u
#define XOSC_DORMANT_LSB 0u
#define XOSC_DORMANT_ACCESS "RW"
#define XOSC_DORMANT_VALUE_DORMANT 0x636f6d61u
#define XOSC_DORMANT_VALUE_WAKE 0x77616b65u
#define XOSC_STARTUP_OFFSET 0x0000000cu
#define XOSC_STARTUP_BITS 0x00103fffu
#define XOSC_STARTUP_RESET 0x00000000u
#define XOSC_STARTUP_X4_RESET "-"
#define XOSC_STARTUP_X4_BITS 0x00100000u
#define XOSC_STARTUP_X4_MSB 20u
#define XOSC_STARTUP_X4_LSB 20u
#define XOSC_STARTUP_X4_ACCESS "RW"
#define XOSC_STARTUP_DELAY_RESET "-"
#define XOSC_STARTUP_DELAY_BITS 0x00003fffu
#define XOSC_STARTUP_DELAY_MSB 13u
#define XOSC_STARTUP_DELAY_LSB 0u
#define XOSC_STARTUP_DELAY_ACCESS "RW"
#define XOSC_COUNT_OFFSET 0x00000010u
#define XOSC_COUNT_BITS 0x0000ffffu
#define XOSC_COUNT_RESET 0x00000000u
#define XOSC_COUNT_MSB 15u
#define XOSC_COUNT_LSB 0u
#define XOSC_COUNT_ACCESS "RW"
typedef struct {
   
    io_rw_32 ctrl;
   
    io_rw_32 status;
   
    io_rw_32 dormant;
   
    io_rw_32 startup;
   
    io_rw_32 count;
} xosc_hw_t;
#define xosc_hw ((xosc_hw_t *)XOSC_BASE)
_Static_assert(sizeof (xosc_hw_t) == 0x0014, "");
#define PICO_XOSC_STARTUP_DELAY_MULTIPLIER 6
void xosc_init(void);
void xosc_disable(void);
void xosc_dormant(void);
#define _PICO_AON_TIMER_H 
#define _PICO_UTIL_DATETIME_H 
uint64_t timespec_to_ms(const struct timespec *ts);
uint64_t timespec_to_us(const struct timespec *ts);
void ms_to_timespec(uint64_t ms, struct timespec *ts);
void us_to_timespec(uint64_t ms, struct timespec *ts);
struct tm *pico_localtime_r(const time_t *time, struct tm *tm);
time_t pico_mktime(struct tm *tm);
#define AON_TIMER_IRQ_NUM() POWMAN_IRQ_TIMER
typedef void (*aon_timer_alarm_handler_t)(void);
void aon_timer_start_with_timeofday(void);
_Bool aon_timer_start(const struct timespec *ts);
_Bool aon_timer_start_calendar(const struct tm *tm);
void aon_timer_stop(void);
_Bool aon_timer_set_time(const struct timespec *ts);
_Bool aon_timer_set_time_calendar(const struct tm *tm);
_Bool aon_timer_get_time(struct timespec *ts);
_Bool aon_timer_get_time_calendar(struct tm *tm);
void aon_timer_get_resolution(struct timespec *ts);
aon_timer_alarm_handler_t aon_timer_enable_alarm(const struct timespec *ts, aon_timer_alarm_handler_t handler, _Bool wakeup_from_low_power);
aon_timer_alarm_handler_t aon_timer_enable_alarm_calendar(const struct tm *tm, aon_timer_alarm_handler_t handler, _Bool wakeup_from_low_power);
void aon_timer_disable_alarm(void);
_Bool aon_timer_is_running(void);
static inline uint aon_timer_get_irq_num(void) {
    return POWMAN_IRQ_TIMER;
}
#define _PICO_FLASH_H 
_Bool flash_safe_execute_core_init(void);
_Bool flash_safe_execute_core_deinit(void);
int flash_safe_execute(void (*func)(void *), void *param, uint32_t enter_exit_timeout_ms);
#define PICO_FLASH_ASSERT_ON_UNSAFE 1
#define PICO_FLASH_ASSUME_CORE0_SAFE 0
#define PICO_FLASH_ASSUME_CORE1_SAFE 0
#define PICO_FLASH_SAFE_EXECUTE_PICO_SUPPORT_MULTICORE_LOCKOUT 1
typedef struct {
    _Bool (*core_init_deinit)(_Bool init);
    int (*enter_safe_zone_timeout_ms)(uint32_t timeout_ms);
    int (*exit_safe_zone_timeout_ms)(uint32_t timeout_ms);
} flash_safety_helper_t;
flash_safety_helper_t *get_flash_safety_helper(void);
#define _PICO_I2C_SLAVE_H 
typedef enum i2c_slave_event_t
{
    I2C_SLAVE_RECEIVE,
    I2C_SLAVE_REQUEST,
    I2C_SLAVE_FINISH,
} i2c_slave_event_t;
typedef void (*i2c_slave_handler_t)(i2c_inst_t *i2c, i2c_slave_event_t event);
void i2c_slave_init(i2c_inst_t *i2c, uint8_t address, i2c_slave_handler_t handler);
void i2c_slave_deinit(i2c_inst_t *i2c);
#define _PICO_MULTICORE_H 
#define _PICO_SYNC_H 
#define _PICO_MUTEX_H 
typedef struct {
    lock_core_t core;
    int8_t owner;
    uint8_t enter_count;
} recursive_mutex_t;
typedef struct mutex {
    lock_core_t core;
    int8_t owner;
} mutex_t;
void mutex_init(mutex_t *mtx);
void recursive_mutex_init(recursive_mutex_t *mtx);
void mutex_enter_blocking(mutex_t *mtx);
void recursive_mutex_enter_blocking(recursive_mutex_t *mtx);
_Bool mutex_try_enter(mutex_t *mtx, uint32_t *owner_out);
_Bool mutex_try_enter_block_until(mutex_t *mtx, absolute_time_t until);
_Bool recursive_mutex_try_enter(recursive_mutex_t *mtx, uint32_t *owner_out);
_Bool mutex_enter_timeout_ms(mutex_t *mtx, uint32_t timeout_ms);
_Bool recursive_mutex_enter_timeout_ms(recursive_mutex_t *mtx, uint32_t timeout_ms);
_Bool mutex_enter_timeout_us(mutex_t *mtx, uint32_t timeout_us);
_Bool recursive_mutex_enter_timeout_us(recursive_mutex_t *mtx, uint32_t timeout_us);
_Bool mutex_enter_block_until(mutex_t *mtx, absolute_time_t until);
_Bool recursive_mutex_enter_block_until(recursive_mutex_t *mtx, absolute_time_t until);
void mutex_exit(mutex_t *mtx);
void recursive_mutex_exit(recursive_mutex_t *mtx);
static inline _Bool mutex_is_initialized(mutex_t *mtx) {
    return mtx->core.spin_lock != 0;
}
static inline _Bool recursive_mutex_is_initialized(recursive_mutex_t *mtx) {
    return mtx->core.spin_lock != 0;
}
#define auto_init_mutex(name) static __attribute__((section(".mutex_array"))) mutex_t name
#define auto_init_recursive_mutex(name) static __attribute__((section(".mutex_array"))) recursive_mutex_t name = { .core = { .spin_lock = (spin_lock_t *)1 }, .owner = 0, .enter_count = 0 }
void runtime_init_mutex(void);
#define _PICO_CRITICAL_SECTION_H 
typedef struct __attribute__((__packed__)) __attribute__((__aligned__(4))) critical_section {
    spin_lock_t *spin_lock;
    uint32_t save;
} critical_section_t;
