gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
void critical_section_init(critical_section_t *crit_sec);
void critical_section_init_with_lock_num(critical_section_t *crit_sec, uint lock_num);
__inline__ __attribute__((__always_inline__)) static void critical_section_enter_blocking(critical_section_t *crit_sec) {
    crit_sec->save = spin_lock_blocking(crit_sec->spin_lock);
}
__inline__ __attribute__((__always_inline__)) static void critical_section_exit(critical_section_t *crit_sec) {
    spin_unlock(crit_sec->spin_lock, crit_sec->save);
}
void critical_section_deinit(critical_section_t *crit_sec);
static inline _Bool critical_section_is_initialized(critical_section_t *crit_sec) {
    return crit_sec->spin_lock != 0;
}
#define PARAM_ASSERTIONS_ENABLED_PICO_MULTICORE 0
#define PICO_CORE1_STACK_SIZE PICO_STACK_SIZE
#define SIO_FIFO_IRQ_NUM(core) SIO_IRQ_FIFO
void multicore_reset_core1(void);
void multicore_launch_core1(void (*entry)(void));
void multicore_launch_core1_with_stack(void (*entry)(void), uint32_t *stack_bottom, size_t stack_size_bytes);
void multicore_launch_core1_raw(void (*entry)(void), uint32_t *sp, uint32_t vector_table);
static inline _Bool multicore_fifo_rvalid(void) {
    return ((sio_hw_t *)0xd0000000u)->fifo_st & 0x00000001u;
}
static inline _Bool multicore_fifo_wready(void) {
    return ((sio_hw_t *)0xd0000000u)->fifo_st & 0x00000002u;
}
void multicore_fifo_push_blocking(uint32_t data);
static inline void multicore_fifo_push_blocking_inline(uint32_t data) {
    while (!multicore_fifo_wready())
        tight_loop_contents();
    ((sio_hw_t *)0xd0000000u)->fifo_wr = data;
    __sev();
}
_Bool multicore_fifo_push_timeout_us(uint32_t data, uint64_t timeout_us);
uint32_t multicore_fifo_pop_blocking(void);
static inline uint32_t multicore_fifo_pop_blocking_inline(void) {
    while (!multicore_fifo_rvalid())
        __wfe();
    return ((sio_hw_t *)0xd0000000u)->fifo_rd;
}
_Bool multicore_fifo_pop_timeout_us(uint64_t timeout_us, uint32_t *out);
static inline void multicore_fifo_drain(void) {
    while (multicore_fifo_rvalid())
        (void) ((sio_hw_t *)0xd0000000u)->fifo_rd;
}
static inline void multicore_fifo_clear_irq(void) {
    ((sio_hw_t *)0xd0000000u)->fifo_st = 0xff;
}
static inline uint32_t multicore_fifo_get_status(void) {
    return ((sio_hw_t *)0xd0000000u)->fifo_st;
}
static inline void check_doorbell_num_param(__attribute__((__unused__)) uint doorbell_num) {
    ({if (((0 || 0) && !0)) ((!(doorbell_num >= 8u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/pico_multicore/include/pico/multicore.h", 309, __func__, "!(doorbell_num >= 8u)"));});
}
void multicore_doorbell_claim(uint doorbell_num, uint core_mask);
int multicore_doorbell_claim_unused(uint core_mask, _Bool required);
void multicore_doorbell_unclaim(uint doorbell_num, uint core_mask);
static inline void multicore_doorbell_set_other_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    ((sio_hw_t *)0xd0000000u)->doorbell_out_set = 1u << doorbell_num;
}
static inline void multicore_doorbell_clear_other_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    ((sio_hw_t *)0xd0000000u)->doorbell_out_clr = 1u << doorbell_num;
}
static inline void multicore_doorbell_set_current_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    ((sio_hw_t *)0xd0000000u)->doorbell_in_set = 1u << doorbell_num;
}
static inline void multicore_doorbell_clear_current_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    ((sio_hw_t *)0xd0000000u)->doorbell_in_clr = 1u << doorbell_num;
}
static inline _Bool multicore_doorbell_is_set_current_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    return ((sio_hw_t *)0xd0000000u)->doorbell_in_set & (1u << doorbell_num);
}
static inline _Bool multicore_doorbell_is_set_other_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    return ((sio_hw_t *)0xd0000000u)->doorbell_out_set & (1u << doorbell_num);
}
#define DOORBELL_IRQ_NUM(doorbell_num) SIO_IRQ_BELL
static inline uint multicore_doorbell_irq_num(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    return SIO_IRQ_BELL;
}
void multicore_lockout_victim_init(void);
void multicore_lockout_victim_deinit(void);
_Bool multicore_lockout_victim_is_initialized(uint core_num);
void multicore_lockout_start_blocking(void);
_Bool multicore_lockout_start_timeout_us(uint64_t timeout_us);
void multicore_lockout_end_blocking(void);
_Bool multicore_lockout_end_timeout_us(uint64_t timeout_us);
#define _PICO_SHA256_H 
typedef struct pico_sha256_state {
    enum sha256_endianness endianness;
    int8_t channel;
    _Bool locked;
    uint8_t cache_used;
    union {
        uint32_t word;
        uint8_t bytes[4];
    } cache;
    dma_channel_config config;
    size_t total_data_size;
} pico_sha256_state_t;
void pico_sha256_cleanup(pico_sha256_state_t *state);
int pico_sha256_try_start(pico_sha256_state_t *state, enum sha256_endianness endianness, _Bool use_dma);
int pico_sha256_start_blocking_until(pico_sha256_state_t *state, enum sha256_endianness endianness, _Bool use_dma, absolute_time_t until);
static inline int pico_sha256_start_blocking(pico_sha256_state_t *state, enum sha256_endianness endianness, _Bool use_dma) {
    return pico_sha256_start_blocking_until(state, endianness, use_dma, at_the_end_of_time);
}
void pico_sha256_update(pico_sha256_state_t *state, const uint8_t *data, size_t data_size_bytes);
void pico_sha256_update_blocking(pico_sha256_state_t *state, const uint8_t *data, size_t data_size_bytes);
void pico_sha256_finish(pico_sha256_state_t *state, sha256_result_t *out);
#define _PICO_STATUS_LED_H 
#define CYW43_INCLUDED_CYW43_H 
#define _CYW43_CONFIGPORT_H 
#define CYW43_HOST_NAME "PicoW"
#define CYW43_GPIO 1
#define CYW43_LOGIC_DEBUG 0
#define CYW43_USE_OTP_MAC 1
#define CYW43_NO_NETUTILS 1
#define CYW43_IOCTL_TIMEOUT_US 1000000
#define CYW43_USE_STATS 0
#define CYW43_HAL_MAC_WLAN0 0
#define STATIC static
#define CYW43_USE_SPI 1
#define CYW43_SPI_PIO 1
#define CYW43_CHIPSET_FIRMWARE_INCLUDE_FILE "w43439A0_7_95_49_00_combined.h"
#define CYW43_WIFI_NVRAM_INCLUDE_FILE "wifi_nvram_43439.h"
#define CYW43_EPERM (-PICO_ERROR_NOT_PERMITTED)
#define CYW43_EIO (-PICO_ERROR_IO)
#define CYW43_EINVAL (-PICO_ERROR_INVALID_ARG)
#define CYW43_ETIMEDOUT (-PICO_ERROR_TIMEOUT)
#define CYW43_NUM_GPIOS CYW43_WL_GPIO_COUNT
#define cyw43_hal_pin_obj_t uint
#define CYW43_ARRAY_SIZE(a) count_of(a)
static inline uint32_t cyw43_hal_ticks_us(void) {
    return time_us_32();
}
static inline uint32_t cyw43_hal_ticks_ms(void) {
    return to_ms_since_boot(get_absolute_time());
}
#define CYW43_PIN_WL_REG_ON CYW43_DEFAULT_PIN_WL_REG_ON
#define CYW43_PIN_WL_DATA_OUT CYW43_DEFAULT_PIN_WL_DATA_OUT
#define CYW43_PIN_WL_DATA_IN CYW43_DEFAULT_PIN_WL_DATA_IN
#define CYW43_PIN_WL_HOST_WAKE CYW43_DEFAULT_PIN_WL_HOST_WAKE
#define CYW43_PIN_WL_CLOCK CYW43_DEFAULT_PIN_WL_CLOCK
#define CYW43_PIN_WL_CS CYW43_DEFAULT_PIN_WL_CS
static inline int cyw43_hal_pin_read(uint pin) {
    return gpio_get(pin);
}
static inline void cyw43_hal_pin_low(uint pin) {
    gpio_put(pin, 0);
}
static inline void cyw43_hal_pin_high(uint pin) {
    gpio_put(pin, 1);
}
#define CYW43_HAL_PIN_MODE_INPUT (GPIO_IN)
#define CYW43_HAL_PIN_MODE_OUTPUT (GPIO_OUT)
#define CYW43_HAL_PIN_PULL_NONE (0)
#define CYW43_HAL_PIN_PULL_UP (1)
#define CYW43_HAL_PIN_PULL_DOWN (2)
static inline void cyw43_hal_pin_config(uint pin, uint32_t mode, uint32_t pull, __attribute__((__unused__)) uint32_t alt) {
    (((mode == (GPIO_IN) || mode == (GPIO_OUT)) && alt == 0) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/pico_cyw43_driver/include/cyw43_configport.h", 155, __func__, "(mode == CYW43_HAL_PIN_MODE_INPUT || mode == CYW43_HAL_PIN_MODE_OUTPUT) && alt == 0"));
    gpio_set_dir(pin, mode);
    gpio_set_pulls(pin, pull == (1), pull == (2));
}
void cyw43_hal_get_mac(int idx, uint8_t buf[6]);
void cyw43_hal_generate_laa_mac(int idx, uint8_t buf[6]);
void cyw43_thread_enter(void);
void cyw43_thread_exit(void);
#define CYW43_THREAD_ENTER cyw43_thread_enter();
#define CYW43_THREAD_EXIT cyw43_thread_exit();
void cyw43_thread_lock_check(void);
#define cyw43_arch_lwip_check() cyw43_thread_lock_check()
#define CYW43_THREAD_LOCK_CHECK cyw43_arch_lwip_check();
void cyw43_await_background_or_timeout_us(uint32_t timeout_us);
#define CYW43_SDPCM_SEND_COMMON_WAIT cyw43_await_background_or_timeout_us(1000);
#define CYW43_DO_IOCTL_WAIT cyw43_await_background_or_timeout_us(1000);
void cyw43_delay_ms(uint32_t ms);
void cyw43_delay_us(uint32_t us);
void cyw43_schedule_internal_poll_dispatch(void (*func)(void));
void cyw43_post_poll_hook(void);
#define CYW43_POST_POLL_HOOK cyw43_post_poll_hook();
#define cyw43_malloc malloc
#define cyw43_free free
#define PICO_CYW43_LOGGING_ENABLED 1
#define CYW43_CLEAR_SDIO_INT (0)
#define CYW43_INCLUDE_LEGACY_F1_OVERFLOW_WORKAROUND_VARIABLES (0)
#define CYW43_ENABLE_BLUETOOTH (0)
#define CYW43_ENABLE_BLUETOOTH_OVER_UART (0)
#define CYW43_RESOURCE_ATTRIBUTE __attribute__((aligned(4)))
#define CYW43_RESOURCE_VERIFY_DOWNLOAD (0)
#define CYW43_SLEEP_MAX (50)
#define CYW43_HAL_UART_READCHAR_BLOCKING_WAIT cyw43_delay_us(10)
#define CYW43_NETUTILS (0)
#define CYW43_PRINTF(...) printf(__VA_ARGS__)
#define CYW43_VDEBUG(...) (void)0
#define CYW43_VERBOSE_DEBUG 0
#define CYW43_DEBUG(...) CYW43_PRINTF(__VA_ARGS__)
#define CYW43_INFO(...) CYW43_PRINTF(__VA_ARGS__)
#define CYW43_WARN(...) CYW43_PRINTF("[CYW43] " __VA_ARGS__)
#define CYW43_FAIL_FAST_CHECK(res) (res)
#define CYW43_EVENT_POLL_HOOK 
#define CYW43_DEFAULT_IP_STA_ADDRESS LWIP_MAKEU32(0, 0, 0, 0)
#define CYW43_DEFAULT_IP_AP_ADDRESS LWIP_MAKEU32(192, 168, 4, 1)
#define CYW43_DEFAULT_IP_MASK LWIP_MAKEU32(255, 255, 255, 0)
#define CYW43_DEFAULT_IP_STA_GATEWAY LWIP_MAKEU32(192, 168, 0, 1)
#define CYW43_DEFAULT_IP_AP_GATEWAY LWIP_MAKEU32(192, 168, 4, 1)
#define CYW43_DEFAULT_IP_DNS LWIP_MAKEU32(8, 8, 8, 8)
#define CYW43_CB_TCPIP_INIT_EXTRA(self,itf) do { } while (0)
#define CYW43_CB_TCPIP_DEINIT_EXTRA(self,itf) do { } while (0)
#define LWIP_HDR_DHCP_H 
#define LWIP_HDR_UDP_H 
#define LWIP_HDR_PROT_UDP_H 
#define UDP_HLEN 8

struct udp_hdr {
  u16_t src;
  u16_t dest;
  u16_t len;
  u16_t chksum;
} __attribute__ ((__packed__));

#define UDP_FLAGS_NOCHKSUM 0x01U
#define UDP_FLAGS_UDPLITE 0x02U
#define UDP_FLAGS_CONNECTED 0x04U
#define UDP_FLAGS_MULTICAST_LOOP 0x08U
struct udp_pcb;
typedef void (*udp_recv_fn)(void *arg, struct udp_pcb *pcb, struct pbuf *p,
    const ip_addr_t *addr, u16_t port);
struct udp_pcb {
  ip_addr_t local_ip; ip_addr_t remote_ip; u8_t netif_idx; u8_t so_options; u8_t tos; u8_t ttl ;
  struct udp_pcb *next;
  u8_t flags;
  u16_t local_port, remote_port;
  udp_recv_fn recv;
  void *recv_arg;
};
extern struct udp_pcb *udp_pcbs;
struct udp_pcb * udp_new (void);
struct udp_pcb * udp_new_ip_type(u8_t type);
void udp_remove (struct udp_pcb *pcb);
err_t udp_bind (struct udp_pcb *pcb, const ip_addr_t *ipaddr,
                                 u16_t port);
void udp_bind_netif (struct udp_pcb *pcb, const struct netif* netif);
err_t udp_connect (struct udp_pcb *pcb, const ip_addr_t *ipaddr,
                                 u16_t port);
void udp_disconnect (struct udp_pcb *pcb);
void udp_recv (struct udp_pcb *pcb, udp_recv_fn recv,
                                 void *recv_arg);
err_t udp_sendto_if (struct udp_pcb *pcb, struct pbuf *p,
                                 const ip_addr_t *dst_ip, u16_t dst_port,
                                 struct netif *netif);
err_t udp_sendto_if_src(struct udp_pcb *pcb, struct pbuf *p,
                                 const ip_addr_t *dst_ip, u16_t dst_port,
                                 struct netif *netif, const ip_addr_t *src_ip);
err_t udp_sendto (struct udp_pcb *pcb, struct pbuf *p,
                                 const ip_addr_t *dst_ip, u16_t dst_port);
err_t udp_send (struct udp_pcb *pcb, struct pbuf *p);
#define udp_flags(pcb) ((pcb)->flags)
#define udp_setflags(pcb,f) ((pcb)->flags = (f))
#define udp_set_flags(pcb,set_flags) do { (pcb)->flags = (u8_t)((pcb)->flags | (set_flags)); } while(0)
#define udp_clear_flags(pcb,clr_flags) do { (pcb)->flags = (u8_t)((pcb)->flags & (u8_t)(~(clr_flags) & 0xff)); } while(0)
#define udp_is_flag_set(pcb,flag) (((pcb)->flags & (flag)) != 0)
void udp_input (struct pbuf *p, struct netif *inp);
void udp_init (void);
#define udp_new_ip6() udp_new_ip_type(IPADDR_TYPE_V6)
#define udp_debug_print(udphdr) 
void udp_netif_ip_addr_changed(const ip_addr_t* old_addr, const ip_addr_t* new_addr);
typedef u16_t dhcp_timeout_t;
#define DHCP_COARSE_TIMER_SECS 60
#define DHCP_COARSE_TIMER_MSECS (DHCP_COARSE_TIMER_SECS * 1000UL)
#define DHCP_FINE_TIMER_MSECS 500
#define DHCP_BOOT_FILE_LEN 128U
#define DHCP_FLAG_SUBNET_MASK_GIVEN 0x01
#define DHCP_FLAG_EXTERNAL_MEM 0x02
typedef enum {
  DHCP_AUTOIP_COOP_STATE_OFF = 0,
  DHCP_AUTOIP_COOP_STATE_ON = 1
} dhcp_autoip_coop_state_enum_t;
