gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
struct dhcp
{
  u32_t xid;
  u8_t pcb_allocated;
  u8_t state;
  u8_t tries;
  u8_t flags;
  dhcp_timeout_t request_timeout;
  dhcp_timeout_t t1_timeout;
  dhcp_timeout_t t2_timeout;
  dhcp_timeout_t t1_renew_time;
  dhcp_timeout_t t2_rebind_time;
  dhcp_timeout_t lease_used;
  dhcp_timeout_t t0_timeout;
  ip_addr_t server_ip_addr;
  ip4_addr_t offered_ip_addr;
  ip4_addr_t offered_sn_mask;
  ip4_addr_t offered_gw_addr;
  u32_t offered_t0_lease;
  u32_t offered_t1_renew;
  u32_t offered_t2_rebind;
};
void dhcp_set_struct(struct netif *netif, struct dhcp *dhcp);
#define dhcp_remove_struct(netif) netif_set_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP, NULL)
void dhcp_cleanup(struct netif *netif);
err_t dhcp_start(struct netif *netif);
err_t dhcp_renew(struct netif *netif);
err_t dhcp_release(struct netif *netif);
void dhcp_stop(struct netif *netif);
void dhcp_release_and_stop(struct netif *netif);
void dhcp_inform(struct netif *netif);
void dhcp_network_changed_link_up(struct netif *netif);
u8_t dhcp_supplied_address(const struct netif *netif);
void dhcp_coarse_tmr(void);
void dhcp_fine_tmr(void);
#define netif_dhcp_data(netif) ((struct dhcp*)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP))
#define CYW43_INCLUDED_CYW43_LL_H 
#define CYW43_IOCTL_GET_SSID (0x32)
#define CYW43_IOCTL_GET_CHANNEL (0x3a)
#define CYW43_IOCTL_SET_DISASSOC (0x69)
#define CYW43_IOCTL_GET_ANTDIV (0x7e)
#define CYW43_IOCTL_SET_ANTDIV (0x81)
#define CYW43_IOCTL_SET_MONITOR (0xd9)
#define CYW43_IOCTL_GET_RSSI (0xfe)
#define CYW43_IOCTL_GET_VAR (0x20c)
#define CYW43_IOCTL_SET_VAR (0x20f)
#define CYW43_EV_SET_SSID (0)
#define CYW43_EV_JOIN (1)
#define CYW43_EV_AUTH (3)
#define CYW43_EV_DEAUTH (5)
#define CYW43_EV_DEAUTH_IND (6)
#define CYW43_EV_ASSOC (7)
#define CYW43_EV_DISASSOC (11)
#define CYW43_EV_DISASSOC_IND (12)
#define CYW43_EV_LINK (16)
#define CYW43_EV_PRUNE (23)
#define CYW43_EV_PSK_SUP (46)
#define CYW43_EV_ICV_ERROR (49)
#define CYW43_EV_ESCAN_RESULT (69)
#define CYW43_EV_CSA_COMPLETE_IND (80)
#define CYW43_EV_ASSOC_REQ_IE (87)
#define CYW43_EV_ASSOC_RESP_IE (88)
#define CYW43_STATUS_SUCCESS (0)
#define CYW43_STATUS_FAIL (1)
#define CYW43_STATUS_TIMEOUT (2)
#define CYW43_STATUS_NO_NETWORKS (3)
#define CYW43_STATUS_ABORT (4)
#define CYW43_STATUS_NO_ACK (5)
#define CYW43_STATUS_UNSOLICITED (6)
#define CYW43_STATUS_ATTEMPT (7)
#define CYW43_STATUS_PARTIAL (8)
#define CYW43_STATUS_NEWSCAN (9)
#define CYW43_STATUS_NEWASSOC (10)
#define CYW43_SUP_DISCONNECTED (0)
#define CYW43_SUP_CONNECTING (1)
#define CYW43_SUP_IDREQUIRED (2)
#define CYW43_SUP_AUTHENTICATING (3)
#define CYW43_SUP_AUTHENTICATED (4)
#define CYW43_SUP_KEYXCHANGE (5)
#define CYW43_SUP_KEYED (6)
#define CYW43_SUP_TIMEOUT (7)
#define CYW43_SUP_LAST_BASIC_STATE (8)
#define CYW43_SUP_KEYXCHANGE_WAIT_M1 CYW43_SUP_AUTHENTICATED
#define CYW43_SUP_KEYXCHANGE_PREP_M2 CYW43_SUP_KEYXCHANGE
#define CYW43_SUP_KEYXCHANGE_WAIT_M3 CYW43_SUP_LAST_BASIC_STATE
#define CYW43_SUP_KEYXCHANGE_PREP_M4 (9)
#define CYW43_SUP_KEYXCHANGE_WAIT_G1 (10)
#define CYW43_SUP_KEYXCHANGE_PREP_G2 (11)
#define CYW43_REASON_INITIAL_ASSOC (0)
#define CYW43_REASON_LOW_RSSI (1)
#define CYW43_REASON_DEAUTH (2)
#define CYW43_REASON_DISASSOC (3)
#define CYW43_REASON_BCNS_LOST (4)
#define CYW43_REASON_FAST_ROAM_FAILED (5)
#define CYW43_REASON_DIRECTED_ROAM (6)
#define CYW43_REASON_TSPEC_REJECTED (7)
#define CYW43_REASON_BETTER_AP (8)
#define CYW43_REASON_PRUNE_ENCR_MISMATCH (1)
#define CYW43_REASON_PRUNE_BCAST_BSSID (2)
#define CYW43_REASON_PRUNE_MAC_DENY (3)
#define CYW43_REASON_PRUNE_MAC_NA (4)
#define CYW43_REASON_PRUNE_REG_PASSV (5)
#define CYW43_REASON_PRUNE_SPCT_MGMT (6)
#define CYW43_REASON_PRUNE_RADAR (7)
#define CYW43_REASON_RSN_MISMATCH (8)
#define CYW43_REASON_PRUNE_NO_COMMON_RATES (9)
#define CYW43_REASON_PRUNE_BASIC_RATES (10)
#define CYW43_REASON_PRUNE_CCXFAST_PREVAP (11)
#define CYW43_REASON_PRUNE_CIPHER_NA (12)
#define CYW43_REASON_PRUNE_KNOWN_STA (13)
#define CYW43_REASON_PRUNE_CCXFAST_DROAM (14)
#define CYW43_REASON_PRUNE_WDS_PEER (15)
#define CYW43_REASON_PRUNE_QBSS_LOAD (16)
#define CYW43_REASON_PRUNE_HOME_AP (17)
#define CYW43_REASON_PRUNE_AP_BLOCKED (18)
#define CYW43_REASON_PRUNE_NO_DIAG_SUPPORT (19)
#define CYW43_REASON_SUP_OTHER (0)
#define CYW43_REASON_SUP_DECRYPT_KEY_DATA (1)
#define CYW43_REASON_SUP_BAD_UCAST_WEP128 (2)
#define CYW43_REASON_SUP_BAD_UCAST_WEP40 (3)
#define CYW43_REASON_SUP_UNSUP_KEY_LEN (4)
#define CYW43_REASON_SUP_PW_KEY_CIPHER (5)
#define CYW43_REASON_SUP_MSG3_TOO_MANY_IE (6)
#define CYW43_REASON_SUP_MSG3_IE_MISMATCH (7)
#define CYW43_REASON_SUP_NO_INSTALL_FLAG (8)
#define CYW43_REASON_SUP_MSG3_NO_GTK (9)
#define CYW43_REASON_SUP_GRP_KEY_CIPHER (10)
#define CYW43_REASON_SUP_GRP_MSG1_NO_GTK (11)
#define CYW43_REASON_SUP_GTK_DECRYPT_FAIL (12)
#define CYW43_REASON_SUP_SEND_FAIL (13)
#define CYW43_REASON_SUP_DEAUTH (14)
#define CYW43_REASON_SUP_WPA_PSK_TMO (15)
#define CYW43_AUTH_OPEN (0)
#define CYW43_AUTH_WPA_TKIP_PSK (0x00200002)
#define CYW43_AUTH_WPA2_AES_PSK (0x00400004)
#define CYW43_AUTH_WPA2_MIXED_PSK (0x00400006)
#define CYW43_AUTH_WPA3_SAE_AES_PSK (0x01000004)
#define CYW43_AUTH_WPA3_WPA2_AES_PSK (0x01400004)
#define CYW43_NO_POWERSAVE_MODE (0)
#define CYW43_PM1_POWERSAVE_MODE (1)
#define CYW43_PM2_POWERSAVE_MODE (2)
#define CYW43_BUS_MAX_BLOCK_SIZE 64
#define CYW43_BACKPLANE_READ_PAD_LEN_BYTES 16
#define CYW43_LL_STATE_SIZE_WORDS (526 + 1 + ((CYW43_BACKPLANE_READ_PAD_LEN_BYTES / 4) + 1) + CYW43_INCLUDE_LEGACY_F1_OVERFLOW_WORKAROUND_VARIABLES * 4)
#define CYW43_CHANNEL_NONE (0xffffffff)
enum {
    CYW43_ITF_STA,
    CYW43_ITF_AP,
};
typedef struct _cyw43_ev_scan_result_t {
    uint32_t _0[5];
    uint8_t bssid[6];
    uint16_t _1[2];
    uint8_t ssid_len;
    uint8_t ssid[32];
    uint32_t _2[5];
    uint16_t channel;
    uint16_t _3;
    uint8_t auth_mode;
    int16_t rssi;
} cyw43_ev_scan_result_t;
typedef struct _cyw43_async_event_t {
    uint16_t _0;
    uint16_t flags;
    uint32_t event_type;
    uint32_t status;
    uint32_t reason;
    uint8_t _1[30];
    uint8_t interface;
    uint8_t _2;
    union {
        cyw43_ev_scan_result_t scan_result;
    } u;
} cyw43_async_event_t;
typedef struct _cyw43_wifi_scan_options_t {
    uint32_t version;
    uint16_t action;
    uint16_t _;
    uint32_t ssid_len;
    uint8_t ssid[32];
    uint8_t bssid[6];
    int8_t bss_type;
    int8_t scan_type;
    int32_t nprobes;
    int32_t active_time;
    int32_t passive_time;
    int32_t home_time;
    int32_t channel_num;
    uint16_t channel_list[1];
} cyw43_wifi_scan_options_t;
typedef struct _cyw43_ll_t {
    uint32_t opaque[(526 + 1 + ((16 / 4) + 1) + (0) * 4)];
} cyw43_ll_t;
void cyw43_ll_init(cyw43_ll_t *self, void *cb_data);
void cyw43_ll_deinit(cyw43_ll_t *self);
int cyw43_ll_bus_init(cyw43_ll_t *self, const uint8_t *mac);
void cyw43_ll_bus_sleep(cyw43_ll_t *self, _Bool can_sleep);
void cyw43_ll_process_packets(cyw43_ll_t *self);
int cyw43_ll_ioctl(cyw43_ll_t *self, uint32_t cmd, size_t len, uint8_t *buf, uint32_t iface);
int cyw43_ll_send_ethernet(cyw43_ll_t *self, int itf, size_t len, const void *buf, _Bool is_pbuf);
int cyw43_ll_wifi_on(cyw43_ll_t *self, uint32_t country);
int cyw43_ll_wifi_pm(cyw43_ll_t *self, uint32_t pm, uint32_t pm_sleep_ret, uint32_t li_bcn, uint32_t li_dtim, uint32_t li_assoc);
int cyw43_ll_wifi_get_pm(cyw43_ll_t *self, uint32_t *pm, uint32_t *pm_sleep_ret, uint32_t *li_bcn, uint32_t *li_dtim, uint32_t *li_assoc);
int cyw43_ll_wifi_scan(cyw43_ll_t *self, cyw43_wifi_scan_options_t *opts);
int cyw43_ll_wifi_join(cyw43_ll_t *self, size_t ssid_len, const uint8_t *ssid, size_t key_len, const uint8_t *key, uint32_t auth_type, const uint8_t *bssid, uint32_t channel);
void cyw43_ll_wifi_set_wpa_auth(cyw43_ll_t *self);
void cyw43_ll_wifi_rejoin(cyw43_ll_t *self);
int cyw43_ll_wifi_get_bssid(cyw43_ll_t *self_in, uint8_t *bssid);
int cyw43_ll_wifi_ap_init(cyw43_ll_t *self, size_t ssid_len, const uint8_t *ssid, uint32_t auth, size_t key_len, const uint8_t *key, uint32_t channel);
int cyw43_ll_wifi_ap_set_up(cyw43_ll_t *self, _Bool up);
int cyw43_ll_wifi_ap_get_stas(cyw43_ll_t *self, int *num_stas, uint8_t *macs);
int cyw43_ll_gpio_set(cyw43_ll_t *self, int gpio_n, _Bool gpio_en);
int cyw43_ll_gpio_get(cyw43_ll_t *self_in, int gpio_n, _Bool *gpio_en);
int cyw43_ll_wifi_get_mac(cyw43_ll_t *self_in, uint8_t *addr);
int cyw43_ll_wifi_update_multicast_filter(cyw43_ll_t *self_in, uint8_t *addr, _Bool add);
_Bool cyw43_ll_has_work(cyw43_ll_t *self);
_Bool cyw43_ll_bt_has_work(cyw43_ll_t *self);
int cyw43_cb_read_host_interrupt_pin(void *cb_data);
void cyw43_cb_ensure_awake(void *cb_data);
void cyw43_cb_process_async_event(void *cb_data, const cyw43_async_event_t *ev);
void cyw43_cb_process_ethernet(void *cb_data, int itf, size_t len, const uint8_t *buf);
void cyw43_ll_write_backplane_reg(cyw43_ll_t *self_in, uint32_t addr, uint32_t val);
uint32_t cyw43_ll_read_backplane_reg(cyw43_ll_t *self_in, uint32_t addr);
int cyw43_ll_write_backplane_mem(cyw43_ll_t *self_in, uint32_t addr, uint32_t len, const uint8_t *buf);
int cyw43_ll_read_backplane_mem(cyw43_ll_t *self_in, uint32_t addr, uint32_t len, uint8_t *buf);
#define _STRING_H_ 
#define __need_size_t 
#define __need_NULL 
#undef __need_ptrdiff_t
#undef __need_size_t
#undef __need_wchar_t
#undef NULL
#define NULL ((void *)0)
#undef __need_NULL
#undef offsetof
#define offsetof(TYPE,MEMBER) __builtin_offsetof (TYPE, MEMBER)
#define _STRINGS_H_ 

int bcmp(const void *, const void *, size_t) __attribute__((__pure__));
void bcopy(const void *, void *, size_t);
void bzero(void *, size_t);
void explicit_bzero(void *, size_t);
int ffs(int) __attribute__((__const__));
int ffsl(long) __attribute__((__const__));
int ffsll(long long) __attribute__((__const__));
int fls(int) __attribute__((__const__));
int flsl(long) __attribute__((__const__));
int flsll(long long) __attribute__((__const__));
char *index(const char *, int) __attribute__((__pure__));
char *rindex(const char *, int) __attribute__((__pure__));
int strcasecmp(const char *, const char *) __attribute__((__pure__));
int strncasecmp(const char *, const char *, size_t) __attribute__((__pure__));
int strcasecmp_l (const char *, const char *, locale_t);
int strncasecmp_l (const char *, const char *, size_t, locale_t);


void * memchr (const void *, int, size_t);
int memcmp (const void *, const void *, size_t);
void * memcpy (void *restrict, const void *restrict, size_t);
void * memmove (void *, const void *, size_t);
void * memset (void *, int, size_t);
char *strcat (char *restrict, const char *restrict);
char *strchr (const char *, int);
int strcmp (const char *, const char *);
int strcoll (const char *, const char *);
char *strcpy (char *restrict, const char *restrict);
size_t strcspn (const char *, const char *);
char *strerror (int);
size_t strlen (const char *);
char *strncat (char *restrict, const char *restrict, size_t);
int strncmp (const char *, const char *, size_t);
char *strncpy (char *restrict, const char *restrict, size_t);
char *strpbrk (const char *, const char *);
char *strrchr (const char *, int);
size_t strspn (const char *, const char *);
char *strstr (const char *, const char *);
char *strtok (char *restrict, const char *restrict);
size_t strxfrm (char *restrict, const char *restrict, size_t);
int strcoll_l (const char *, const char *, locale_t);
char *strerror_l (int, locale_t);
size_t strxfrm_l (char *restrict, const char *restrict, size_t, locale_t);
char *strtok_r (char *restrict, const char *restrict, char **restrict);
int timingsafe_bcmp (const void *, const void *, size_t);
int timingsafe_memcmp (const void *, const void *, size_t);
void * memccpy (void *restrict, const void *restrict, int, size_t);
char *stpcpy (char *restrict, const char *restrict);
char *stpncpy (char *restrict, const char *restrict, size_t);
char *strdup (const char *) __attribute__((__malloc__)) __attribute__((__warn_unused_result__));
char *_strdup_r (struct _reent *, const char *);
char *strndup (const char *, size_t) __attribute__((__malloc__)) __attribute__((__warn_unused_result__));
char *_strndup_r (struct _reent *, const char *, size_t);
int strerror_r (int, char *, size_t)
             __asm__ ("" "__xpg_strerror_r")
  ;
char * _strerror_r (struct _reent *, int, int, int *);
size_t strlcat (char *, const char *, size_t);
size_t strlcpy (char *, const char *, size_t);
size_t strnlen (const char *, size_t);
char *strsep (char **, const char *);
char *strnstr(const char *, const char *, size_t) __attribute__((__pure__));
char *strlwr (char *);
char *strupr (char *);
char *strsignal (int __signo);

