gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
#define CYW43_VERSION_MAJOR 1
#define CYW43_VERSION_MINOR 1
#define CYW43_VERSION_MICRO 0
#define CYW43_VERSION (CYW43_VERSION_MAJOR << 16 | CYW43_VERSION_MINOR << 8 | CYW43_VERSION_MICRO)
#define CYW43_TRACE_ASYNC_EV (0x0001)
#define CYW43_TRACE_ETH_TX (0x0002)
#define CYW43_TRACE_ETH_RX (0x0004)
#define CYW43_TRACE_ETH_FULL (0x0008)
#define CYW43_TRACE_MAC (0x0010)
#define CYW43_LINK_DOWN (0)
#define CYW43_LINK_JOIN (1)
#define CYW43_LINK_NOIP (2)
#define CYW43_LINK_UP (3)
#define CYW43_LINK_FAIL (-1)
#define CYW43_LINK_NONET (-2)
#define CYW43_LINK_BADAUTH (-3)
typedef struct _cyw43_t {
    cyw43_ll_t cyw43_ll;
    uint8_t itf_state;
    uint32_t trace_flags;
    volatile uint32_t wifi_scan_state;
    uint32_t wifi_join_state;
    void *wifi_scan_env;
    int (*wifi_scan_cb)(void *, const cyw43_ev_scan_result_t *);
    _Bool initted;
    _Bool pend_disassoc;
    _Bool pend_rejoin;
    _Bool pend_rejoin_wpa;
    uint32_t ap_auth;
    uint8_t ap_channel;
    uint8_t ap_ssid_len;
    uint8_t ap_key_len;
    uint8_t ap_ssid[32];
    uint8_t ap_key[64];
    struct netif netif[2];
    struct dhcp dhcp_client;
    uint8_t mac[6];
} cyw43_t;
extern cyw43_t cyw43_state;
extern void (*cyw43_poll)(void);
extern uint32_t cyw43_sleep;
void cyw43_init(cyw43_t *self);
void cyw43_deinit(cyw43_t *self);
int cyw43_ioctl(cyw43_t *self, uint32_t cmd, size_t len, uint8_t *buf, uint32_t iface);
int cyw43_send_ethernet(cyw43_t *self, int itf, size_t len, const void *buf, _Bool is_pbuf);
int cyw43_wifi_pm(cyw43_t *self, uint32_t pm);
int cyw43_wifi_get_pm(cyw43_t *self, uint32_t *pm);
int cyw43_wifi_link_status(cyw43_t *self, int itf);
void cyw43_wifi_set_up(cyw43_t *self, int itf, _Bool up, uint32_t country);
int cyw43_wifi_get_mac(cyw43_t *self, int itf, uint8_t mac[6]);
int cyw43_wifi_update_multicast_filter(cyw43_t *self, uint8_t *addr, _Bool add);
int cyw43_wifi_scan(cyw43_t *self, cyw43_wifi_scan_options_t *opts, void *env, int (*result_cb)(void *, const cyw43_ev_scan_result_t *));
static inline _Bool cyw43_wifi_scan_active(cyw43_t *self) {
    return self->wifi_scan_state == 1;
}
int cyw43_wifi_join(cyw43_t *self, size_t ssid_len, const uint8_t *ssid, size_t key_len, const uint8_t *key, uint32_t auth_type, const uint8_t *bssid, uint32_t channel);
int cyw43_wifi_leave(cyw43_t *self, int itf);
int cyw43_wifi_get_rssi(cyw43_t *self, int32_t *rssi);
int cyw43_wifi_get_bssid(cyw43_t *self, uint8_t bssid[6]);
static inline void cyw43_wifi_ap_get_ssid(cyw43_t *self, size_t *len, const uint8_t **buf) {
    *len = self->ap_ssid_len;
    *buf = self->ap_ssid;
}
static inline uint32_t cyw43_wifi_ap_get_auth(cyw43_t *self) {
    return self->ap_auth;
}
static inline void cyw43_wifi_ap_set_channel(cyw43_t *self, uint32_t channel) {
    self->ap_channel = (uint8_t)channel;
}
static inline void cyw43_wifi_ap_set_ssid(cyw43_t *self, size_t len, const uint8_t *buf) {
    self->ap_ssid_len = (uint8_t)((sizeof(self->ap_ssid))>(len)?(len):(sizeof(self->ap_ssid)));
    memcpy(self->ap_ssid, buf, self->ap_ssid_len);
}
static inline void cyw43_wifi_ap_set_password(cyw43_t *self, size_t len, const uint8_t *buf) {
    self->ap_key_len = (uint8_t)((sizeof(self->ap_key))>(len)?(len):(sizeof(self->ap_key)));
    memcpy(self->ap_key, buf, self->ap_key_len);
}
static inline void cyw43_wifi_ap_set_auth(cyw43_t *self, uint32_t auth) {
    self->ap_auth = auth;
}
void cyw43_wifi_ap_get_max_stas(cyw43_t *self, int *max_stas);
void cyw43_wifi_ap_get_stas(cyw43_t *self, int *num_stas, uint8_t *macs);
static inline _Bool cyw43_is_initialized(cyw43_t *self) {
    return self->initted;
}
void cyw43_cb_tcpip_init(cyw43_t *self, int itf);
void cyw43_cb_tcpip_deinit(cyw43_t *self, int itf);
void cyw43_cb_tcpip_set_link_up(cyw43_t *self, int itf);
void cyw43_cb_tcpip_set_link_down(cyw43_t *self, int itf);
int cyw43_tcpip_link_status(cyw43_t *self, int itf);
int cyw43_gpio_set(cyw43_t *self, int gpio, _Bool val);
int cyw43_gpio_get(cyw43_t *self, int gpio, _Bool *val);
static inline uint32_t cyw43_pm_value(uint8_t pm_mode, uint16_t pm2_sleep_ret_ms, uint8_t li_beacon_period, uint8_t li_dtim_period, uint8_t li_assoc) {
    return li_assoc << 20
           | li_dtim_period << 16
           | li_beacon_period << 12
           | (pm2_sleep_ret_ms / 10) << 4
           | pm_mode;
}
#define CYW43_DEFAULT_PM (CYW43_PERFORMANCE_PM)
#define CYW43_NONE_PM (cyw43_pm_value(CYW43_NO_POWERSAVE_MODE, 10, 0, 0, 0))
#define CYW43_AGGRESSIVE_PM (cyw43_pm_value(CYW43_PM1_POWERSAVE_MODE, 10, 0, 0, 0))
#define CYW43_PERFORMANCE_PM (cyw43_pm_value(CYW43_PM2_POWERSAVE_MODE, 200, 1, 1, 10))
struct async_context;
#define PICO_STATUS_LED_AVAILABLE 1
#define PICO_COLORED_STATUS_LED_AVAILABLE 0
#define PICO_STATUS_LED_VIA_COLORED_STATUS_LED (PICO_COLORED_STATUS_LED_AVAILABLE && !PICO_STATUS_LED_AVAILABLE)
#define PICO_COLORED_STATUS_LED_USES_WRGB 0
#define PICO_COLORED_STATUS_LED_COLOR_FROM_RGB(r,g,b) (((r) << 16) | ((g) << 8) | (b))
#define PICO_COLORED_STATUS_LED_COLOR_FROM_WRGB(w,r,g,b) (((w) << 24) | ((r) << 16) | ((g) << 8) | (b))
#define PICO_DEFAULT_COLORED_STATUS_LED_ON_COLOR PICO_COLORED_STATUS_LED_COLOR_FROM_RGB(0xaa, 0xaa, 0xaa)
_Bool status_led_init(void);
_Bool status_led_init_with_context(struct async_context *context);
static inline _Bool colored_status_led_supported(void) {
    return 0;
}
static inline _Bool status_led_via_colored_status_led(void) {
    return (0 && !1);
}
static inline _Bool status_led_supported(void) {
    if (status_led_via_colored_status_led()) {
        return colored_status_led_supported();
    }
    return 1;
}
_Bool colored_status_led_set_state(_Bool led_on);
_Bool colored_status_led_get_state(void);
_Bool colored_status_led_set_on_with_color(uint32_t color);
uint32_t colored_status_led_get_on_color(void);
static inline _Bool status_led_set_state(_Bool led_on) {
    if (status_led_via_colored_status_led()) {
        return colored_status_led_set_state(led_on);
    } else if (status_led_supported()) {
        cyw43_gpio_set(&cyw43_state, 0, led_on);
        return 1;
    }
    return 0;
}
static inline _Bool status_led_get_state() {
    if (status_led_via_colored_status_led()) {
        return colored_status_led_get_state();
    } else if (status_led_supported()) {
        _Bool value = 0;
        cyw43_gpio_get(&cyw43_state, 0, &value);
        return value;
    }
    return 0;
}
void status_led_deinit();
#define _PICO_STDIO_DRIVER_H 
#define _PICO_STDIO_H 
#define PICO_STDOUT_MUTEX 1
#define PICO_STDIO_ENABLE_CRLF_SUPPORT 1
#define PICO_STDIO_DEFAULT_CRLF 1
#define PICO_STDIO_STACK_BUFFER_SIZE 128
#define PICO_STDIO_DEADLOCK_TIMEOUT_MS 1000
#define PICO_STDIO_SHORT_CIRCUIT_CLIB_FUNCS 1
#define _STDARG_H 
#define _ANSI_STDARG_H_ 
#undef __need___va_list
#define va_start(v,l) __builtin_va_start(v,l)
#define va_end(v) __builtin_va_end(v)
#define va_arg(v,l) __builtin_va_arg(v,l)
#define va_copy(d,s) __builtin_va_copy(d,s)
#define __va_copy(d,s) __builtin_va_copy(d,s)
#define _VA_LIST_ 
#define _VA_LIST 
#define _VA_LIST_T_H 
#define __va_list__ 
typedef struct stdio_driver stdio_driver_t;
_Bool stdio_init_all(void);
_Bool stdio_deinit_all(void);
void stdio_flush(void);
int stdio_getchar_timeout_us(uint32_t timeout_us);
static inline int getchar_timeout_us(uint32_t timeout_us) {
    return stdio_getchar_timeout_us(timeout_us);
}
void stdio_set_driver_enabled(stdio_driver_t *driver, _Bool enabled);
void stdio_filter_driver(stdio_driver_t *driver);
void stdio_set_translate_crlf(stdio_driver_t *driver, _Bool translate);
int stdio_putchar_raw(int c);
static inline int putchar_raw(int c) {
    return stdio_putchar_raw(c);
}
int stdio_puts_raw(const char *s);
static inline int puts_raw(const char *s) {
    return stdio_puts_raw(s);
}
void stdio_set_chars_available_callback(void (*fn)(void*), void *param);
int stdio_get_until(char *buf, int len, absolute_time_t until);
int stdio_put_string(const char *s, int len, _Bool newline, _Bool cr_translation);
int stdio_getchar(void);
int stdio_putchar(int);
int stdio_puts(const char *s);
int stdio_vprintf(const char *format, va_list va);
int __attribute__((__format__ (__printf__, 1, 0))) stdio_printf(const char* format, ...);
struct stdio_driver {
    void (*out_chars)(const char *buf, int len);
    void (*out_flush)(void);
    int (*in_chars)(char *buf, int len);
    void (*set_chars_available_callback)(void (*fn)(void*), void *param);
    stdio_driver_t *next;
    _Bool last_ended_with_cr;
    _Bool crlf_enabled;
};
#define _PICO_STDIO_RTT_H 
#define PICO_STDIO_RTT_DEFAULT_CRLF PICO_STDIO_DEFAULT_CRLF
extern stdio_driver_t stdio_rtt;
void stdio_rtt_init(void);
void stdio_rtt_deinit(void);
#define _PICO_STDIO_UART_H 
#define PICO_STDIO_UART_DEFAULT_CRLF PICO_STDIO_DEFAULT_CRLF
#define PICO_STDIO_UART_SUPPORT_CHARS_AVAILABLE_CALLBACK 1
extern stdio_driver_t stdio_uart;
void stdio_uart_init(void);
void stdout_uart_init(void);
void stdin_uart_init(void);
void stdio_uart_init_full(uart_inst_t *uart, uint baud_rate, int tx_pin, int rx_pin);
void stdio_uart_deinit(void);
void stdout_uart_deinit(void);
void stdin_uart_deinit(void);
void stdio_uart_deinit_full(uart_inst_t *uart, int tx_pin, int rx_pin);
#define _PICO_STDLIB_H 
#define _PICO_STDIO_USB_H 
#define PICO_STDIO_USB_DEFAULT_CRLF PICO_STDIO_DEFAULT_CRLF
#define PICO_STDIO_USB_STDOUT_TIMEOUT_US 500000
#define PICO_STDIO_USB_TASK_INTERVAL_US 1000
#define PICO_STDIO_USB_ENABLE_IRQ_BACKGROUND_TASK 1
#define PICO_STDIO_USB_ENABLE_TINYUSB_INIT 1
#define PICO_STDIO_USB_ENABLE_RESET_VIA_BAUD_RATE 1
#define PICO_STDIO_USB_RESET_MAGIC_BAUD_RATE 1200
#define PICO_STDIO_USB_CONNECT_WAIT_TIMEOUT_MS 0
#define PICO_STDIO_USB_POST_CONNECT_WAIT_DELAY_MS 50
#define PICO_STDIO_USB_DEINIT_DELAY_MS 110
#define PICO_STDIO_USB_RESET_BOOTSEL_ACTIVITY_LED_ACTIVE_LOW 0
#define PICO_STDIO_USB_RESET_BOOTSEL_FIXED_ACTIVITY_LED 0
#define PICO_STDIO_USB_RESET_BOOTSEL_INTERFACE_DISABLE_MASK 0u
#define PICO_STDIO_USB_ENABLE_RESET_VIA_VENDOR_INTERFACE 1
#define PICO_STDIO_USB_RESET_INTERFACE_SUPPORT_RESET_TO_BOOTSEL 1
#define PICO_STDIO_USB_RESET_INTERFACE_SUPPORT_RESET_TO_FLASH_BOOT 1
#define PICO_STDIO_USB_RESET_INTERFACE_SUPPORT_MS_OS_20_DESCRIPTOR 1
#define PICO_STDIO_USB_RESET_RESET_TO_FLASH_DELAY_MS 100
#define PICO_STDIO_USB_USE_DEFAULT_DESCRIPTORS 1
#define PICO_STDIO_USB_CONNECTION_WITHOUT_DTR 0
#define PICO_STDIO_USB_DEVICE_SELF_POWERED 0
#define PICO_STDIO_USB_SUPPORT_CHARS_AVAILABLE_CALLBACK 1
extern stdio_driver_t stdio_usb;
_Bool stdio_usb_init(void);
_Bool stdio_usb_deinit(void);
_Bool stdio_usb_connected(void);
void stdio_usb_call_chars_available_callback(void);
#define PICO_DEFAULT_LED_PIN_INVERTED 0
void setup_default_uart(void);
#define _PICO_TIMEOUT_HELPER_H 
typedef struct timeout_state {
    absolute_time_t next_timeout;
    uint64_t param;
} timeout_state_t;
typedef _Bool (*check_timeout_fn)(timeout_state_t *ts, _Bool reset);
check_timeout_fn init_single_timeout_until(timeout_state_t *ts, absolute_time_t target);
check_timeout_fn init_per_iteration_timeout_us(timeout_state_t *ts, uint64_t per_iteration_timeout_us);
#define _PICO_UNIQUE_ID_H 
#define PICO_UNIQUE_BOARD_ID_SIZE_BYTES 8
#define PICO_UNIQUE_BOARD_ID_INIT_PRIORITY 1000
typedef struct {
 uint8_t id[8];
} pico_unique_board_id_t;
void pico_get_unique_board_id(pico_unique_board_id_t *id_out);
void pico_get_unique_board_id_string(char *id_out, uint len);
#define _PICO_UTIL_PHEAP_H 
#define PARAM_ASSERTIONS_ENABLED_PHEAP 0
#define PICO_PHEAP_MAX_ENTRIES 255
typedef uint8_t pheap_node_id_t;
typedef struct pheap_node {
    pheap_node_id_t child, sibling, parent;
} pheap_node_t;
