gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_w_rp2350/include/CPicoSDK_pimoroni_pico_plus2_w_rp2350.h
typedef _Bool (*pheap_comparator)(void *user_data, pheap_node_id_t a, pheap_node_id_t b);
typedef struct pheap {
    pheap_node_t *nodes;
    pheap_comparator comparator;
    void *user_data;
    pheap_node_id_t max_nodes;
    pheap_node_id_t root_id;
    pheap_node_id_t free_head_id;
    pheap_node_id_t free_tail_id;
} pheap_t;
pheap_t *ph_create(uint max_nodes, pheap_comparator comparator, void *user_data);
void ph_clear(pheap_t *heap);
void ph_destroy(pheap_t *heap);
static inline pheap_node_t *ph_get_node(pheap_t *heap, pheap_node_id_t id) {
    ((id && id <= heap->max_nodes) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 108, __func__, "id && id <= heap->max_nodes"));
    return heap->nodes + id - 1;
}
static void ph_add_child_node(pheap_t *heap, pheap_node_id_t parent_id, pheap_node_id_t child_id) {
    pheap_node_t *n = ph_get_node(heap, parent_id);
    ((parent_id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 115, __func__, "parent_id"));
    ((child_id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 116, __func__, "child_id"));
    ((parent_id != child_id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 117, __func__, "parent_id != child_id"));
    pheap_node_t *c = ph_get_node(heap, child_id);
    c->parent = parent_id;
    if (!n->child) {
        n->child = child_id;
    } else {
        c->sibling = n->child;
        n->child = child_id;
    }
}
static pheap_node_id_t ph_merge_nodes(pheap_t *heap, pheap_node_id_t a, pheap_node_id_t b) {
    if (!a) return b;
    if (!b) return a;
    if (heap->comparator(heap->user_data, a, b)) {
        ph_add_child_node(heap, a, b);
        return a;
    } else {
        ph_add_child_node(heap, b, a);
        return b;
    }
}
static inline pheap_node_id_t ph_new_node(pheap_t *heap) {
    if (!heap->free_head_id) return 0;
    pheap_node_id_t id = heap->free_head_id;
    pheap_node_t *hn = ph_get_node(heap, id);
    heap->free_head_id = hn->sibling;
    if (!heap->free_head_id) heap->free_tail_id = 0;
    hn->child = hn->sibling = hn->parent = 0;
    return id;
}
static inline pheap_node_id_t ph_insert_node(pheap_t *heap, pheap_node_id_t id) {
    ((id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 171, __func__, "id"));
    pheap_node_t *hn = ph_get_node(heap, id);
    hn->child = hn->sibling = hn->parent = 0;
    heap->root_id = ph_merge_nodes(heap, heap->root_id, id);
    return heap->root_id;
}
static inline pheap_node_id_t ph_peek_head(pheap_t *heap) {
    return heap->root_id;
}
pheap_node_id_t ph_remove_head(pheap_t *heap, _Bool free);
static inline pheap_node_id_t ph_remove_and_free_head(pheap_t *heap) {
    return ph_remove_head(heap, 1);
}
_Bool ph_remove_and_free_node(pheap_t *heap, pheap_node_id_t id);
static inline _Bool ph_contains_node(pheap_t *heap, pheap_node_id_t id) {
    return id == heap->root_id || ph_get_node(heap, id)->parent;
}
static inline void ph_free_node(pheap_t *heap, pheap_node_id_t id) {
    ((id && !ph_contains_node(heap, id)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 258, __func__, "id && !ph_contains_node(heap, id)"));
    if (heap->free_tail_id) {
        ph_get_node(heap, heap->free_tail_id)->sibling = id;
    }
    if (!heap->free_head_id) {
        ((!heap->free_tail_id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 263, __func__, "!heap->free_tail_id"));
        heap->free_head_id = id;
    }
    heap->free_tail_id = id;
}
void ph_dump(pheap_t *heap, void (*dump_key)(pheap_node_id_t id, void *user_data), void *user_data);
void ph_post_alloc_init(pheap_t *heap, uint max_nodes, pheap_comparator comparator, void *user_data);
#define PHEAP_DEFINE_STATIC(name,_max_nodes) static_assert(_max_nodes && _max_nodes < (1u << (8 * sizeof(pheap_node_id_t))), ""); static pheap_node_t name ## _nodes[_max_nodes]; static pheap_t name = { .nodes = name ## _nodes, .max_nodes = _max_nodes };
#define _PICO_UTIL_QUEUE_H 
#define PICO_QUEUE_MAX_LEVEL 0
typedef struct {
    lock_core_t core;
    uint8_t *data;
    uint16_t wptr;
    uint16_t rptr;
    uint16_t element_size;
    uint16_t element_count;
} queue_t;
void queue_init_with_spinlock(queue_t *q, uint element_size, uint element_count, uint spinlock_num);
static inline void queue_init(queue_t *q, uint element_size, uint element_count) {
    queue_init_with_spinlock(q, element_size, element_count, next_striped_spin_lock_num());
}
void queue_free(queue_t *q);
static inline uint queue_get_level_unsafe(queue_t *q) {
    int32_t rc = (int32_t)q->wptr - (int32_t)q->rptr;
    if (rc < 0) {
        rc += q->element_count + 1;
    }
    return (uint)rc;
}
static inline uint queue_get_level(queue_t *q) {
    uint32_t save = spin_lock_blocking(q->core.spin_lock);
    uint level = queue_get_level_unsafe(q);
    spin_unlock(q->core.spin_lock, save);
    return level;
}
static inline _Bool queue_is_empty(queue_t *q) {
    return queue_get_level(q) == 0;
}
static inline _Bool queue_is_full(queue_t *q) {
    return queue_get_level(q) == q->element_count;
}
_Bool queue_try_add(queue_t *q, const void *data);
_Bool queue_try_remove(queue_t *q, void *data);
_Bool queue_try_peek(queue_t *q, void *data);
void queue_add_blocking(queue_t *q, const void *data);
void queue_remove_blocking(queue_t *q, void *data);
void queue_peek_blocking(queue_t *q, void *data);
#define _PICO_STDIO_USB_RESET_INTERFACE_H 
#define _PICO_USB_RESET_INTERFACE_H 
#define RESET_INTERFACE_SUBCLASS 0x00
#define RESET_INTERFACE_PROTOCOL 0x01
#define RESET_REQUEST_BOOTSEL 0x01
#define RESET_REQUEST_FLASH 0x02
#define _PICO_STDIO_USB_TUSB_CONFIG_H 
#define CFG_TUSB_RHPORT0_MODE (OPT_MODE_DEVICE)
#define CFG_TUD_CDC (1)
#define CFG_TUD_CDC_RX_BUFSIZE (TUD_OPT_HIGH_SPEED ? 512 : 64)
#define CFG_TUD_CDC_TX_BUFSIZE (TUD_OPT_HIGH_SPEED ? 512 : 64)
#define CFG_TUD_CDC_EP_BUFSIZE (TUD_OPT_HIGH_SPEED ? 512 : 64)
#define CFG_TUD_VENDOR (1)
#define CFG_TUD_VENDOR_RX_BUFSIZE (256)
#define CFG_TUD_VENDOR_TX_BUFSIZE (256)
#define _PICO_CYW43_ARCH_H 
#define CYW43_INCLUDED_CYW43_COUNTRY_H 
#define CYW43_COUNTRY(A,B,REV) ((unsigned char)(A) | ((unsigned char)(B) << 8) | ((REV) << 16))
#define CYW43_COUNTRY_WORLDWIDE CYW43_COUNTRY('X', 'X', 0)
#define CYW43_COUNTRY_AUSTRALIA CYW43_COUNTRY('A', 'U', 0)
#define CYW43_COUNTRY_AUSTRIA CYW43_COUNTRY('A', 'T', 0)
#define CYW43_COUNTRY_BELGIUM CYW43_COUNTRY('B', 'E', 0)
#define CYW43_COUNTRY_BRAZIL CYW43_COUNTRY('B', 'R', 0)
#define CYW43_COUNTRY_CANADA CYW43_COUNTRY('C', 'A', 0)
#define CYW43_COUNTRY_CHILE CYW43_COUNTRY('C', 'L', 0)
#define CYW43_COUNTRY_CHINA CYW43_COUNTRY('C', 'N', 0)
#define CYW43_COUNTRY_COLOMBIA CYW43_COUNTRY('C', 'O', 0)
#define CYW43_COUNTRY_CZECH_REPUBLIC CYW43_COUNTRY('C', 'Z', 0)
#define CYW43_COUNTRY_DENMARK CYW43_COUNTRY('D', 'K', 0)
#define CYW43_COUNTRY_ESTONIA CYW43_COUNTRY('E', 'E', 0)
#define CYW43_COUNTRY_FINLAND CYW43_COUNTRY('F', 'I', 0)
#define CYW43_COUNTRY_FRANCE CYW43_COUNTRY('F', 'R', 0)
#define CYW43_COUNTRY_GERMANY CYW43_COUNTRY('D', 'E', 0)
#define CYW43_COUNTRY_GREECE CYW43_COUNTRY('G', 'R', 0)
#define CYW43_COUNTRY_HONG_KONG CYW43_COUNTRY('H', 'K', 0)
#define CYW43_COUNTRY_HUNGARY CYW43_COUNTRY('H', 'U', 0)
#define CYW43_COUNTRY_ICELAND CYW43_COUNTRY('I', 'S', 0)
#define CYW43_COUNTRY_INDIA CYW43_COUNTRY('I', 'N', 0)
#define CYW43_COUNTRY_ISRAEL CYW43_COUNTRY('I', 'L', 0)
#define CYW43_COUNTRY_ITALY CYW43_COUNTRY('I', 'T', 0)
#define CYW43_COUNTRY_JAPAN CYW43_COUNTRY('J', 'P', 0)
#define CYW43_COUNTRY_KENYA CYW43_COUNTRY('K', 'E', 0)
#define CYW43_COUNTRY_LATVIA CYW43_COUNTRY('L', 'V', 0)
#define CYW43_COUNTRY_LIECHTENSTEIN CYW43_COUNTRY('L', 'I', 0)
#define CYW43_COUNTRY_LITHUANIA CYW43_COUNTRY('L', 'T', 0)
#define CYW43_COUNTRY_LUXEMBOURG CYW43_COUNTRY('L', 'U', 0)
#define CYW43_COUNTRY_MALAYSIA CYW43_COUNTRY('M', 'Y', 0)
#define CYW43_COUNTRY_MALTA CYW43_COUNTRY('M', 'T', 0)
#define CYW43_COUNTRY_MEXICO CYW43_COUNTRY('M', 'X', 0)
#define CYW43_COUNTRY_NETHERLANDS CYW43_COUNTRY('N', 'L', 0)
#define CYW43_COUNTRY_NEW_ZEALAND CYW43_COUNTRY('N', 'Z', 0)
#define CYW43_COUNTRY_NIGERIA CYW43_COUNTRY('N', 'G', 0)
#define CYW43_COUNTRY_NORWAY CYW43_COUNTRY('N', 'O', 0)
#define CYW43_COUNTRY_PERU CYW43_COUNTRY('P', 'E', 0)
#define CYW43_COUNTRY_PHILIPPINES CYW43_COUNTRY('P', 'H', 0)
#define CYW43_COUNTRY_POLAND CYW43_COUNTRY('P', 'L', 0)
#define CYW43_COUNTRY_PORTUGAL CYW43_COUNTRY('P', 'T', 0)
#define CYW43_COUNTRY_SINGAPORE CYW43_COUNTRY('S', 'G', 0)
#define CYW43_COUNTRY_SLOVAKIA CYW43_COUNTRY('S', 'K', 0)
#define CYW43_COUNTRY_SLOVENIA CYW43_COUNTRY('S', 'I', 0)
#define CYW43_COUNTRY_SOUTH_AFRICA CYW43_COUNTRY('Z', 'A', 0)
#define CYW43_COUNTRY_SOUTH_KOREA CYW43_COUNTRY('K', 'R', 0)
#define CYW43_COUNTRY_SPAIN CYW43_COUNTRY('E', 'S', 0)
#define CYW43_COUNTRY_SWEDEN CYW43_COUNTRY('S', 'E', 0)
#define CYW43_COUNTRY_SWITZERLAND CYW43_COUNTRY('C', 'H', 0)
#define CYW43_COUNTRY_TAIWAN CYW43_COUNTRY('T', 'W', 0)
#define CYW43_COUNTRY_THAILAND CYW43_COUNTRY('T', 'H', 0)
#define CYW43_COUNTRY_TURKEY CYW43_COUNTRY('T', 'R', 0)
#define CYW43_COUNTRY_UK CYW43_COUNTRY('G', 'B', 0)
#define CYW43_COUNTRY_USA CYW43_COUNTRY('U', 'S', 0)
#define _PICO_CYW43_ARCH_ARCH_POLL_H 
#define PARAM_ASSERTIONS_ENABLED_PICO_CYW43_ARCH 0
#define PICO_CYW43_ARCH_DEBUG_ENABLED 1
#define PICO_CYW43_ARCH_DEFAULT_COUNTRY_CODE CYW43_COUNTRY_WORLDWIDE
int cyw43_arch_init(void);
int cyw43_arch_init_with_country(uint32_t country);
void cyw43_arch_deinit(void);
async_context_t *cyw43_arch_async_context(void);
void cyw43_arch_set_async_context(async_context_t *context);
async_context_t *cyw43_arch_init_default_async_context(void);
void cyw43_arch_poll(void);
void cyw43_arch_wait_for_work_until(absolute_time_t until);
static inline void cyw43_arch_lwip_begin(void) {
    cyw43_thread_enter();
}
static inline void cyw43_arch_lwip_end(void) {
    cyw43_thread_exit();
}
static inline int cyw43_arch_lwip_protect(int (*func)(void *param), void *param) {
    cyw43_arch_lwip_begin();
    int rc = func(param);
    cyw43_arch_lwip_end();
    return rc;
}
uint32_t cyw43_arch_get_country_code(void);
void cyw43_arch_enable_sta_mode(void);
void cyw43_arch_disable_sta_mode(void);
void cyw43_arch_enable_ap_mode(const char *ssid, const char *password, uint32_t auth);
void cyw43_arch_disable_ap_mode(void);
int cyw43_arch_wifi_connect_blocking(const char *ssid, const char *pw, uint32_t auth);
int cyw43_arch_wifi_connect_bssid_blocking(const char *ssid, const uint8_t *bssid, const char *pw, uint32_t auth);
int cyw43_arch_wifi_connect_timeout_ms(const char *ssid, const char *pw, uint32_t auth, uint32_t timeout);
int cyw43_arch_wifi_connect_bssid_timeout_ms(const char *ssid, const uint8_t *bssid, const char *pw, uint32_t auth, uint32_t timeout);
int cyw43_arch_wifi_connect_async(const char *ssid, const char *pw, uint32_t auth);
int cyw43_arch_wifi_connect_bssid_async(const char *ssid, const uint8_t *bssid, const char *pw, uint32_t auth);
void cyw43_arch_gpio_put(uint wl_gpio, _Bool value);
_Bool cyw43_arch_gpio_get(uint wl_gpio);
#define _PICO_CYW43_ARCH_ARCH_THREADSAFE_BACKGROUND_H 
#define _PICO_LWIP_NOSYS_H 
_Bool lwip_nosys_init(async_context_t *context);
void lwip_nosys_deinit(async_context_t *context);
